Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/climate_change.po
Languages: fr

source: Due to their probabilistic nature, the historical reference values cannot be easily combined with the future deltas. To address this, the ``xhydro.cc.weighted_random_sampling`` and ``xhydro.cc.sampled_indicators`` functions have been designed. Together, these functions will:
fr: En raison de leur nature probabiliste, les valeurs de référence historiques ne peuvent pas être facilement combinées avec les deltas futurs. Pour résoudre ce problème, les fonctions ``xhydro.cc.weighted_random_sampling`` et ``xhydro.cc.sampled_indicators`` ont été conçues. Ensemble, ces fonctions vont :

source: Sample 'n' values from the historical distribution, in accordance with the 'percentile' dimension.
fr: Échantillonner 'n' valeurs de la distribution historique, en fonction de la dimension 'percentile'.

source: Sample 'n' values from the delta distribution, using the provided weights.
fr: Échantillonner 'n' valeurs de la distribution des deltas, en utilisant les poids fournis.

source: Create the future distribution by applying the sampled deltas to the sampled historical distribution element-wise.
fr: Créer la distribution future en appliquant les deltas échantillonnés à la distribution historique échantillonnée élément par élément.

source: Compute the percentiles of the future distribution.
fr: Calculer les percentiles de la distribution future.

source: First, we will sample within the reference dataset to combine the results of the 6 hydrological platforms together.
fr: Tout d'abord, nous allons échantillonner dans le jeu de données de référence pour combiner les résultats des 6 plateformes hydrologiques ensemble.

source: We can do the same for the deltas. Since ``weights`` already contains all dimensions that we want to sample from, we don't need ``include_dims`` here.
fr: Nous pouvons faire de même pour les deltas. Puisque ``weights`` contient déjà toutes les dimensions que nous voulons échantillonner, nous n'avons pas besoin de ``include_dims`` ici.

source: Once the two distributions have been acquired, ``xhydro.cc.sampled_indicators`` can be used to combine them element-wise and reconstruct a future distribution. The resulting distribution will possess the unique dimensions from both datasets. Here, this means that we get a reconstructed distribution for each future horizon.
fr: Une fois que les deux distributions ont été acquises, ``xhydro.cc.sampled_indicators`` peut être utilisé pour les combiner élément par élément et reconstruire une distribution future. La distribution résultante possédera les dimensions uniques des deux jeux de données. Ici, cela signifie que nous obtenons une distribution reconstruite pour chaque horizon futur.

source: Since we used the ``percentiles`` argument, it also computed a series of percentiles.
fr: Puisque nous avons utilisé l'argument ``percentiles``, il a également calculé une série de percentiles.

source: The same statistics as before can also be computed by using the 10,000 samples within ``delta_dist``.
fr: Les mêmes statistiques qu'auparavant peuvent également être calculées en utilisant les 10 000 échantillons dans ``delta_dist``.
