Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/climate_change.po
Languages: fr

source: Climate change analysis of hydrological data
fr: Analyse de l'impact des changements climatiques sur l'hydrologie

source: While there is a vast array of analyses that can be performed to assess the impacts of climate change on hydrology, this notebook covers some of the most common steps:
fr: Bien qu'il existe une vaste gamme d'analyses qui peuvent être effectuées pour évaluer les impacts du changement climatique sur l'hydrologie, ce Notebook couvre quelques-unes des étapes les plus courantes :

source: Computing a list of relevant indicators over climatological periods.
fr: Calculer une liste d'indicateurs pertinents sur des périodes climatologiques.

source: Computing future differences to assess the changes.
fr: Calculer les différences futures pour évaluer les changements.

source: Computing ensemble statistics to evaluate future changes and variability.
fr: Calculer les statistiques d'ensemble pour évaluer les changements et la variabilité futurs.

source: Several functions from the ``xscen`` library have been integrated into ``xhydro`` to simplify access for users, such as those in ``xhydro.indicators`` and ``xhydro.cc``. This notebook will cover the basics, but for further details on these functions, please refer to the following resources:
fr: Plusieurs fonctions de la librairie ``xscen`` ont été intégrées dans ``xhydro`` pour en simplifier l'accès aux utilisateurs, comme celles dans ``xhydro.indicators`` et ``xhydro.cc``. Ce Notebook couvrira les bases, mais pour plus de détails sur ces fonctions, veuillez consulter les ressources suivantes :

source: Computing hydrological indicators over a given time period
fr: Calcul des indicateurs hydrologiques sur une période donnée

source: Hydrological indicators can be categorized into two main types:
fr: Les indicateurs hydrologiques peuvent être classés en deux types principaux :

source: Frequential indicators: These indicators describe hydrological events that occur at recurring intervals. They include metrics like the maximum 20-year flow (``Qmax20``) or the minimum 2-year 7-day average flow in summer (``Q7min2_summer``). The methodology for computing these indicators is covered in the `Local Frequency Analysis <local_frequency_analysis.ipynb>`__ notebook.
fr: Indicateurs fréquentiels : Ces indicateurs décrivent les événements hydrologiques qui se produisent à intervalles réguliers. Ils incluent des métriques comme le débit maximal sur 20 ans (``Qmax20``) ou le débit minimum moyenné sur 7 jours de récurrence 2 ans en été (``Q7min2_summer``). La méthodologie de calcul de ces indicateurs est abordée dans le Notebook `Analyses fréquencielles locales <local_frequency_analysis.ipynb>`__.

source: Non-frequential indicators: These indicators do not explicitly describe recurrence, but rather absolute values or trends in hydrological variables. They include metrics like average yearly flow.
fr: Indicateurs non fréquentiels : Ces indicateurs ne décrivent pas explicitement la récurrence, mais plutôt des valeurs absolues ou des tendances dans les variables hydrologiques. Ils incluent des métriques comme le débit moyen annuel.

source: Since frequential indicators are already covered in another example, this notebook will focus on the methodology for computing non-frequential indicators using ``xhydro.indicators.compute_indicators``. This function is built on top of ``xclim`` and supports both predefined indicators, such as ``xclim.indicator.land.doy_qmax``, as well as custom indicators created using ``xclim.core.indicator.Indicator.from_dict``. The latter option can be quite complex—see the box below for more information. For advanced users, indicator construction can also be defined through a YAML file.
fr: Étant donné que les indicateurs fréquentiels sont déjà couverts dans un autre exemple, ce Notebook se concentrera sur la méthodologie de calcul des indicateurs non fréquentiels en utilisant ``xhydro.indicators.compute_indicators``. Cette fonction est construite sur la base de ``xclim`` et prend en charge à la fois des indicateurs prédéfinis, tels que ``xclim.indicator.land.doy_qmax``, ainsi que des indicateurs personnalisés créés à l'aide de ``xclim.core.indicator.Indicator.from_dict``. Cette dernière option peut être assez complexe—voir la boîte ci-dessous pour plus d'informations. Pour les utilisateurs avancés, la construction d'indicateurs peut également être définie via un fichier YAML.

source: The output of ``xhydro.indicators.compute_indicators`` is a dictionary, where each key represents the frequency of the requested indicators, following the ``pandas`` nomenclature. In our example, we will only use yearly data starting in January, so the frequency will be ``YS-JAN``.
fr: La sortie de ``xhydro.indicators.compute_indicators`` est un dictionnaire, où chaque clé représente la fréquence des indicateurs demandés, suivant la nomenclature ``pandas``. Dans notre exemple, nous n'utiliserons que les données annuelles commençant en janvier, donc la fréquence sera ``YS-JAN``.

source: Custom indicators in ``xHydro`` are built by following the YAML formatting required by ``xclim``.
fr: Les indicateurs personnalisés dans ``xHydro`` sont construits en suivant le formatage YAML requis par ``xclim``.

source: A custom indicator built using ``xclim.core.indicator.Indicator.from_dict`` will need these elements:
fr: Un indicateur personnalisé construit avec ``xclim.core.indicator.Indicator.from_dict`` nécessitera ces éléments :

source: "data": A dictionary with the following information:
fr: "data" : Un dictionnaire avec les informations suivantes :

source: "base": The "YAML ID" obtained from `here <https://xclim.readthedocs.io/en/stable/indicators.html>`__.
fr: "base" : L'"ID YAML" obtenu depuis `cette page <https://xclim.readthedocs.io/en/stable/indicators.html>`__.

source: "input": A dictionary linking the default xclim input to the name of your variable. Needed only if it is different. In the link above, they are the string following "Uses:".
fr: "input" : Un dictionnaire reliant l'entrée xclim par défaut au nom de votre variable. Nécessaire uniquement si elle diffère. Dans le lien ci-dessus, ce sont les chaînes suivant "Uses:".

source: "parameters": A dictionary containing all other parameters for a given indicator. In the link above, the easiest way to access them is by clicking the link in the top-right corner of the box describing a given indicator.
fr: "parameters" : Un dictionnaire contenant tous les autres paramètres pour un indicateur donné. Dans le lien ci-dessus, la manière la plus simple d'y accéder est de cliquer sur le lien dans le coin supérieur droit de la boîte décrivant un indicateur donné."é.

source: More entries can be used here, as described `in the xclim documentation <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__ under "identifier".
fr: Des entrées supplémentaires peuvent être utilisées ici, comme décrit `dans la documentation xclim <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__ sous "identifier".

source: "identifier": A custom name for your indicator. This will be the name returned in the results.
fr: "identifier" : Un nom personnalisé pour votre indicateur. Ce sera le nom retourné dans les résultats.

source: "module": Needed, but can be anything. To prevent an accidental overwriting of ``xclim`` indicators, it is best to use something different from: ["atmos", "land", "generic"].
fr: "module": Nécessaire, mais peut être n'importe quoi. Pour éviter un écrasement accidentel des indicateurs ``xclim``, il est préférable d'utiliser quelque chose de différent de : ["atmos", "land", "generic"].

source: The example file used in this notebook is a daily time series of streamflow data, generated from the HYDROTEL hydrological model. This data is driven by bias-adjusted outputs from the BCC-CSM-1.1(m) climatological model (RCP4.5), spanning the years 1950 to 2100. For this example, the dataset includes data from just 2 stations. The function ``xhydro.indicators.compute_indicators`` can be used with any number of indicators. For this example, we will compute the mean annual flow and the mean summer-fall flow.
fr: Le fichier d'exemple utilisé dans ce Notebook est une série temporelle quotidienne des débits, générée à partir du modèle hydrologique HYDROTEL. Ces données sont pilotées par des sorties post-traitées du modèle climatique BCC-CSM-1.1(m) (RCP4.5), couvrant les années 1950 à 2100. Pour cet exemple, le jeu de données comprend des données de seulement 2 stations. La fonction ``xhydro.indicators.compute_indicators`` peut être utilisée avec n'importe quel nombre d'indicateurs. Pour cet exemple, nous allons calculer le débit moyen annuel et le débit moyen été-automne.

source: The next step is to compute averages over climatological periods. This can be done using the ``xhydro.cc.climatological_op`` function.
fr: La prochaine étape consiste à calculer des moyennes sur des périodes climatiques. Cela peut être fait en utilisant la fonction ``xhydro.cc.climatological_op``.

source: If the indicators themselves are not relevant to your analysis and you only need the climatological averages, you can directly use ``xhydro.cc.produce_horizon`` instead of combining ``xhydro.indicators.compute_indicators`` with ``xhydro.cc.climatological_op``. The key advantage of ``xhydro.cc.produce_horizon`` is that it eliminates the ``time`` axis, replacing it with a ``horizon`` dimension that represents a slice of time. This is particularly useful when computing indicators with different output frequencies. An example of this approach is provided in the `Use Case Example <use_case.ipynb>`__.
fr: Si les indicateurs eux-mêmes ne sont pas pertinents pour votre analyse et que vous n'avez besoin que des moyennes climatiques, vous pouvez directement utiliser ``xhydro.cc.produce_horizon`` au lieu de combiner ``xhydro.indicators.compute_indicators`` avec ``xhydro.cc.climatological_op``. L'avantage clé de ``xhydro.cc.produce_horizon`` est qu'il élimine l'axe ``time``, le remplaçant par une dimension ``horizon`` représentant une tranche de temps. Cela est particulièrement utile lors du calcul d'indicateurs avec des fréquences de sortie différentes. Un exemple de cette approche est fourni dans l'`exemple d'application <use_case.ipynb>`__.

source: Once the averages over time periods have been computed, calculating the differences between future and past values is straightforward. Simply call ``xhydro.cc.compute_deltas`` to perform this calculation.
fr: Une fois les moyennes sur les périodes de temps calculées, calculer les différences entre les valeurs futures et passées est simple. Il suffit d'appeler ``xhydro.cc.compute_deltas`` pour effectuer ce calcul.

source: Ensemble statistics
fr: Statistiques d'ensemble

source: In a real-world application, the steps outlined so far would need to be repeated for all available hydroclimatological simulations. For this example, we will work with a subset of pre-computed deltas from the RCP4.5 simulations used in the 2022 Hydroclimatic Atlas of Southern Quebec.
fr: Dans une application réelle, les étapes décrites jusqu'à présent devraient être répétées pour toutes les simulations hydroclimatiques disponibles. Pour cet exemple, nous travaillerons avec un sous-ensemble de deltas pré-calculés des simulations RCP4.5 utilisées dans l'édition 2022 de l'Atlas hydroclimatique du Québec méridional.

source: It is considered good practice to use multiple climate models when performing climate change analyses, especially since the impacts on the hydrological cycle can be nonlinear. Once multiple hydrological simulations are completed and ready for analysis, you can use ``xhydro.cc.ensemble_stats`` to access a variety of functions available in ``xclim.ensemble``, such as calculating ensemble quantiles or assessing the agreement on the sign of change.
fr: Il est recommandé d'utiliser plusieurs modèles climatiques lors de l'analyse des changements climatiques, surtout que les impacts sur le cycle hydrologique peuvent être non linéaires. Une fois plusieurs simulations hydrologiques complétées et prêtes pour l'analyse, vous pouvez utiliser ``xhydro.cc.ensemble_stats`` pour accéder à une variété de fonctions disponibles dans ``xclim.ensemble``, telles que le calcul des quantiles d'ensemble ou l'évaluation de l'accord sur le signe du changement.

source: Weighting simulations
fr: Pondération des simulations

source: When the ensemble of climate models is heterogeneous—such as when one model provides more simulations than others—it is recommended to weight the results accordingly. While this functionality is not currently available directly through ``xhydro`` (as it expects metadata specific to ``xscen`` workflows), the ``xscen.generate_weights`` function can help create an approximation of the weights based on available metadata.
fr: Lorsque l'ensemble de modèles climatiques est hétérogène—par exemple, lorsqu'un modèle fournit plus de simulations que les autres—il est recommandé de pondérer les résultats en conséquence. Bien que cette fonctionnalité ne soit pas actuellement disponible directement via ``xHydro`` (car elle attend des métadonnées spécifiques aux flux de travail ``xscen``), la fonction ``xscen.generate_weights`` peut aider à créer une approximation des poids en fonction des métadonnées disponibles.

source: The following attributes are required for the function to work properly:
fr: Les attributs suivants sont nécessaires pour que la fonction fonctionne correctement :

source: ``'cat:source'`` in all datasets
fr: ``'cat:source'`` dans tous les jeux de données

source: ``'cat:driving_model'`` in regional climate models
fr: ``'cat:driving_model'`` dans les modèles climatiques régionaux

source: ``'cat:institution'`` in all datasets (if ``independence_level='institution'``)
fr: ``'cat:institution'`` dans tous les jeux de données (si ``independence_level='institution'``)

source: ``'cat:experiment'`` in all datasets (if ``split_experiments=True``)
fr: ``'cat:experiment'`` dans tous les jeux de données (si ``split_experiments=True``)

source: The ``xscen.generate_weights`` function offers three possible independence levels:
fr: La fonction ``xscen.generate_weights`` propose trois niveaux d'indépendance possibles :

source: ``model`` (1 Model - 1 Vote): This assigns a total weight of 1 to all unique combinations of ``'cat:source'`` and ``'cat:driving_model'``.
fr: ``model`` (1 Modèle - 1 Vote) : Cela attribue un poids total de 1 à toutes les combinaisons uniques de ``'cat:source'`` et ``'cat:driving_model'``.

source: ``GCM`` (1 GCM - 1 Vote): This assigns a total weight of 1 to all unique global climate models (GCMs), effectively averaging together regional climate simulations that originate from the same driving model.
fr: ``GCM`` (1 GCM - 1 Vote) : Cela attribue un poids total de 1 à tous les modèles climatiques globaux (GCM), en moyennant les simulations climatiques régionales provenant du même modèle pilote.

source: ``institution`` (1 institution - 1 Vote): This assigns a total weight of 1 to all unique ``'cat:institution'`` values.
fr: ``institution`` (1 institution - 1 vote) : Cela attribue un poids total de 1 à toutes les valeurs uniques ``'cat:institution'``.

source: In all cases, the "total weight of 1" is not distributed equally between the involved simulations. The function will attempt to respect the model genealogy when distributing the weights. For example, if an institution has produced 4 simulations from Model A and 1 simulation from Model B, using ``independence_level='institution'`` would result in a weight of 0.125 for each Model A run and 0.5 for the single Model B run.
fr: Dans tous les cas, le "poids total de 1" n'est pas réparti de manière égale entre les simulations impliquées. La fonction tentera de respecter la généalogie du modèle lors de la distribution des poids. Par exemple, si une institution a produit 4 simulations du Modèle A et 1 simulation du Modèle B, l'utilisation de ``independence_level='institution'`` donnerait un poids de 0,125 pour chaque simulation du Modèle A et 0,5 pour la simulation unique du Modèle B.

source: Ensemble statistics with deterministic reference data
fr: Statistiques d'ensemble avec des données de référence déterministes

source: In most cases, you will have deterministic data for the reference period. This means that, for a given location, the 30-year average for a specific indicator is represented by a single value.
fr: Dans la plupart des cas, vous disposerez de données déterministes pour la période de référence. Cela signifie que, pour un lieu donné, la moyenne sur 30 ans d'un indicateur spécifique est représentée par une seule valeur.

source: Given that biases may still persist in climate simulations even after bias adjustment, which can impact hydrological modeling, we need to employ a perturbation technique to combine data over the reference period with climate simulations. This is particularly important in hydrology, where nonlinear interactions between climate and hydrological indicators can be significant. Multiple other methodologies exist for combining observed and simulated data, but comparing various approaches goes beyond the scope of this example.
fr: Étant donné que des biais peuvent encore persister dans les simulations climatiques même après ajustement des biais, ce qui peut affecter la modélisation hydrologique, nous devons employer une technique de perturbation pour combiner les données sur la période de référence avec les simulations climatiques. Cela est particulièrement important en hydrologie, où les interactions non linéaires entre le climat et les indicateurs hydrologiques peuvent être significatives. Plusieurs autres méthodologies existent pour combiner les données observées et simulées, mais la comparaison des différentes approches dépasse le cadre de cet exemple.

source: The perturbation technique involves calculating ensemble percentiles on the deltas and then applying those percentiles to the reference dataset. For this example, we'll compute the 10th, 25th, 50th, 75th, and 90th percentiles of the ensemble, as well as the agreement on the sign of the change, using the ``xhydro.cc.ensemble_stats`` function.
fr: La technique de perturbation consiste à calculer les percentiles de l'ensemble sur les deltas, puis à appliquer ces percentiles au jeu de données de référence. Pour cet exemple, nous allons calculer les 10e, 25e, 50e, 75e et 90e percentiles de l'ensemble, ainsi que l'accord sur le signe du changement, en utilisant la fonction ``xhydro.cc.ensemble_stats``.

source: This results in a large amount of data with many unique variables. To simplify the results, we'll compute three new statistics:
fr: Cela entraîne une grande quantité de données avec de nombreuses variables uniques. Pour simplifier les résultats, nous allons calculer trois nouvelles statistiques :

source: The median change.
fr: Le changement médian.

source: The interquartile range of the change.
fr: L'écart interquartile du changement.

source: The agreement between models using the IPCC categories.
fr: L'accord entre les modèles en utilisant les catégories du GIEC.

source: The last statistic is slightly more complex. For more details on the categories of agreement for the sign of change, refer to the technical summary in "Climate Change 2021 – The Physical Science Basis: Working Group I Contribution to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change", `Cross-Chapter Box 1 <https://www.cambridge.org/core/books/climate-change-2021-the-physical-science-basis/atlas/24E1C016DBBE4725BDFBC343695DE7DB>`__.
fr: La dernière statistique est légèrement plus complexe. Pour plus de détails sur les catégories d'accord sur le signe du changement, consultez le résumé technique dans "Climate Change 2021 – The Physical Science Basis: Working Group I Contribution to the Sixth Assessment Report of the Intergovernmental Panel on Climate Change", `Cross-Chapter Box 1 <https://www.cambridge.org/core/books/climate-change-2021-the-physical-science-basis/atlas/24E1C016DBBE4725BDFBC343695DE7DB>`__.

source: To compute this, you can use the results produced by ``robustness_fractions``, but it needs a call to the function ``xclim.ensembles.robustness_categories``. The thresholds and operations require two entries: the first is related to the significance test, and the second refers to the percentage of simulations showing a positive delta. For example, "Agreement towards increase" is met if more than 66% of simulations show a significant change, and 80% of simulations see a positive change.
fr: Pour le calculer, vous pouvez utiliser les résultats produits par ``robustness_fractions``, mais cela nécessite un appel à la fonction ``xclim.ensembles.robustness_categories``. Les seuils et opérations requièrent deux entrées : la première est liée au test de significativité, et la seconde fait référence au pourcentage de simulations montrant un delta positif. Par exemple, "Accord envers une augmentation" est satisfait si plus de 66% des simulations montrent un changement significatif, et 80% des simulations montrent un changement positif.

source: Finally, using a perturbation method, future values for QMOYAN can be obtained by multiplying the reference indicator with the percentiles of the ensemble deltas.
fr: Enfin, en utilisant une méthode de perturbation, les valeurs futures pour QMOYAN peuvent être obtenues en multipliant l'indicateur de référence avec les percentiles des delta de l'ensemble.

source: Ensemble statistics with probabilistic reference data
fr: Statistiques d'ensemble avec des données de référence probabilistes

source: This method is similar to the previous section, but it applies to cases like the `Hydrological Atlas of Southern Quebec <https://cehq.gouv.qc.ca/atlas-hydroclimatique/>`__ or results from the `Optimal Interpolation <optimal_interpolation.ipynb>`__ notebook, where hydrological indicators for the historical period are represented by a probability density function (PDF) rather than a single discrete value. In such cases, the ensemble percentiles cannot simply be multiplied by the reference value.
fr: Cette méthode est similaire à la section précédente, mais elle s'applique à des cas comme l'`Atlas hydroclimatique du Québec méridional <https://cehq.gouv.qc.ca/atlas-hydroclimatique/>`__ ou les résultats du Notebook `Interpolation optimale <optimal_interpolation.ipynb>`__, où les indicateurs hydrologiques pour la période historique sont représentés par une fonction de densité de probabilité (PDF) plutôt que par une seule valeur discrète. Dans de tels cas, les percentiles de l'ensemble ne peuvent pas simplement être multipliés par la valeur de référence.

source: In this example, instead of a single value, ``QMOYAN`` is represented by 21 percentiles that capture the uncertainty surrounding this statistic. Similar to the future simulations, we also have 6 hydrological platforms to consider.
fr: Dans cet exemple, au lieu d'une seule valeur, ``QMOYAN`` est représenté par 21 percentiles qui capturent l'incertitude entourant cette statistique. Comme pour les simulations futures, nous avons également 6 plateformes hydrologiques à prendre en compte.

source: WARNING
fr: AVERTISSEMENT

source: In these cases, the percentiles in ``ref`` represent uncertainty (e.g., related to hydrological modeling or input data uncertainty), not interannual variability. At this stage, the temporal average should already have been calculated.
fr: Dans ces cas, les percentiles dans ``ref`` représentent l'incertitude (par exemple, liée à la modélisation hydrologique ou à l'incertitude des données d'entrée), et non la variabilité interannuelle. À ce stade, la moyenne temporelle devrait déjà avoir été calculée.
