Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/hydrological_modelling_raven.po
Languages: fr

source: ``.rvt``: Update observed streamflow and meteorological data, including the grid cell weights if relevant. This should be done with caution, as HRU characteristics, such as the subbasin IDs, will *not* be updated. If the HRU within the model has changed, there is currently no way to modify existing files. They should be deleted and recreated using the ``.create_rv()`` method.
fr: ``rvt`` : Met à jour le débit observé et les données météorologiques, y compris les poids des points de grille si pertinent. Cela doit être fait avec prudence, car les caractéristiques de HRU, telles que les ID de sous-bassin, ne seront *pas* mises à jour. Si le HRU au sein du modèle a changé, il n'y a actuellement aucun moyen de modifier les fichiers existants. Ils doivent être supprimés et recréés à l'aide de la méthode ``.create_rv()``.

source: Model Calibration
fr: Calage du modèle

source: When building a model from scratch, a calibration step is necessary to find the optimal set of parameters. Model calibration involves a loop of several iterations, where: model parameters are selected, the model is run, and the results are compared to observed data. In ``xHydro``, the calibration function utilizes ``SPOTPY`` to carry out the optimization process.
fr: Lors de la création d'un modèle à partir de zéro, une étape de calage est nécessaire pour trouver l'ensemble optimal de paramètres. Le calage du modèle implique une boucle de plusieurs itérations, où : les paramètres du modèle sont sélectionnés, le modèle est exécuté, et les résultats sont comparés aux données observées. Dans ``xHydro``, la fonction de calage utilise ``SPOTPY`` pour réaliser le processus d'optimisation.

source: The calibration function still uses the ``model_config`` dictionary created earlier, but now within the ``xh.modelling.perform_calibration`` function.
fr: La fonction de calage utilise toujours le dictionnaire ``model_config`` créé précédemment, mais maintenant au sein de la fonction ``xh.modelling.perform_calibration``.

source: We can prepare the additional arguments required by the calibration function. A good calibration process should always exclude some data from the computation of the objective function to ensure a validation period. This can be achieved using the ``mask`` argument, which uses an array of 0 and 1.
fr: Nous pouvons préparer les arguments supplémentaires nécessaires à la fonction de calibration. Un bon processus de calibration doit toujours exclure certaines données du calcul de la fonction objectif, afin de garantir une période de validation indépendante. Cela peut être réalisé en utilisant l'argument ``mask``, qui utilise un array de 0 et 1.

source: This example will only use 10 evaluations to cut on computing time, but a real calibration should rely on at least 500 iterations with simple models such as GR4JCN.
fr: Cet exemple n'utilisera que 10 évaluations pour réduire le temps de calcul, mais un calage réel devrait reposer sur au moins 500 itérations avec des modèles simples tels que GR4JCN.
