Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/hydrological_modelling.po
Languages: fr

source: Hydrological modelling module
fr: Module de modélisation hydrologique

source: INFO ``xhydro`` provides tools to execute and calibrate hydrological models, but will not prepare the model itself. This should be done beforehand.
fr: INFO ``xhydro`` fournit des outils pour exécuter et calibrer des modèles hydrologiques, mais ne préparera pas le modèle lui-même. Cela devrait être fait au préalable.

source: ``xhydro`` provides a collection of functions that can serve as the main entry point for hydrological modelling. The entire framework is based on the ``xh.modelling.hydrological_model`` function and its ``model_config`` dictionary, which is meant to contain all necessary information to execute the given hydrological model. For example, depending on the model, it can store meteorological datasets directly, paths to datasets (netCDF files or other), csv configuration files, parameters, and basically anything that is required to configure and execute an hydrological model.
fr: ``xhydro`` fournit une collection de fonctions qui peuvent servir de point d'entrée principal pour la modélisation hydrologique. L'ensemble du framework est basé sur la fonction ``xh.modelling.hydrological_model`` et son dictionnaire ``model_config``, qui contient toutes les informations nécessaires pour exécuter le modèle hydrologique donné. Par exemple, selon le modèle, il peut stocker directement des ejeux de données météorologiques, des chemins d'accès aux jeux de données (fichiers netCDF ou autres), des fichiers de configuration csv, des paramètres et, fondamentalement, tout ce qui est nécessaire pour configurer et exécuter un modèle hydrologique.

source: It then becomes the User's responsibility to ensure that all required information for a given model are provided in the ``model_config`` object, both in the data preparation stage and in the hydrological model implementation. This can be addressed by calling the ``xh.modelling.get_hydrological_model_inputs`` function to get a list of the required keys for a given model, as well as the documentation. Parameters for that function are: - ``model_name``: As listed below. - ``required_only``: Whether to return all possible inputs, or only the required ones.
fr: Il incombe alors à l'utilisateur de s'assurer que toutes les informations requises pour un modèle donné sont fournies dans l'objet ``model_config``, tant lors de l'étape de préparation des données que lors de la mise en œuvre du modèle hydrologique. Ceci peut être résolu en appelant la fonction ``xh.modelling.get_hydrological_model_inputs`` pour obtenir une liste des clés requises pour un modèle donné, ainsi que la documentation. Les paramètres de cette fonction sont : - ``model_name`` : Comme indiqué ci-dessous. - ``required_only`` : s'il faut renvoyer toutes les entrées possibles, ou seulement celles requises.

source: Currently available models are: - ``Hydrotel`` - ``Dummy`` (only used for testing purposes)
fr: Les modèles actuellement disponibles sont : - ``Hydrotel`` - ``Dummy`` (utilisé uniquement à des fins de tests)

source: Hydrological models can differ from one another in terms of required inputs and available functions, but an effort will be made to homogenize them as much as possible as new models get added. Currently, all models have these 3 functions: - ``.run()`` which will execute the model, reformat the outputs to be compatible with analysis tools in ``xhydro``, then return the simulated streamflows as a ``xarray.Dataset``. - The streamflow will be called ``streamflow`` and have units in ``m3 s-1``. - In the case of 1D data (such as hydrometric stations), that dimension in the dataset will be identified trough a ``cf_role: timeseries_id`` attribute. - ``.get_inputs()`` to retrieve the meteorological inputs. - ``.get_streamflow()`` to retrieve the simulated streamflow.
fr: Les modèles hydrologiques peuvent différer les uns des autres en termes d’intrants requis et de fonctions disponibles, mais un effort sera fait pour les homogénéiser autant que possible à mesure que de nouveaux modèles seront ajoutés. Actuellement, tous les modèles ont ces 3 fonctions : - ``.run()`` qui exécutera le modèle, reformatera les sorties pour être compatible avec les outils d'analyse dans ``xhydro``, puis renverra les débits simulés sous forme de ``xarray.Dataset``. - Les débits seront appelés ``streamflow`` et auront des unités en ``m3 s-1``. - Dans le cas de données 1D (telles que les stations hydrométriques), cette dimension dans le jeu de données sera identifiée via un attribut ``cf_role: timeseries_id``. - ``.get_inputs()`` pour récupérer les entrées météorologiques. - ``.get_streamflow()`` pour récupérer les débits simulés.

source: Initialising the model (e.g. Hydrotel)
fr: Initialisation du modèle (ex : Hydrotel)

source: The following example will use the Hydrotel model. It is on the more complex side, with most of its parameters hidden within configurations files, but ``xhydro`` can be used to easily update configuration files, validate the project directory and the meteorological inputs, execute the model, and reformat the outputs to be more inline with CF conventions and other functions within ``xhydro``.
fr: L'exemple suivant utilisera le modèle Hydrotel. Il est plus complexe, avec la plupart de ses paramètres cachés dans les fichiers de configuration, mais ``xhydro`` peut être utilisé pour facilement mettre à jour les fichiers de configuration, valider le répertoire du projet et les entrées météorologiques, exécuter le modèle et reformater les sorties pour être plus conformes aux conventions CF et aux autres fonctions de ``xhydro``.

source: Do note that ``xhydro`` does not prepare the project directory itself, which should be done beforehand. What the class does, when initiating a new instance of ``xhydro.modelling.Hydrotel``, is allow control on the entries located in the three main configuration files: the project file, ``simulation.csv``, and ``output.csv``. The other arguments for the class, as obtained from ``get_hydrological_model_inputs``, are listed above. At any time after initialising the class, ``update_config()`` can be called to update the three configuration files. When called, this function will overwrite the CSV files on disk.
fr: Notez que ``xhydro`` ne prépare pas le répertoire du projet lui-même, ce qui devrait être fait au préalable. Ce que fait la classe, lors du lancement d'une nouvelle instance de ``xhydro.modelling.Hydrotel``, c'est autoriser le contrôle sur les entrées situées dans les trois fichiers de configuration principaux : le fichier de projet, ``simulation.csv`` et ``output.csv``. Les autres arguments pour la classe, obtenus à partir de ``get_hydrological_model_inputs``, sont listés ci-dessus. A tout moment après l'initialisation de la classe, ``update_config()`` peut être appelée pour mettre à jour les trois fichiers de configuration. Lorsqu'elle est appelée, cette fonction écrasera les fichiers CSV sur le disque.

source: For HYDROTEL, ``DATE DEBUT (start date), DATE FIN (end date), and PAS DE TEMPS (timestep frequency)`` will always need to be specified, so these need to be added to ``simulation_config`` if they don't already exist in ``simulation.csv``. Additionally, either ``FICHIER STATIONS METEO (meteorological stations file)`` or ``FICHIER GRILLE METEO (meteorological grid file)`` need to be specified to guide the model towards the meteorological data.
fr: Pour HYDROTEL, ``DATE DEBUT, DATE FIN et PAS DE TEMPS`` devront toujours être spécifiés. Ils doivent donc être ajoutés à ``simulation_config`` s'ils n'existent pas déjà dans ``simulation.csv``. De plus, soit ``FICHIER STATIONS METEO (fichier des stations météorologiques)`` soit ``FICHIER GRILLE METEO (fichier de grille météorologique)`` doivent être spécifiés pour guider le modèle vers les données météorologiques.

source: If using the defaults, streamflow for all river reaches will be outputted. You can modify ``output.csv`` to change that behaviour.
fr: Si vous utilisez les valeurs par défaut, le débit de tous les tronçons de rivière sera affiché. Vous pouvez modifier ``output.csv`` pour changer ce comportement.

source: Validating the meteorological data
fr: Validation des données météorologiques

source: A few basic checks will be automatically performed prior to executing hydrological models, but a user might want to perform more advanced health checks (e.g. unrealistic meteorological inputs). This is possible through the use of ``xhydro.utils.health_checks``. Consult `the 'xscen' documentation <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__ for the full list of possible checks.
fr: Quelques contrôles de base seront automatiquement effectués avant d'exécuter des modèles hydrologiques, mais un utilisateur avancé pourrait souhaiter effectuer des contrôles de santé plus avancés (par exemple, des entrées météorologiques irréalistes). Ceci est possible grâce à l'utilisation de ``xhydro.utils.health_checks``. Consultez la documentation 'xscen' <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__ pour la liste complète des vérifications possibles.

source: In this example, we'll make sure that there are no abnormal meteorological values or sequence of values. Since the data used for this example is fake, this will raise some flags.
fr: Dans cet exemple, nous veillerons à ce qu'il n'y ait pas de valeurs météorologiques ou de séquences de valeurs anormales. Étant donné que les données utilisées pour cet exemple sont fausses, cette fonction déclenchera certains signaux d'alarme.

source: Executing the model
fr: Exécution du modèle

source: In most cases, a few basic checkups will be performed prior to executing the model, when the ``run()`` function is called. In the case of Hydrotel, these checks will be made:
fr: Dans la plupart des cas, quelques vérifications de base seront effectuées avant d'exécuter le modèle, lorsque la fonction ``run()`` est appelée. Dans le cas d'Hydrotel, ces vérifications seront effectuées :

source: All files mentioned in the configuration exist.
fr: Tous les fichiers mentionnés dans la configuration existent.

source: The meteorological dataset has the dimensions, coordinates, and variables named in its configuration file (e.g. ``SLNO_meteo_GC3H.nc.config``, in this example).
fr: Le jeu de données météorologiques a les dimensions, coordonnées et variables nommées dans son fichier de configuration (par exemple ``SLNO_meteo_GC3H.nc.config``, dans cet exemple).

source: The dataset has a standard calendar.
fr: Le jeu de données a un calendrier standard.

source: The frequency is uniform (i.e. all time steps are equally spaced).
fr: La fréquence est uniforme (c'est-à-dire que tous les pas de temps sont équidistants).

source: The start and end dates are contained in the dataset.
fr: Les dates de début et de fin sont contenues dans le jeu de données.

source: The dataset is complete (i.e. no missing values).
fr: Le jeu de données est complet (c'est-à-dire aucune valeur manquante).

source: Only when those checks are satisfied will the function actually execute the model. In addition, specific to Hydrotel, the following arguments can be called:
fr: Ce n’est que lorsque ces vérifications seront satisfaites que la fonction exécutera réellement le modèle. De plus, spécifiques à Hydrotel, on peut citer les arguments suivants :

source: ``check_missing``: *bool*. Whether to verify for missing data or not. Since this can be very time-consuming, it is False by default.
fr: ``check_missing`` : *bool*. S'il faut vérifier les données manquantes ou non. Comme cela peut prendre beaucoup de temps, la valeur par défaut est False.

source: ``dry_run``: *bool*. Put at True to simply print the command line, without executing it.
fr: ``dry_run`` : *bool*. Mettez True pour imprimer simplement la ligne de commande, sans l'exécuter.

source: Once the model has been executed, ``xhydro`` will automatically reformat the NetCDF to bring it closer to CF conventions and make it compatible with other ``xhydro`` modules. Note that for Hydrotel, this reformatting currently only supports the DEBITS_AVAL (outgoing streamflow) output option.
fr: Une fois le modèle exécuté, ``xhydro`` reformatera automatiquement le NetCDF pour le rapprocher des conventions CF et le rendre compatible avec les autres modules ``xhydro``. Notez que pour Hydrotel, ce reformatage ne prend actuellement en charge que l'option de sortie DEBITS_AVAL.

source: Model calibration
fr: Calage du modèle

source: WARNING This is still a work-in-progress. Only the Dummy is currently implemented.
fr: AVERTISSEMENT Ceci est encore un travail en cours. Seul le Dummy est actuellement implémenté.

source: Model calibration consists of a loop of multiple instances where: model parameters are chosen, the model is run, the results are compared to observations. The calibration functions in ``xhydro`` rely on ``SPOTPY`` to perform the optimization process.
fr: Le calage du modèle consiste en une boucle de plusieurs instances où : les paramètres du modèle sont choisis, le modèle est exécuté, les résultats sont comparés aux observations. Les fonctions de calage dans ``xhydro`` s'appuient sur ``SPOTPY`` pour effectuer le processus d'optimisation.

source: When using the calibration module, 2 additional keywords are required for the ``model_config``: - ``Qobs``: Contains the observed streamflow used as the calibration target. - ``parameters``: While not necessary to provide this, it is a reserved keyword used by the optimizer.
fr: Lors de l'utilisation du module de calage, 2 arguments supplémentaires sont requis pour le ``model_config`` : - ``Qobs`` : Contient les débits observés utilisés comme cible de calage. - ``parameters`` : Bien qu'il ne soit pas nécessaire de fournir cela, il s'agit d'un mot-clé réservé utilisé par l'optimiseur.

source: The calibration function, ``xh.modelling.perform_calibration``, has these parameters:
fr: La fonction de calage, ``xh.modelling.perform_calibration``, a ces paramètres :
