Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/hydrological_modelling_hydrotel.po
Languages: fr

source: Hydrological modelling - HYDROTEL
fr: Modélisation hydrologique - HYDROTEL

source: WARNING
fr: AVERTISSEMENT

source: ``xHydro`` provides tools to execute HYDROTEL, but will not prepare the model itself. This should be done beforehand.
fr: ``xHydro`` fournit des outils pour exécuter HYDROTEL, mais ne préparera pas le modèle lui-même. Cela doit être fait au préalable.

source: The HYDROTEL executable can be acquired from this `GitHub repository <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__.
fr: L'exécutable HYDROTEL peut être acquis à partir de ce dépôt GitHub <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__.

source: ``xHydro`` provides a collection of functions designed to facilitate hydrological modelling, focusing on two key models: `HYDROTEL <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__ and a suite of models emulated by the `Raven Hydrological Framework <https://raven.uwaterloo.ca/>`__. It is important to note that Raven already possesses an extensive Python library, `RavenPy <https://github.com/CSHS-CWRA/RavenPy>`__, which enables users to build, calibrate, and execute models. ``xHydro`` wraps some of these functions to support multi-model assessments with HYDROTEL, though users seeking advanced functionalities may prefer to use ``RavenPy`` directly.
fr: ``xHydro`` propose une collection de fonctions conçues pour faciliter la modélisation hydrologique, en se concentrant sur deux modèles clés : `HYDROTEL <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__ et une suite de modèles émulés par le `Raven Hydrological Framework <https://raven.uwaterloo.ca/>`__. Il est important de noter que Raven dispose déjà d'une vaste librairie Python, `RavenPy <https://github.com/CSHS-CWRA/RavenPy>`__, qui permet aux utilisateurs de construire, calibrer et exécuter des modèles. ``xHydro`` encapsule certaines de ces fonctions pour soutenir les évaluations multi-modèles avec HYDROTEL, mais les utilisateurs recherchant des fonctionnalités avancées préféreront utiliser ``RavenPy`` directement.

source: The primary contribution of ``xHydro`` to hydrological modelling is thus its support for HYDROTEL, a model that previously lacked a dedicated Python library. However, building a HYDROTEL project is best done using PHYSITEL and the HYDROTEL GUI, both of which are proprietary software. Therefore, for the time being, ``xHydro`` is designed to facilitate the execution and modification of an already established HYDROTEL project, rather than assist in building one from scratch.
fr: La principale contribution de ``xHydro`` à la modélisation hydrologique est donc son soutien à HYDROTEL, un modèle qui manquait auparavant d'une librairie Python dédiée. Cependant, la construction d'un projet HYDROTEL est mieux réalisée en utilisant PHYSITEL et l'interface graphique d'HYDROTEL, qui sont des logiciels propriétaires. Par conséquent, pour l'instant, ``xHydro`` est conçu pour faciliter l'exécution et la modification d'un projet HYDROTEL déjà établi, plutôt que d'aider à en construire un depuis zéro.

source: A similar Notebook to this one, but that covers ``RavenPy`` models, is available `here <hydrological_modelling_raven.ipynb>`__.
fr: Un Notebook similaire à celui-ci, mais qui couvre les modèles ``RavenPy``, est disponible `ici <hydrological_modelling_raven.ipynb>`__.

source: Basic information
fr: Informations de base

source: The ``xHydro`` modelling framework is based on a ``model_config`` dictionary, which is meant to contain all necessary information to execute a given hydrological model. For example, depending on the model, it can store meteorological datasets directly, paths to datasets (netCDF files or other), csv configuration files, parameters, and basically anything that is required to configure and execute an hydrological model.
fr: Le cadre de modélisation ``xHydro`` est basé sur un dictionnaire ``model_config``, qui est censé contenir toutes les informations nécessaires pour exécuter un modèle hydrologique donné. Par exemple, en fonction du modèle, il peut stocker directement les jeux de données météorologiques, les chemins vers ces jeux de données (fichiers netCDF ou autres), les fichiers de configuration csv, les paramètres, et fondamentalement tout ce qui est nécessaire pour configurer et exécuter un modèle hydrologique.

source: The list of required inputs for the dictionary can be obtained one of two ways. The first is to look at the hydrological model's class, such as ``xhydro.modelling.Hydrotel``. The second is to use the ``xh.modelling.get_hydrological_model_inputs`` function to get a list of the required keys for a given model, as well as the documentation.
fr: La liste des entrées requises pour le dictionnaire peut être obtenue de deux façons. La première consiste à regarder la classe du modèle hydrologique, comme ``xhydro.modelling.Hydrotel``. La seconde consiste à utiliser la fonction ``xh.modelling.get_hydrological_model_inputs`` pour obtenir la liste des clés requises pour un modèle donné, ainsi que sa documentation.

source: HYDROTEL and Raven vary in terms of required inputs and available functions, but an effort will be made to standardize the outputs as much as possible. Currently, all models include the following three functions:
fr: HYDROTEL et Raven varient en termes d'entrées requises et de fonctions disponibles, mais un effort sera fait pour standardiser les sorties autant que possible. Actuellement, tous les modèles incluent les trois fonctions suivantes :

source: ``.run()``: Executes the model, reformats the outputs to be compatible with analysis tools in ``xHydro``, and returns the simulated streamflow as a ``xarray.Dataset``.
fr: ``.run()`` : Exécute le modèle, reformate les sorties pour être compatibles avec les outils d'analyse dans ``xHydro``, et retourne le débit simulé en tant que ``xarray.Dataset``.

source: The streamflow variable will be named ``streamflow`` and will have units of ``m3 s-1``.
fr: La variable de débit sera nommée ``streamflow`` et aura pour unités ``m3 s-1``.

source: For 1D data (such as hydrometric stations), the corresponding dimension in the dataset will be identified by the ``cf_role: timeseries_id`` attribute.
fr: Pour les données 1D (comme les stations hydrométriques), la dimension correspondante dans le jeux de données sera identifiée par l'attribut ``cf_role: timeseries_id``.

source: ``.get_inputs()``: Retrieves the meteorological inputs used by the model.
fr: ``.get_inputs()`` : Récupère les entrées météorologiques utilisées par le modèle.

source: ``.get_streamflow()``: Retrieves the simulated streamflow output from the model.
fr: ``.get_streamflow()`` : Récupère la sortie de débit simulé du modèle.

source: Initializing and running a calibrated model
fr: Initialisation et exécution d'un modèle calé

source: A typical HYDROTEL project consists of multiple subfolders and files that describe meteorological inputs, watershed characteristics, and more. An example is given in the cell below. The model primarily relies on three key files:
fr: Un projet HYDROTEL typique se compose de plusieurs sous-dossiers et fichiers qui décrivent les entrées météorologiques, les caractéristiques du bassin versant, et plus encore. Un exemple est donné dans la cellule ci-dessous. Le modèle repose principalement sur trois fichiers clés :

source: A project file located in the main directory, which may have any given name (e.g., ``SLNO.csv``).
fr: Un fichier de projet situé dans le répertoire principal, qui peut avoir n'importe quel nom (par exemple, ``SLNO.csv``).

source: A ``simulation/simulation/simulation.csv`` file that manages all the parameters for the run, including simulation dates, the path to meteorological data, and the physical processes to be used.
fr: Un fichier ``simulation/simulation/simulation.csv`` qui gère tous les paramètres de l'exécution, y compris les dates de simulation, le chemin vers les données météorologiques, et les processus physiques à utiliser.

source: A ``simulation/simulation/output.csv`` file that specifies which results to produce, such as which variables and river reaches to output results for.
fr: Un fichier ``simulation/simulation/output.csv`` qui spécifie les résultats à produire, comme les variables et les tronçons de rivière pour lesquels les résultats sont générés.

source: When initializing a ``Hydrotel`` instance through ``xHydro``, two options are available:
fr: Lors de l'initialisation d'une instance ``Hydrotel`` via ``xHydro``, deux options sont disponibles :

source: ``use_defaults = False`` (default): This will attempt to read the three required files from the project folder.
fr: ``use_defaults = False`` (par défaut) : Cela tentera de lire les trois fichiers requis depuis le dossier du projet.

source: ``use_defaults = True``: This option provides an approximation of typical parameters from a project, but it may need to be reviewed and adjusted.
fr: ``use_defaults = True`` : Cette option fournit une approximation des paramètres typiques d'un projet, mais il peut être nécessaire de les revoir et de les ajuster.

source: In all cases, providing additional configuration options to ``project_config``, ``simulation_config``, or ``output_config`` when initializing the HYDROTEL model, or through the ``.update_config()`` function later, will update the corresponding CSV files accordingly.
fr: Dans tous les cas, fournir des options de configuration supplémentaires pour ``project_config``, ``simulation_config`` ou ``output_config`` lors de l'initialisation du modèle HYDROTEL, ou via la fonction ``.update_config()`` plus tard, mettra à jour les fichiers CSV correspondants.

source: The following parameters must always be specified:
fr: Les paramètres suivants doivent toujours être spécifiés :

source: ``DATE DEBUT`` (start date)
fr: ``DATE DEBUT``

source: ``DATE FIN`` (end date)
fr: ``DATE FIN``

source: ``PAS DE TEMPS`` (timestep frequency)
fr: ``PAS DE TEMPS``

source: If these parameters are not already present in ``simulation.csv``, they should be added to ``simulation_config``. Additionally, either ``FICHIER STATIONS METEO`` (meteorological stations file) or ``FICHIER GRILLE METEO`` (meteorological grid file) must be specified to guide the model to the meteorological data.
fr: Si ces paramètres ne sont pas déjà présents dans ``simulation.csv``, ils doivent être ajoutés à ``simulation_config``. De plus, soit ``FICHIER STATIONS METEO``, soit ``FICHIER GRILLE METEO`` doit être spécifié pour guider le modèle vers les données météorologiques.

source: If using the defaults, streamflow for all river reaches will be outputted. You can modify ``output.csv`` to change this behavior.
fr: Si vous utilisez les valeurs par défaut, le débit pour tous les tronçons de rivière sera généré. Vous pouvez modifier ``output.csv`` pour changer ce comportement.

source: With ``model_config`` on hand, an instance of the hydrological model can be initialized using ``xhydro.modelling.hydrological_model`` or the ``xhydro.modelling.Hydrotel`` class directly.
fr: Une fois ``model_config`` en main, une instance du modèle hydrologique peut être initialisée en utilisant ``xhydro.modelling.hydrological_model`` ou la classe ``xhydro.modelling.Hydrotel`` directement.

source: Formatting meteorological data
fr: Mise en forme des données météorologiques

source: The acquisition of raw meteorological data is covered in the `GIS notebook <gis.ipynb>`__ and `Use Case Example <use_case.ipynb>`__ notebooks. Therefore, this notebook will use a test dataset.
fr: L'acquisition des données météorologiques brutes est couverte dans le Notebook `GIS <gis.ipynb>`__ et le Notebook `Exemple de cas d'utilisation <use_case.ipynb>`__. Par conséquent, ce Notebook utilisera un jeu de données de test.

source: Every hydrological model has different requirements when it comes to their input data. In this example, the data variables have units (temperatures in ``°K`` and precipitation in ``m``) and time units that would not be compatible with the requirements for the Hydrotel model. Additionally, while HYDROTEL can manage 2D grids, it is often preferable to have a 1D spatial dimension to quicken some manipulations done by the model.
fr: Chaque modèle hydrologique a des exigences différentes concernant ses données d'entrée. Dans cet exemple, les variables ont des unités (températures en ``°K`` et précipitations en ``m``) et des unités de temps qui ne seraient pas compatibles avec les exigences du modèle HYDROTEL. De plus, bien que HYDROTEL puisse gérer des grilles 2D, il est souvent préférable d'avoir une dimension spatiale 1D pour accélérer certaines manipulations effectuées par le modèle.

source: The function ``xh.modelling.format_input`` can be used to reformat CF-compliant datasets for use in hydrological models.
fr: La fonction ``xh.modelling.format_input`` peut être utilisée pour reformater les jeux de données conformes au format CF pour une utilisation dans les modèles hydrologiques.

source: HYDROTEL requires a configuration file to accompany the meteorological file. This configuration file must have the same name as the corresponding NetCDF file, but with a ``.nc.config`` extension.
fr: HYDROTEL nécessite un fichier de configuration pour accompagner le fichier météorologique. Ce fichier de configuration doit avoir le même nom que le fichier NetCDF correspondant, mais avec l'extension ``.nc.config``.

source: If the ``save_as`` option is used, this configuration file will also be saved along with the meteorological data.
fr: Si l'option ``save_as`` est utilisée, ce fichier de configuration sera également enregistré avec les données météorologiques.

source: Validating the Meteorological Data
fr: Validation des données météorologiques

source: Before executing hydrological models, a few basic checks will be performed automatically. However, users may want to conduct more advanced health checks on the meteorological inputs (e.g., identifying unrealistic values). This can be done using ``xhydro.utils.health_checks``. For the full list of available checks, refer to `the 'xscen' documentation <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__.
fr: Avant d'exécuter les modèles hydrologiques, quelques vérifications de base seront effectuées automatiquement. Cependant, les utilisateurs peuvent souhaiter effectuer des contrôles de santé plus avancés sur les données météorologiques (par exemple, identifier des valeurs irréalistes). Cela peut être fait en utilisant ``xhydro.utils.health_checks``. Pour la liste complète des contrôles disponibles, consultez la documentation de `xscen <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__.

source: We can use ``.get_inputs()`` to automatically retrieve the meteorological data. In this example, we'll ensure there are no abnormal meteorological values or sequences of values.
fr: Nous pouvons utiliser ``.get_inputs()`` pour récupérer automatiquement les données météorologiques. Dans cet exemple, nous nous assurerons qu'il n'y a pas de valeurs ou de séquences de valeurs météorologiques anormales.

source: Executing the model
fr: Exécution du modèle

source: A few basic checks are performed when the ``.run()`` function is called, before executing the model itself. In the case of HYDROTEL, these checks will be made:
fr: Quelques vérifications de base sont effectuées lorsque la fonction ``.run()`` est appelée, avant d'exécuter le modèle lui-même. Dans le cas de HYDROTEL, ces vérifications seront effectuées :

source: All files mentioned in the configuration exist.
fr: Tous les fichiers mentionnés dans la configuration existent.

source: The meteorological dataset has the dimensions, coordinates, and variables named in its configuration file (e.g. ``ERA5.nc.config``, in this example).
fr: Le jeu de données météorologiques possède les dimensions, coordonnées et variables nommées dans son fichier de configuration (par exemple, ``ERA5.nc.config``, dans cet exemple).

source: The dataset has a standard calendar.
fr: Le jeu de données possède un calendrier standard.

source: The frequency is uniform (i.e. all time steps are equally spaced).
fr: La fréquence est uniforme (c'est-à-dire que tous les pas de temps sont égaux).

source: The start and end dates are contained in the dataset.
fr: Les dates de début et de fin sont contenues dans le jeu de données.

source: The dataset is complete (i.e. no missing values).
fr: Le jeu de données est complet (c'est-à-dire qu'il n'y a pas de valeurs manquantes).

source: Only if these checks pass will the function proceed to execute the model. Note that HYDROTEL itself will perform a series of checkups, which is why they are kept at a minimum in ``xHydro``.
fr: Seuls si ces vérifications réussissent, la fonction procédera à l'exécution du modèle. Notez que HYDROTEL effectuera lui-même une série de vérifications, c'est pourquoi elles sont minimisées dans ``xHydro``.

source: Once the model is executed, ``xHydro`` will automatically reformat the NetCDF file to bring it closer to CF conventions, ensuring compatibility with other ``xHydro`` modules. Note that, at this time, this reformatting only supports the outgoing streamflow.
fr: Une fois le modèle exécuté, ``xHydro`` reformatera automatiquement le fichier NetCDF pour le rapprocher des conventions CF, assurant ainsi la compatibilité avec les autres modules ``xHydro``. Notez qu'en ce moment, ce reformatage soutient uniquement le débit sortant.

source: Model calibration
fr: Calage du modèle
