Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/hydrological_modelling_raven.po
Languages: fr

source: Hydrological modelling - Raven (lumped)
fr: Modélisation hydrologique - Raven (modèles globaux)

source: ``xHydro`` provides a collection of functions designed to facilitate hydrological modelling, focusing on two key models: `HYDROTEL <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__ and a suite of models emulated by the `Raven Hydrological Framework <https://raven.uwaterloo.ca/>`__. It is important to note that Raven already possesses an extensive Python library, `RavenPy <https://github.com/CSHS-CWRA/RavenPy>`__, which enables users to build, calibrate, and execute models. ``xHydro`` wraps some of these functions to support multi-model assessments with HYDROTEL, though users seeking advanced functionalities may prefer to use ``RavenPy`` directly.
fr: ``xHydro`` propose une collection de fonctions conçues pour faciliter la modélisation hydrologique, en se concentrant sur deux modèles clés : `HYDROTEL <https://github.com/INRS-Modelisation-hydrologique/hydrotel>`__ et une suite de modèles émulés par le `Raven Hydrological Framework <https://raven.uwaterloo.ca/>`__. Il est important de noter que Raven dispose déjà d'une vaste librairie Python, `RavenPy <https://github.com/CSHS-CWRA/RavenPy>`__, qui permet aux utilisateurs de construire, calibrer et exécuter des modèles. ``xHydro`` encapsule certaines de ces fonctions pour soutenir les évaluations multi-modèles avec HYDROTEL, mais les utilisateurs recherchant des fonctionnalités avancées préféreront utiliser ``RavenPy`` directement.

source: The primary contribution of ``xHydro`` to hydrological modelling is thus its support for HYDROTEL, a model that previously lacked a dedicated Python library. This Notebook covers ``RavenPy`` models, but a similar notebook for ``HYDROTEL`` is available `here <hydrological_modelling_hydrotel.ipynb>`__.
fr: La principale contribution de ``xHydro`` à la modélisation hydrologique est donc son support pour HYDROTEL, un modèle qui manquait auparavant d'une librairie Python dédiée. Ce Notebook couvre les modèles ``RavenPy``, mais un Notebook similaire pour ``HYDROTEL`` est disponible `ici <hydrological_modelling_hydrotel.ipynb>`__.

source: Basic information
fr: Informations de base

source: The ``xHydro`` modelling framework is based on a ``model_config`` dictionary, which is meant to contain all necessary information to execute a given hydrological model. For example, depending on the model, it can store meteorological datasets directly, paths to datasets (netCDF files or other), csv configuration files, parameters, and basically anything that is required to configure and execute an hydrological model.
fr: Le cadre de modélisation ``xHydro`` est basé sur un dictionnaire ``model_config``, qui est censé contenir toutes les informations nécessaires pour exécuter un modèle hydrologique donné. Par exemple, en fonction du modèle, il peut stocker directement les jeux de données météorologiques, les chemins vers ces jeux de données (fichiers netCDF ou autres), les fichiers de configuration csv, les paramètres, et fondamentalement tout ce qui est nécessaire pour configurer et exécuter un modèle hydrologique.

source: The list of required inputs for the dictionary can be obtained one of two ways. The first is to look at the hydrological model's class, such as ``xhydro.modelling.RavenpyModel``. The second is to use the ``xh.modelling.get_hydrological_model_inputs`` function to get a list of the required keys for a given model, as well as the documentation.
fr: La liste des entrées requises pour le dictionnaire peut être obtenue de deux façons. La première consiste à regarder la classe du modèle hydrologique, comme ``xhydro.modelling.RavenpyModel``. La seconde consiste à utiliser la fonction ``xh.modelling.get_hydrological_model_inputs`` pour obtenir la liste des clés requises pour un modèle donné, ainsi que sa documentation.

source: HYDROTEL and Raven vary in terms of required inputs and available functions, but an effort will be made to standardize the outputs as much as possible. Currently, all models include the following three functions:
fr: HYDROTEL et Raven varient en termes d'entrées requises et de fonctions disponibles, mais un effort sera fait pour standardiser les sorties autant que possible. Actuellement, tous les modèles incluent les trois fonctions suivantes :

source: ``.run()``: Executes the model, reformats the outputs to be compatible with analysis tools in ``xHydro``, and returns the simulated streamflow as a ``xarray.Dataset``.
fr: ``.run()`` : Exécute le modèle, reformate les sorties pour être compatibles avec les outils d'analyse dans ``xHydro``, et retourne le débit simulé en tant que ``xarray.Dataset``.

source: The streamflow variable will be named ``q`` and will have units of ``m3 s-1``.
fr: La variable de débit sera nommée ``q`` et aura pour unités ``m3 s-1``.

source: For 1D data (such as hydrometric stations), the corresponding dimension in the dataset will be identified by the ``cf_role: timeseries_id`` attribute.
fr: Pour les données 1D (comme les stations hydrométriques), la dimension correspondante dans le jeux de données sera identifiée par l'attribut ``cf_role: timeseries_id``.

source: ``.get_inputs()``: Retrieves the meteorological inputs used by the model.
fr: ``.get_inputs()`` : Récupère les entrées météorologiques utilisées par le modèle.

source: ``.get_streamflow()``: Retrieves the simulated streamflow output from the model.
fr: ``.get_streamflow()`` : Récupère la sortie de débit simulé du modèle.

source: Initializing and running a calibrated model
fr: Initialisation et exécution d'un modèle calé

source: Raven requires several ``.rv*`` files to control various aspects such as meteorological inputs, watershed characteristics, and more. If the project directory already exists and contains data, ``xHydro`` will prepare the model for execution without overwriting existing ``.rv*`` files—unless the ``overwrite`` argument is explicitly set to ``True``. To force overwriting of these files, you can thus either:
fr: Raven nécessite plusieurs fichiers ``.rv*`` pour contrôler divers aspects tels que les intrants météorologiques, les caractéristiques du bassin versant, et plus encore. Si le répertoire du projet existe déjà et contient des données, ``xHydro`` préparera le modèle pour l'exécution sans écraser les fichiers ``.rv*`` existants, à moins que l'argument ``overwrite`` ne soit explicitement défini sur ``True``. Pour forcer l'écrasement de ces fichiers, vous pouvez donc soit :

source: Set ``overwrite=True`` in the ``model_config`` when instantiating the model
fr: Définir ``overwrite=True`` dans ``model_config`` lors de l'instanciation du modèle

source: Use the ``.create_rv(overwrite=True)`` method on the instantiated model.
fr: Utiliser la méthode ``.create_rv(overwrite=True)`` sur le modèle instancié.

source: This Notebook will focus on lumped RavenPy models. For distributed models, refer to the `Raven distributed modelling notebook <hydrological_modelling_raven_distributed.ipynb>`__.
fr: Ce Notebook se concentrera sur les modèles RavenPy globaux. Pour les modèles distribués, consultez le `Notebook de modélisation Raven distribuée <hydrological_modelling_raven_distributed.ipynb>`__.

source: Acquiring HRU Data
fr: Acquisition des données HRU

source: Raven relies on Hydrological Response Units (HRUs) for its hydrological simulations. For lumped models, only one HRU can be used at a time.
fr: Raven repose sur les Unités de Réponse Hydrologique (HRU) pour ses simulations hydrologiques. Pour les modèles globaux, un seul HRU peut être utilisé à la fois.

source: If using station-based meteorological data, the required HRU attributes are minimal:
fr: Si vous utilisez des données météorologiques basées sur des stations, les attributs requis pour la HRU sont minimaux :

source: ``area``: Watershed drainage area (km²)
fr: ``area`` : Superficie de drainage du bassin versant (km²)

source: ``elevation``: Watershed elevation (m)
fr: ``elevation`` : Altitude du bassin versant (m)

source: ``latitude``: Latitude of the watershed centroid
fr: ``latitude`` : Latitude du centroïde du bassin versant

source: ``longitude``: Longitude of the watershed centroid
fr: ``longitude`` : Longitude du centroïde du bassin versant

source: If using gridded meteorological data, additional attributes are required, but ``xHydro`` will use default values for those that are not provided (except for the geometry):
fr: Si vous utilisez des données météorologiques sur grille, des attributs supplémentaires sont requis, mais ``xHydro`` utilisera des valeurs par défaut pour ceux qui ne sont pas fournis (sauf pour la géométrie) :

source: ``HRU_ID``: Unique identifier for the HRU (set to ``1`` for lumped models)
fr: ``HRU_ID`` : Identifiant unique de la HRU (défini à ``1`` pour les modèles globaux)

source: ``SubId``: Subbasin ID (set to ``1`` for lumped models)
fr: ``SubId`` : Identifiant du sous-bassin (défini à ``1`` pour les modèles globaux)

source: ``DowSubId``: Downstream Subbasin ID (set to ``-1`` for lumped models)
fr: ``DowSubId`` : Identifiant du sous-bassin en aval (défini à ``-1`` pour les modèles globaux)

source: A valid geometry and coordinate reference system (``crs``)
fr: Une géométrie valide et un système de référence de coordonnées (``crs``)

source: HRUs can be represented as either a ``geopandas.GeoDataFrame`` or a Python ``dict``. To assist with HRU creation, you can use the ``xhydro.gis.watershed_to_raven_hru`` function, which will extract the necessary information from functions described in the `GIS notebook <gis.ipynb>`__.
fr: Les HRU peuvent être représentés sous forme de ``geopandas.GeoDataFrame`` ou de ``dict`` Python. Pour faciliter la création des HRU, vous pouvez utiliser la fonction ``xhydro.gis.watershed_to_raven_hru``, qui extraira les informations nécessaires à partir des fonctions décrites dans le Notebook `GIS <gis.ipynb>`__.

source: Formatting Meteorological Data
fr: Formatage des données météorologiques

source: If using multiple meteorological stations, it is recommended to add the ``Interpolation`` argument to ``model_config`` or the ``RavenpyModel`` call to control the interpolation algorithm. Raven uses the nearest neighbour method by default, but other options are available:
fr: Si vous utilisez plusieurs stations météorologiques, il est recommandé d'ajouter l'argument ``Interpolation`` dans ``model_config`` ou lors de l'appel à ``RavenpyModel`` afin de contrôler l'algorithme d'interpolation. Raven utilise par défaut la méthode du plus proche voisin, mais d'autres options sont disponibles :

source: ``INTERP_NEAREST_NEIGHBOR`` (default) — Nearest neighbor (Voronoi) method
fr: ``INTERP_NEAREST_NEIGHBOR`` (par défaut) — Méthode du plus proche voisin (Voronoï)

source: ``INTERP_INVERSE_DISTANCE`` — Inverse distance weighting
fr: ``INTERP_INVERSE_DISTANCE`` — Pondération par distance inverse

source: ``INTERP_INVERSE_DISTANCE_ELEVATION`` — Inverse distance weighting with consideration of elevation
fr: ``INTERP_INVERSE_DISTANCE_ELEVATION`` — Pondération par distance inverse avec prise en compte de l'altitude

source: ``INTERP_AVERAGE_ALL`` — Averages all specified gauge readings
fr: ``INTERP_AVERAGE_ALL`` — Moyenne de toutes les stations spécifiées

source: ``INTERP_FROM_FILE [filename]`` — Weights for each gauge at each HRU are specified in an external file. This method should work via ``xHydro``, but it has not been fully tested.
fr: ``INTERP_FROM_FILE [nom_fichier]`` — Les poids pour chaque station à chaque HRU sont spécifiés dans un fichier externe. Cette méthode devrait fonctionner via ``xHydro``, mais elle n'a pas encore été entièrement testée.

source: When using gridded meteorological data, ``xHydro`` uses functions from ``RavenPy`` to compute weights for each grid cell based on the HRU's geometry.
fr: Lors de l'utilisation de données météorologiques maillées, ``xHydro`` utilise des fonctions de ``RavenPy`` pour calculer les poids de chaque cellule de la grille en fonction de la géométrie du HRU.

source: Ensure that the domain of the grid completely covers the watershed.
fr: Assurez-vous que le domaine de la grille couvre entièrement le bassin versant.

source: The acquisition of raw meteorological data is covered in the `GIS notebook <gis.ipynb>`__ and `Use Case Example <use_case.ipynb>`__ notebooks. Therefore, this notebook will use a test dataset.
fr: L'acquisition de données météorologiques brutes est couverte dans le Notebook `GIS <gis.ipynb>`__ et l'`Exemple de cas d'utilisation <use_case.ipynb>`__. Par conséquent, ce Notebook utilisera un jeu de données de test.

source: Every hydrological model has different requirements when it comes to their input data. In this example, the data variables have units (temperatures in ``degC`` and precipitation in ``mm``) that would be compatible with the requirements for Raven, but this might not always be the case. For reference on default units expected by Raven, consult `this link <https://ravenpy.readthedocs.io/en/latest/_modules/ravenpy/config/defaults.html#>`__. Furthermore, the spatial information that we added lacks attributes or names that would allow RavenPy to recognize them.
fr: Chaque modèle hydrologique a des exigences différentes en ce qui concerne leurs données d'entrée. Dans cet exemple, les variables ont des unités (températures en ``degC`` et précipitations en ``mm``) qui seraient compatibles avec les exigences de Raven, mais ce n'est pas toujours le cas. Pour référence sur les unités par défaut attendues par Raven, consultez `ce lien <https://ravenpy.readthedocs.io/en/latest/_modules/ravenpy/config/defaults.html#>`__. De plus, les informations spatiales que nous avons ajoutées manquent d'attributs ou de noms qui permettraient à RavenPy de les reconnaître.

source: The function ``xh.modelling.format_input`` can be used to reformat CF-compliant datasets for use in hydrological models.
fr: La fonction ``xh.modelling.format_input`` peut être utilisée pour reformater les jeux de données conformes aux normes CF pour une utilisation dans les modèles hydrologiques.

source: While RavenPy does not require a configuration file to accompany the meteorological file, many information must be given to ``model_config`` to properly instantiate the model. The second output of ``format_input`` will return the "meteo_file", "data_type", "alt_names_meteo", and "meteo_station_properties" entries based on the provided file.
fr: Bien que RavenPy ne nécessite pas de fichier de configuration pour accompagner le fichier météorologique, de nombreuses informations doivent être fournies à ``model_config`` pour instancier correctement le modèle. Le deuxième résultat de ``format_input`` renverra les entrées "meteo_file", "data_type", "alt_names_meteo", et "meteo_station_properties" basées sur le fichier fourni.

source: Initializing the Model
fr: Initialisation du modèle

source: The model can now be initialized using the information acquired so far.
fr: Le modèle peut maintenant être initialisé en utilisant les informations acquises jusqu'à présent.

source: Additional entries can be provided to the ``model_config`` dictionary, as long as they are supported by the emulated Raven model.
fr: Des entrées supplémentaires peuvent être ajoutées au dictionnaire ``model_config``, tant qu'elles sont prises en charge par le modèle Raven émulé.

source: In the example below, the ``RainSnowFraction`` and ``Evaporation`` algorithms are customized, overriding the default values used by the GR4JCN model.
fr: Dans l'exemple ci-dessous, les algorithmes ``RainSnowFraction`` et ``Evaporation`` sont personnalisés, remplaçant les valeurs par défaut utilisées par le modèle GR4JCN.

source: Refer to the `Raven documentation <https://raven.uwaterloo.ca/Downloads.html>`__ for the most up-to-date information.
fr: Consultez la `documentation de Raven <https://raven.uwaterloo.ca/Downloads.html>`__ pour obtenir les informations les plus récentes.

source: Model templates are currently listed in Appendix F, while the available options are described in various chapters.
fr: Les modèles types sont actuellement listés dans l'annexe F, tandis que les options disponibles sont décrites dans différents chapitres.

source: With ``model_config`` on hand, an instance of the hydrological model can be initialized using ``xhydro.modelling.hydrological_model`` or the ``xhydro.modelling.RavenpyModel`` class directly.
fr: Une fois ``model_config`` en main, une instance du modèle hydrologique peut être initialisée en utilisant ``xhydro.modelling.hydrological_model`` ou directement la classe ``xhydro.modelling.RavenpyModel``.

source: Validating the Meteorological Data
fr: Validation des données météorologiques

source: Before executing hydrological models, a few basic checks will be performed automatically. However, users may want to conduct more advanced health checks on the meteorological inputs (e.g., identifying unrealistic values). This can be done using ``xhydro.utils.health_checks``. For the full list of available checks, refer to `the 'xscen' documentation <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__.
fr: Avant d'exécuter les modèles hydrologiques, quelques vérifications de base seront effectuées automatiquement. Cependant, les utilisateurs peuvent souhaiter effectuer des contrôles de santé plus avancés sur les données météorologiques (par exemple, identifier des valeurs irréalistes). Cela peut être fait en utilisant ``xhydro.utils.health_checks``. Pour la liste complète des contrôles disponibles, consultez la documentation de `xscen <https://xscen.readthedocs.io/en/latest/notebooks/3_diagnostics.html#Health-checks>`__.

source: We can use ``.get_inputs()`` to automatically retrieve the meteorological data. In this example, we'll ensure there are no abnormal meteorological values or sequences of values.
fr: Nous pouvons utiliser ``.get_inputs()`` pour récupérer automatiquement les données météorologiques. Dans cet exemple, nous nous assurerons qu'il n'y a pas de valeurs ou de séquences de valeurs météorologiques anormales.

source: Executing the Model
fr: Exécution du modèle

source: A few basic checks are performed when the ``.run()`` function is called, before executing the model itself. However, since both RavenPy and Raven will perform a series of checkups themselves, they are kept at a minimum in ``xHydro``. If required, a ``RavenpyModel.executable`` class attribute can be used to point to your own Raven executable instead of the one provided by the ``raven-hydro`` library in the active Python environment.
fr: Quelques vérifications de base sont effectuées lorsque la fonction ``.run()`` est appelée, avant d'exécuter le modèle lui-même. Cependant, comme RavenPy et Raven effectueront eux-mêmes une série de contrôles, ils sont maintenus à un minimum dans ``xHydro``. Si nécessaire, un attribut de la classe, ``RavenpyModel.executable``, peut être utilisé pour pointer vers votre propre exécutable Raven au lieu de celui fourni par la librairie ``raven-hydro`` dans l'environnement Python actif.

source: Once the model is executed, ``xHydro`` will automatically reformat the NetCDF file to bring it closer to CF conventions, ensuring compatibility with other ``xHydro`` modules. Note that, at this time, this reformatting only supports the outgoing streamflow.
fr: Une fois le modèle exécuté, ``xHydro`` reformatera automatiquement le fichier NetCDF pour le rapprocher des conventions CF, assurant ainsi la compatibilité avec les autres modules ``xHydro``. Notez qu'en ce moment, ce reformatage soutient uniquement le débit sortant.

source: Updating the rv\* files
fr: Mise à jour des fichiers rv\*

source: Currently, ``RavenPy`` provides no straightforward way to open and modify the Raven ``.rv*`` files. For instance, changing simulation dates or meteorological data directly through the files is not yet supported. Until this feature is added, some basic functions have been integrated into ``xHydro``, but should be used with care.
fr: Actuellement, ``RavenPy`` ne fournit pas de moyen simple d'ouvrir et de modifier les fichiers Raven ``.rv*``. Par exemple, changer les dates de simulation ou les données météorologiques directement à travers les fichiers n'est pas encore pris en charge. Jusqu'à ce que cette fonctionnalité soit ajoutée, certaines fonctions de base ont été intégrées dans ``xHydro``, mais doivent être utilisées avec précaution.

source: The basic information, such as ``start_date``, ``end_date``, and ``parameters``, are stored directly in the ``RavenpyModel`` class and can be manually updated. Similarly, if additional arguments had been given to the model during initialization, they are stored within a dictionary under ``RavenpyModel.kwargs``, which can be accessed and modified as needed.
fr: Les informations de base, telles que ``start_date``, ``end_date`` et ``parameters``, sont stockées directement dans la classe ``RavenpyModel`` et peuvent être mises à jour manuellement. De même, si des arguments supplémentaires ont été fournis au modèle lors de l'initialisation, ils seront stockés dans un dictionnaire sous ``RavenpyModel.kwargs``, qui peut être consulté et modifié au besoin.

source: The observed streamflow, HRU characteristics and meteorological data are stored under the ``.qobs``, ``.hru`` and ``.meteo`` attributes respectively, but can be much trickier to update, since the associated ``RavenPy`` commands must be reconstructed again. Therefore, it is strongly recommended to use the ``.update_data`` method to update these. This function calls upon a subset of the same arguments used when initializing a Raven model:
fr: Le débit observé, les caractéristiques de HRU et les données météorologiques sont stockés sous les attributs ``.qobs``, ``.hru`` et ``.meteo`` respectivement, mais peuvent être beaucoup plus difficiles à mettre à jour, car les commandes ``RavenPy`` associées doivent être reconstruites à nouveau. Par conséquent, il est fortement recommandé d'utiliser la méthode ``.update_data`` pour mettre à jour ces éléments. Cette fonction fait appel à un sous-ensemble des mêmes arguments utilisés lors de l'initialisation d'un modèle Raven :

source: That function will only update the ``RavenpyModel`` class itself, not the files. If possible, it is strongly recommended to use the ``create_rv`` function to overwrite the existing ``.rv*`` files with the updated information.
fr: Cette fonction ne mettra à jour que la classe ``RavenpyModel`` elle-même, pas les fichiers. Si possible, il est fortement recommandé d'utiliser la fonction ``create_rv`` pour écraser les fichiers ``.rv*`` existants avec les informations mises à jour.

source: If this is not possible, some aspects of the model can still be updated using the ``.update_config`` method, but be very aware that not all updates will be reflected in the ``.rv*`` files. Specifically, the method will update the following, if the option is set to ``True``:
fr: Si cela n'est pas possible, certains aspects du modèle peuvent tout de même être mis à jour en utilisant la méthode ``.update_config``, mais soyez très conscient que toutes les mises à jour ne seront pas reflétées dans les fichiers ``.rv*``. Plus précisément, la méthode mettra à jour les éléments suivants, si l'option est définie sur ``True`` :

source: ``.rvi``: Update the start and end dates.
fr: ``.rvi`` : Met à jour les dates de début et de fin.
