Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/local_frequency_analysis.po
Languages: fr

source: This can be accomplished by calling ``xhydro.frequency_analysis.uncertainties.bootstrap_dist``. Unlike ``bootstrap_obs``, this method does not support lazy evaluation and requires a specific function for the fitting step: ``xhydro.frequency_analysis.uncertainties.fit_boot_dist``.
fr: Cela peut être accompli en appelant ``xhydro.frequency_analysis.uncertainties.bootstrap_dist``. Contrairement à ``bootstrap_obs``, cette méthode ne prend pas en charge l'évaluation paresseuse et requiert une fonction spécifique pour l'étape d'ajustement : ``xhydro.frequency_analysis.uncertainties.fit_boot_dist``.

source: c) Comparison
fr: c) Comparaison

source: Let's show the difference between both approaches.
fr: Illustrons la différence entre les deux approches.
