Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/local_frequency_analysis.po
Languages: fr

source: Local frequency analyses
fr: Analyses fréquentielles locales

source: Data type cannot be displayed: application/javascript, application/vnd.holoviews_load.v0+json
fr: Type de données non affichable : application/javascript, application/vnd.holoviews_load.v0+json

source: Data type cannot be displayed: application/vnd.holoviews_load.v0+json, application/javascript
fr: Type de données non affichable : application/vnd.holoviews_load.v0+json, application/javascript

source: Data type cannot be displayed: text/html, application/vnd.holoviews_exec.v0+json
fr: Type de données non affichable : text/html, application/vnd.holoviews_exec.v0+json

source: Data extraction and preparation
fr: Extraction et préparation des données

source: In this example, we will perform a frequency analysis using historical timeseries data collected from various sites. Our first step is to acquire a hydrological dataset. For this, we utilize the `xdatasets <https://hydrologie.github.io/xdatasets/notebooks/getting_started.html>`__ library to retrieve hydrological data from the `Ministère de l'Environnement, de la Lutte contre les changements climatiques, de la Faune et des Parcs <https://www.cehq.gouv.qc.ca/atlas-hydroclimatique/stations-hydrometriques/index.htm>`__ in Québec, Canada. Our query will focus on stations with IDs beginning with ``020``, and specifically those with natural flow pattern. Some stations have information on water levels, but will will only process streamflow data.
fr: Dans cet exemple, nous effectuerons une analyse fréquentielle à l'aide de données historiques pises à partir de divers sites. La première étape consiste à acquérir un jeu de données hydrologiques. Pour ce faire, nous utilisons la librairie `xdatasets <https://hydrologie.github.io/xdatasets/notebooks/getting_started.html>`__ pour récupérer des données hydrologiques du `Ministère de l'Environnement, de la Lutte contre les changements climatiques, de la Faune et des Parcs <https://www.cehq.gouv.qc.ca/atlas-hydroclimatique/stations-hydrometriques/index.htm>`__ au Québec, Canada. Notre requête se concentrera sur les stations ayant des identifiants commençant par ``020``, et spécifiquement celles ayant un régime de débit naturel. Certaines stations disposent de données sur les niveaux d'eau, mais nous ne traiterons que les données de débit.

source: Alternatively, users can provide their own ``xarray.DataArray``. When preparing the data for frequency analysis, it must adhere to the following requirements:
fr: Alternativement, les utilisateurs peuvent fournir leur propre ``xarray.DataArray``. Lors de la préparation des données pour l'analyse fréquentielle, celles-ci doivent respecter les exigences suivantes :

source: The dataset must include a ``time`` dimension.
fr: Le jeu de données doit inclure une dimension ``time``.

source: If there is a 1D spatial dimension (e.g., ``id`` in the example below), it must contain an attribute ``cf_role`` with the value ``timeseries_id``.
fr: Si une dimension spatiale 1D existe (par exemple, ``id`` dans l'exemple ci-dessous), elle doit contenir un attribut ``cf_role`` avec la valeur ``timeseries_id``.

source: The variable must have at least a ``units`` attribute. Although additional attributes, such as ``long_name`` and ``cell_methods``, are not strictly required, they are expected by ``xclim``, which is invoked during the frequency analysis. Missing these attributes will trigger warnings.
fr: La variable doit au moins avoir un attribut ``units``. Bien que d'autres attributs, comme ``long_name`` et ``cell_methods``, ne soient pas strictement requis, ils sont attendus par ``xclim``, qui est invoqué lors de l'analyse fréquentielle. L'absence de ces attributs entraînera des avertissements.

source: Acquiring block maxima
fr: Acquisition des maxima par blocs

source: The ``xhydro.indicators.get_yearly_op`` function can be used to extract block maxima from a time series. This function provides several options for customizing the extraction process, such as selecting the desired time periods and more. In the following section, we will present the main arguments available to help tailor the block maxima extraction to your needs.
fr: La fonction ``xhydro.indicators.get_yearly_op`` peut être utilisée pour extraire les maxima par blocs à partir d'une série chronologique. Cette fonction offre plusieurs options pour personnaliser le processus d'extraction, comme le choix des périodes temporelles et plus encore. Dans la section suivante, nous présenterons les principaux arguments disponibles pour vous aider à adapter l'extraction des maxima de blocs à vos besoins.

source: a) Defining seasons
fr: a) Définir les saisons

source: Seasons can be defined using indexers compatible with ``xclim.core.calendar.select_time``. Four types of indexers are currently supported:
fr: Les saisons peuvent être définies à l'aide d'indexeurs compatibles avec ``xclim.core.calendar.select_time``. Quatre types d'indexeurs sont actuellement soutenus :

source: ``month``: A sequence of month numbers (e.g., ``[1, 2, 12]`` for January, February, and December).
fr: ``month`` : Une séquence de numéros de mois (par exemple, ``[1, 2, 12]`` pour janvier, février et décembre).

source: ``season``: A sequence of season abbreviations, with options being ``'DJF'``, ``'MAM'``, ``'JJA'``, and ``'SON'`` (representing Winter, Spring, Summer, and Fall, respectively).
fr: ``season`` : Une séquence d'abréviations de saisons, les options étant ``'DJF'``, ``'MAM'``, ``'JJA'``, et ``'SON'`` (représentant l'hiver, le printemps, l'été et l'automne, respectivement).

source: ``doy_bounds``: A sequence specifying the inclusive bounds of the period in terms of day of year (e.g., ``[152, 243]``).
fr: ``doy_bounds`` : Une séquence spécifiant les limites inclusives de la période en termes de jour de l'année (par exemple, ``[152, 243]``).

source: ``date_bounds``: Similar to ``doy_bounds``, but using a month-day format (``'%m-%d'``), such as ``["01-15", "02-23"]``.
fr: ``date_bounds`` : Semblable à ``doy_bounds``, mais utilisant un format mois-jour (``'%m-%d'``), tel que ``["01-15", "02-23"]``.

source: When using ``xhydro.indicators.get_yearly_op`` to calculate block maxima, the indexers should be grouped within a dictionary and passed to the ``timeargs`` argument. The dictionary keys should represent the requested period (e.g., ``'winter'``, ``'summer'``) and will be appended to the variable name. Each dictionary entry can include the following:
fr: Lors de l'utilisation de ``xhydro.indicators.get_yearly_op`` pour calculer les maxima par blocs, les indexeurs doivent être regroupés dans un dictionnaire et passés à l'argument ``timeargs``. Les clés du dictionnaire doivent représenter la période demandée (par exemple, ``'winter'``, ``'summer'``) et seront ajoutées au nom de la variable. Chaque entrée du dictionnaire peut inclure ce qui suit :

source: The indexer, as defined above (e.g., ``"date_bounds": ["02-11", "06-19"]``).
fr: L'indexeur, tel que défini ci-dessus (par exemple, ``"date_bounds": ["02-11", "06-19"]``).

source: (Optional) An annual resampling frequency. This is mainly used for indexers that span across the year. For example, setting ``"freq": "YS-DEC"`` will start the year in December instead of January.
fr: (Facultatif) Une fréquence de rééchantillonnage annuelle. Cela est principalement utilisé pour les indexeurs qui couvrent l'année. Par exemple, en définissant ``"freq": "YS-DEC"``, l'année commencera en décembre au lieu de janvier.

source: b) Defining criteria for missing values
fr: b) Définir les critères pour les valeurs manquantes

source: The ``xhydro.indicators.get_yearly_op`` function also includes two arguments, ``missing`` and ``missing_options``, which allow you to define tolerances for missing data. These arguments leverage ``xclim`` to handle missing values, and the available options are detailed in the `xclim documentation <https://xclim.readthedocs.io/en/stable/checks.html#missing-values-identification>`__.
fr: La fonction ``xhydro.indicators.get_yearly_op`` inclut également deux arguments, ``missing`` et ``missing_options``, qui permettent de définir des tolérances pour les données manquantes. Ces arguments utilisent ``xclim`` pour gérer les valeurs manquantes, et les options disponibles sont détaillées dans la documentation `xclim <https://xclim.readthedocs.io/en/stable/checks.html#missing-values-identification>`__.

source: c) Simple example
fr: c) Exemple simple

source: Let's start with a straightforward example using the ``timeargs`` dictionary defined earlier. In this case, we will set a tolerance where a maximum of 15% of missing data in a year will be considered acceptable for the year to be regarded as valid.
fr: Commençons par un exemple simple en utilisant le dictionnaire ``timeargs`` défini précédemment. Dans ce cas, nous allons définir une tolérance où un maximum de 15 % de données manquantes dans une année sera considéré comme acceptable pour que l'année soit considérée valide.

source: d) Advanced example: Using custom seasons per year or per station
fr: d) Exemple avancé : Utiliser des saisons personnalisées par année ou par station

source: Customizing date ranges for each year or each station is not directly supported by ``xhydro.indicators.get_yearly_op``. However, users can work around this limitation by masking their data before calling the function. When applying this approach, be sure to adjust the ``missing`` argument to accommodate the changes in the data availability.
fr: La personnalisation des plages de dates pour chaque année ou chaque station n'est pas directement prise en charge par ``xhydro.indicators.get_yearly_op``. Cependant, les utilisateurs peuvent contourner cette limitation en masquant leurs données avant d'appeler la fonction. Lors de l'application de cette approche, assurez-vous d'ajuster l'argument ``missing`` pour tenir compte des modifications dans la disponibilité des données.

source: In this example, we will define a season that starts on a random date in April and ends on a random date in June. Since we will mask almost the entire year, the tolerance for missing data should be adjusted accordingly. Instead of setting a general tolerance for missing data, we will use the ``at_least_n`` method to specify that at least 45 days of data must be available for the period to be considered valid.
fr: Dans cet exemple, nous définirons une saison qui commence à une date aléatoire en avril et se termine à une date aléatoire en juin. Comme nous allons masquer presque toute l'année, la tolérance pour les données manquantes doit être ajustée en conséquence. Au lieu de définir une tolérance générale pour les données manquantes, nous utiliserons la méthode ``at_least_n`` pour spécifier qu'au moins 45 jours de données doivent être disponibles pour que la période soit considérée valide.

source: e) Alternative variable: Computing volumes
fr: e) Variable alternative : Calcul des volumes

source: Frequency analysis can also be applied to volumes, following a similar workflow to that of streamflow data. The main difference is that if we're starting with streamflow data, we must first convert it into volumes using ``xhydro.indicators.compute_volume`` (e.g., going from ``m3 s-1`` to ``m3``). Additionally, if necessary, the ``get_yearly_op`` function includes an argument, ``interpolate_na``, which can be used to interpolate missing data before calculating the sum.
fr: L'analyse fréquentielle peut également être appliquée aux volumes, suivant un processus similaire à celui des données de débit. La principale différence est que si nous commençons avec des données de débit, nous devons d'abord les convertir en volumes en utilisant ``xhydro.indicators.compute_volume`` (par exemple, passer de ``m3 s-1`` à ``m3``). De plus, si nécessaire, la fonction ``get_yearly_op`` inclut un argument, ``interpolate_na``, qui peut être utilisé pour interpoler les données manquantes avant de calculer la somme.

source: Local frequency analysis
fr: Analyse fréquentielle locale

source: After extracting the raw data, such as annual maximums or minimums, the local frequency analysis is performed in three steps:
fr: Après avoir extrait les données brutes, telles que les maximums ou minimums annuels, l'analyse fréquentielle locale est réalisée en trois étapes :

source: Use ``xhydro.frequency_analysis.local.fit`` to determine the best set of parameters for a given number of statistical distributions.
fr: Utiliser ``xhydro.frequency_analysis.local.fit`` pour déterminer le meilleur ensemble de paramètres pour un nombre donné de distributions statistiques.

source: (Optional) Use ``xhydro.frequency_analysis.local.criteria`` to compute goodness-of-fit criteria and assess how well each statistical distribution fits the data.
fr: (Facultatif) Utiliser ``xhydro.frequency_analysis.local.criteria`` pour calculer les critères de qualité d'ajustement et évaluer à quel point chaque distribution statistique correspond bien aux données.

source: Use ``xhydro.frequency_analysis.local.parametric_quantiles`` to calculate return levels based on the fitted parameters.
fr: Utiliser ``xhydro.frequency_analysis.local.parametric_quantiles`` pour calculer les niveaux de retour basés sur les paramètres ajustés.

source: To speed up the Notebook, we'll only perform the analysis on a subset of variables.
fr: Pour accélérer le Notebook, nous effectuerons l'analyse uniquement sur un sous-ensemble de variables.

source: The ``fit`` function enables the fitting of multiple statistical distributions simultaneously, such as ``["genextreme", "pearson3", "gumbel_r", "expon"]``. Since different distributions have varying parameter sets (and sometimes different naming conventions), ``xHydro`` handles this complexity by using a ``dparams`` dimension, filling in NaN values where needed. When the results interact with ``SciPy``, such as the ``parametric_quantiles`` function, only the relevant parameters for each distribution are passed. The selected distributions are stored in a newly created ``scipy_dist`` dimension.
fr: La fonction ``fit`` permet d'ajuster simultanément plusieurs distributions statistiques, telles que ``["genextreme", "pearson3", "gumbel_r", "expon"]``. Comme différentes distributions ont des ensembles de paramètres variables (et parfois des conventions de nommage différentes), ``xHydro`` gère cette complexité en utilisant une dimension ``dparams`` et en remplissant avec des valeurs NaN là où nécessaire. Lorsque les résultats interagissent avec ``SciPy``, comme la fonction ``parametric_quantiles``, seuls les paramètres pertinents pour chaque distribution sont passés. Les distributions sélectionnées sont stockées dans une nouvelle dimension ``scipy_dist``.

source: Criteria like AIC (Akaike Information Criterion), BIC (Bayesian Information Criterion), and AICC (Corrected AIC) are valuable tools for comparing the fit of different statistical models. These criteria balance the goodness-of-fit of a model with its complexity, helping to avoid overfitting. AIC and AICC are particularly useful when comparing models with different numbers of parameters, while BIC tends to penalize complexity more heavily, making it more conservative. Lower values of these criteria indicate better model performance, with AICC being especially helpful in small sample sizes. By using these metrics, we can objectively determine the most appropriate model for our data.
fr: Les critères tels que l'AIC (Critère d'Information d'Akaike), le BIC (Critère Bayésien d'Information), et l'AICC (AIC corrigé) sont des outils précieux pour comparer l'ajustement de différents modèles statistiques. Ces critères équilibrent la qualité d'ajustement d'un modèle avec sa complexité, aidant à éviter l'overfitting. L'AIC et l'AICC sont particulièrement utiles pour comparer des modèles avec des nombres de paramètres différents, tandis que le BIC a tendance à pénaliser plus sévèrement la complexité, ce qui le rend plus conservateur. Des valeurs plus faibles de ces critères indiquent de meilleures performances du modèle, l'AICC étant particulièrement utile pour les petits échantillons. En utilisant ces métriques, nous pouvons déterminer objectivement le modèle le plus approprié pour nos données.

source: These three criteria can be accessed using ``xhydro.frequency_analysis.local.criteria``. The results are added to a new ``criterion`` dimension. In this example, the AIC, BIC, and AICC all provide a weak indication that the Generalized Extreme Value (GEV) distribution is the best fit for the data, though the Gumbel distribution may also be a suitable choice. Conversely, the Pearson III failed to converge and the exponential distribution was rejected based on these criteria, suggesting that they do not adequately fit the data.
fr: Ces trois critères peuvent être consultés en utilisant ``xhydro.frequency_analysis.local.criteria``. Les résultats sont ajoutés à une nouvelle dimension ``criterion``. Dans cet exemple, l'AIC, le BIC et l'AICC donnent tous une faible indication que la distribution Generalized Extreme Value (GEV) est la meilleure correspondance pour les données, bien que la distribution de Gumbel puisse également être un choix approprié. En revanche, le Pearson III n'a pas convergé et la distribution exponentielle a été rejetée en fonction de ces critères, ce qui suggère qu'elles ne correspondent pas correctement aux données.

source: Finally, return periods can be obtained using ``xhfa.local.parametric_quantiles``.
fr: Enfin, les périodes de retour peuvent être obtenues en utilisant ``xhfa.local.parametric_quantiles``.

source: In a future release, plotting will be managed by a dedicated function. For now, we demonstrate the process using preliminary utilities in this notebook.
fr: Dans une future version, l'affichage des graphiques sera géré par une fonction dédiée. Pour l'instant, nous démontrons le processus en utilisant les utilitaires préliminaires dans ce Notebook.

source: The function ``xhfa.local._prepare_plots`` generates the data points required to visualize the results of the frequency analysis. If ``log=True``, it will return log-spaced x-values between ``xmin`` and ``xmax``. Meanwhile, ``xhfa.local._get_plotting_positions`` calculates plotting positions for all variables in the dataset. It accepts ``alpha`` and ``beta`` arguments. For typical values, refer to the `SciPy documentation <https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.mstats.plotting_positions.html>`__. By default, ``(0.4, 0.4)`` is used, which corresponds to the quantile unbiased method (Cunnane).
fr: La fonction ``xhfa.local._prepare_plots`` génère les points de données nécessaires pour visualiser les résultats de l'analyse fréquentielle. Si ``log=True``, elle renverra des valeurs x espacées logarithmiquement entre ``xmin`` et ``xmax``. En parallèle, ``xhfa.local._get_plotting_positions`` calcule les positions des graphiques pour toutes les variables dans le jeu de données. Elle accepte les arguments ``alpha`` et ``beta``. Pour des valeurs typiques, consultez la documentation `SciPy <https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.mstats.plotting_positions.html>`__. Par défaut, ``(0.4, 0.4)`` est utilisé, ce qui correspond à la méthode des quantiles non biaisée (Cunnane).

source: Uncertainties
fr: Incertitudes

source: Uncertainties are an important aspect of frequency analysis and should be considered when interpreting results. These uncertainties often stem from data quality, the choice of distribution, and the estimation of parameters. While visualizations can provide insights into the model fit, it’s crucial to quantify and account for uncertainties, such as confidence intervals for parameter estimates, to ensure robust conclusions.
fr: Les incertitudes sont un aspect important de l'analyse fréquentielle et doivent être prises en compte lors de l'interprétation des résultats. Ces incertitudes proviennent souvent de la qualité des données, du choix de la distribution et de l'estimation des paramètres. Bien que les visualisations puissent fournir des informations sur l'ajustement du modèle, il est essentiel de quantifier et de prendre en compte les incertitudes, telles que les intervalles de confiance pour les estimations des paramètres, afin d'assurer des conclusions robustes.

source: In order to manage computational intensity, we will focus on a single catchment and limit the analysis to the two distributions that appeared to best fit the data.
fr: Pour gérer l'intensité computationnelle, nous nous concentrerons sur un seul bassin versant et limiterons l'analyse aux deux distributions qui semblaient les mieux correspondre aux données.

source: a) Bootstrapping the observations
fr: a) Bootstrap des observations

source: One method for quantifying uncertainties is to bootstrap the observations. In this example, we will perform bootstrapping a small number of times to illustrate the process, though in practice, a higher number of iterations (e.g., 5000) is recommended to obtain more reliable estimates. Bootstrapping resamples the observed data with replacement to generate multiple datasets, which can then be used to assess the variability in the model's parameters and results.
fr: Une méthode pour quantifier les incertitudes consiste à effectuer un bootstrap des observations. Dans cet exemple, nous effectuerons le bootstrap un petit nombre de fois pour illustrer le processus, bien qu'en pratique, un nombre plus élevé d'itérations (par exemple, 5000) soit recommandé pour obtenir des estimations plus fiables. Le bootstrap consiste à rééchantillonner les données observées avec remplacement pour générer plusieurs ensembles de données, qui peuvent ensuite être utilisés pour évaluer la variabilité des paramètres et des résultats du modèle.

source: This can be accomplished by calling ``xhydro.frequency_analysis.uncertainties.bootstrap_obs``.
fr: Cela peut être accompli en appelant ``xhydro.frequency_analysis.uncertainties.bootstrap_obs``.

source: This process will add a new dimension, ``samples``, to the dataset. When used in conjunction with ``xhydro.frequency_analysis.local.fit``, a new set of parameters will be computed for each sample. As a result, bootstrapping can become computationally expensive, especially as the number of bootstrap iterations increases.
fr: Ce processus ajoutera une nouvelle dimension, ``samples``, au jeu de données. Lorsqu'il est utilisé en conjonction avec ``xhydro.frequency_analysis.local.fit``, un nouvel ensemble de paramètres sera calculé pour chaque échantillon. En conséquence, le bootstrap peut devenir coûteux en termes de calcul, surtout à mesure que le nombre d'itérations de bootstrap augmente.

source: b) Bootstrapping the distributions
fr: b) Bootstrap des distributions

source: In this approach, rather than resampling the observations directly, we resample the fitted distributions to estimate the uncertainty. This method allows us to assess the variability in the fitted distributions' parameters. As with the previous example, we will perform a minimal number of bootstrap iterations to reduce computational load, but in practice, a higher number of iterations would provide more robust estimates of uncertainty.
fr: Dans cette approche, plutôt que de rééchantillonner directement les observations, nous rééchantillonnons les distributions ajustées pour estimer l'incertitude. Cette méthode nous permet d'évaluer la variabilité des paramètres des distributions ajustées. Comme dans l'exemple précédent, nous effectuerons un nombre minimal d'itérations de bootstrap pour réduire la charge computationnelle, mais en pratique, un nombre plus élevé d'itérations fournirait des estimations plus robustes de l'incertitude.
