Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/optimal_interpolation.po
Languages: fr

source: Optimal interpolation module
fr: Module d'interpolation optimale

source: Optimal interpolation is a tool that allows combining a spatially distributed field (i.e. the "background field") with point observations in such a way that the entire field can be adjusted according to deviations between the observations and the field at the point of observations. For example, it can be used to combine a field of reanalysis precipitation (e.g. ERA5) with observation records, and thus adjust the reanalysis precipitation over the entire domain in a statistically optimal manner.
fr: L'interpolation optimale est un outil qui permet de combiner un champ spatialement distribué (c'est-à-dire le "champ de fond") avec des observations ponctuelles de telle sorte que l'ensemble du champ puisse être ajusté en fonction des écarts entre les observations et le champ au point d'observation. Par exemple, il peut être utilisé pour combiner un champ de précipitation d'une' réanalyse (par exemple ERA5) avec des enregistrements d'observation, et ainsi ajuster les précipitations de la réanalyse sur l'ensemble du domaine de manière statistiquement optimale.

source: This page demonstrates how to use ``xhydro`` to perform optimal interpolation using field-like simulations and point observations for hydrological modelling. In this case, the background field is a set of outputs from a distributed hydrological model and the observations correspond to real hydrometric stations. The aim is to correct the background field (i.e. the distributed hydrological simulations) using optimal interpolation, as in Lachance-Cloutier et al (2017).
fr: Cette page montre comment utiliser ``xhydro`` pour effectuer une interpolation optimale à l'aide d'un champ d'essai de simulations et d'observations ponctuelles pour la modélisation hydrologique. Dans ce cas, le champ de fond est un ensemble de sorties d'un modèle hydrologique distribué et les observations correspondent à des stations hydrométriques réelles. L’objectif est de corriger le champ de fond (c’est-à-dire les simulations hydrologiques distribuées) à l’aide d’une interpolation optimale, comme dans Lachance-Cloutier et al (2017).

source: A quick example
fr: Un exemple rapide

source: Imagine a scenario where we have 3 streamflow observation stations and a hydrological model that simulated flows at those 3 sites and at another extra 2 sites (for a total of 5 simulation sites). We would like to improve the quality of the simulations at each of the 5 sites and even more so at the 2 extra sites where there are no observations to help train the model. The setup could look something like this:
fr: Imaginez un scénario dans lequel nous disposons de 3 stations d'observation des débits et d'un modèle hydrologique qui simule les débits sur ces 3 sites et sur 2 autres sites supplémentaires (pour un total de 5 sites de simulation). Nous souhaitons améliorer la qualité des simulations sur chacun des 5 sites et encore plus sur les 2 sites supplémentaires où il n'y a pas d'observations pour aider à entraîner le modèle. La configuration pourrait ressembler à ceci :

source: Station 1: Observed + simulated
fr: Station 1 : Observé + simulé

source: Station 2: Observed + simulated
fr: Station 2 : Observé + simulé

source: Station 3: Observed + simulated
fr: Station 3 : Observé + simulé

source: Station 4: Simulated only
fr: Station 4 : Simulation uniquement

source: Station 5: Simulated only
fr: Station 5 : Simulation uniquement

source: Optimal interpolation can help, but we will need some basic information with respect to each of the stations (simulated and observed):
fr: L'interpolation optimale peut aider, mais nous aurons besoin de quelques informations de base concernant chacune des stations (simulées et observées) :

source: Catchment areas (to scale the errors)
fr: Taille du bassin versant (pour mettre à l’échelle les erreurs)

source: Catchment latitude / longitudes, to develop the spatial error model
fr: Latitudes/longitudes du bassin versant, pour développer le modèle d'erreur spatiale

source: Observed data at the 3 gauged locations
fr: Données observées aux 3 emplacements jaugés

source: Simulated data at the 5 locations
fr: Données simulées sur les 5 sites

source: Let's define these now and show the stations on a map:
fr: Définissons-les maintenant et montrons les stations sur une carte :

source: We now have the basic data required to start processing using optimal interpolation. However, before doing so, we must provide some hyperparameters. Some are more complex than others, so let's break down the main steps.
fr: Nous disposons désormais des données de base nécessaires pour démarrer le traitement en utilisant une interpolation optimale. Cependant, avant de le faire, nous devons fournir quelques hyperparamètres. Certains sont plus complexes que d’autres, décomposons donc les principales étapes.

source: The first is the need to compute differences (also referred to as "departures" between observations and simulations where they both occur simultaneously. We also need to scale the data by the catchment area to ensure errors are relative and can then be interpolated. We then take the logarithm of these values to ensure extrapolation does not cause negative streamflow. We will reverse the transformation later.
fr: La première est la nécessité de calculer les différences (également appelées « écarts ») entre les observations et les simulations lorsqu'elles se produisent simultanément. Nous devons également mettre à l'échelle les données en les divisant par la taille des bassins versants pour garantir que les erreurs sont relatives et peuvent ensuite être interpolées. Nous prenons le logarithme de ces valeurs pour garantir que l'extrapolation ne provoque pas de flux négatif. Nous inverserons la transformation plus tard.

source: We will now need some information that may (or may not) be available for our observation sites and simulation sites. These include estimates of:
fr: Nous aurons maintenant besoin de certaines informations qui pourront (ou non) être disponibles pour nos sites d’observation et de simulation. Il s’agit notamment d’estimations de :

source: The variance of the observations at the gauged sites.
fr: La variance des observations sur les sites jaugés.

source: The variance of the simulated flows at the observation sites. This is a vector of size 3 in this example, i.e. one value per observation site. Note that this variance is that of the simulations at the observation sites, and not the variance of the observations themselves.
fr: La variance des débits simulés aux sites d'observation. Il s'agit d'un vecteur de taille 3 dans cet exemple, soit une valeur par site d'observation. A noter que cette variance est celle des simulations sur les sites d'observation, et non la variance des observations elles-mêmes.

source: The variance of the simulated flows at the estimation sites. This is a vector of size 5 in this example, i.e. one value per simulation point, including those that also correspond to an observation site.
fr: La variance des débits simulés aux sites d'estimation. Il s'agit d'un vecteur de taille 5 dans cet exemple, soit une valeur par point de simulation, y compris ceux qui correspondent également à un site d'observation.

source: We do not know these values for this test example, however these values can be estimated in real-world applications using long time series of log-transformed and scaled flows or using measurement error from the instrumentation at gauged sites. For this example, we will assume simple values of 1.0 for each case.
fr: Nous ne connaissons pas ces valeurs pour cet exemple de test, mais ces valeurs peuvent être estimées dans des applications réelles en utilisant de longues séries chronologiques de débits log-transformés et mis à l'échelle ou en utilisant l'erreur de mesure de l'instrumentation sur des sites jaugés. Pour cet exemple, nous supposerons des valeurs simples de 1,0 pour chaque cas.

source: If we had better estimates of these variables, we could change the 1.0 values to more appropriate values. However, these can also be adjusted according to past experience or by trial-and-error.
fr: Si nous disposions de meilleures estimations de ces variables, nous pourrions remplacer les valeurs 1,0 par des valeurs plus appropriées. Toutefois, celles-ci peuvent également être ajustées en fonction de l’expérience passée ou par essais et erreurs.

source: The final piece of the puzzle is that of the error covariance function. In a nutshell, optimal interpolation will consider the distance between an observation (or multiple observations) and the site where we need to estimate the new flow value. We can easily understand that a simulation station that is very close to an observation station should be highly correlated with it, whereas a more distant point would be less correlated. We therefore need a covariance function that estimates (1) the degree of covariability between an observed and simulated point as a function of (2) the distance between those points. This is the ECF function, multiple models of which exist in the literature. In many instances, a model form will be imposed and parameters will be adjusted such that the model represents the existing covariance between points.
fr: La dernière pièce du puzzle est celle de la fonction de covariance d’erreur. En un mot, l'interpolation optimale prendra en compte la distance entre une observation (ou plusieurs observations) et le site où nous devons estimer la nouvelle valeur de débit. On comprend aisément qu'une station de simulation très proche d'une station d'observation doive être fortement corrélée avec celle-ci, alors qu'un point plus éloigné serait moins corrélé. Nous avons donc besoin d'une fonction de covariance qui estime (1) le degré de covariabilité entre un point observé et simulé en fonction de (2) la distance entre ces points. Il s’agit de la fonction ECF dont plusieurs modèles existent dans la littérature. Dans de nombreux cas, une forme de modèle sera imposée et les paramètres seront ajustés de telle sorte que le modèle représente la covariance existante entre les points.

source: In this test example, we have too few points and not enough timesteps to establish a meaningful model (and parameterization) from the data. We therefore impose a model. There are four that are built into ``xhydro``, where par[0] and par[1] are the model parameters to be calibrated (in normal circumstances) and where *h* is the distance between the points:
fr: Dans cet exemple de test, nous avons trop peu de points et pas assez de pas de temps pour établir un modèle (et un paramétrage) significatif à partir des données. Nous imposons donc un modèle. Il y en a quatre qui sont intégrés à ``xhydro``, où par[0] et par[1] sont les paramètres du modèle à calibrer (dans des circonstances normales) et où *h* est la distance entre les points :

source: Model 1: par[0] \* (1 + h / par[1]) \* exp(-h / par[1]) -- From Lachance-Cloutier et al. 2017.
fr: Modèle 1 : par[0] \* (1 + h / par[1]) \* exp(-h / par[1]) -- D'après Lachance-Cloutier et al. 2017.

source: Model 2: par[0] \* exp(-0.5 \* (h / par[1])**2)
fr: Modèle 2 : par[0] \* exp(-0,5 \* (h / par[1])**2)

source: Model 3: par[0] \* exp(-h / par[1])
fr: Modèle 3 : par[0] \* exp(-h / par[1])

source: Model 4: par[0] \* exp(-(h \*\* par[1]) / par[0])
fr: Modèle 4 : par[0] \* exp(-(h \*\* par[1]) / par[0])

source: We will use model #4, but you can change it below and see how it affects results. Parameters can also be changed to assess their impacts.
fr: Nous utiliserons le modèle n°4, mais vous pouvez le modifier ci-dessous et voir comment cela affecte les résultats. Les paramètres peuvent également être modifiés pour évaluer leurs impacts.

source: We can now run the optimal interpolation algorithm and retrieve the estimated value and variance of the uncertainty for each simulated site.
fr: Nous pouvons maintenant exécuter l'algorithme d'interpolation optimal et récupérer la valeur estimée et la variance de l'incertitude pour chaque site simulé.

source: Finally, we can compute the actual best estimate value and the variance of the uncertainty distribution from these results:
fr: Enfin, nous pouvons calculer la valeur réelle de la meilleure estimation et la variance de la distribution de l'incertitude à partir de ces résultats :

source: As a last step, here is how we can estimate the distribution of possible values at the estimation sites. The v_est is the location of the distribution, and the v_est is the variance. This means we can model the distribution and generate quantile values.
fr: Dans une dernière étape, voici comment estimer la distribution des valeurs possibles aux sites d'estimation. Le v_est est l'emplacement de la distribution et le v_est est la variance. Cela signifie que nous pouvons modéliser la distribution et générer des valeurs de quantiles.

source: Notice that there are a few problems with the model presented here: 1. The optimal interpolation worsened the estimated results at the gauged sites compared to the raw simulation. 2. The 25th and 75th percentile values for the estimated flows at the gauged sites are "nan". 3. The estimated flows at the ungauged sites did not change (or changed very little).
fr: Notez qu'il y a quelques problèmes avec le modèle présenté ici : 1. L'interpolation optimale a détérioré les résultats estimés sur les sites jaugés par rapport à la simulation brute. 2. Les valeurs des 25e et 75e centiles pour les débits estimés sur les sites jaugés sont "nan". 3. Les débits estimés sur les sites non jaugés n'ont pas changé (ou très peu).

source: These problems arise due to some methodological choices: \* Forcing of a covariance function model and parameterization that is inadequate. \* Very few observation stations, making it extremely difficult to assess spatial patterns. \* Simulated and observed flows that were randomly generated and have no (or little) correlation, very small covariance.
fr: Ces problèmes surviennent en raison de certains choix méthodologiques : \* Forçage d'un modèle de fonction de covariance et paramétrage inadéquat. \* Très peu de stations d'observation, ce qui rend extrêmement difficile l'évaluation des modèles spatiaux. \* Débits simulés et observés générés aléatoirement et n'ayant pas (ou peu) de corrélation et une très faible covariance.

source: This means the problem is ill-defined and the optimal interpolation should not be applied in these cases. With more data, the results become much better, as will be shown in the next section.
fr: Cela signifie que le problème est mal défini et que l’interpolation optimale ne doit pas être appliquée dans ces cas. Avec plus de données, les résultats deviennent bien meilleurs, comme le montrera la section suivante.

source: Application on real data from the HYDROTEL hydrological model
fr: Application sur données réelles du modèle hydrologique HYDROTEL

source: The previous section showed how to implement the optimal interpolation algorithm in a standalone manner. However, this is inconvenient when many stations are to be processed concurrently. Tools have thus been built into ``xhydro`` to help with all the processing, and as such, has some specific data requirements. Here we explore the contents of a complete input file, and we will add details a bit later. Let's start by importing some test data from the ``xhydro-testdata`` repository:
fr: La section précédente a montré comment implémenter l'algorithme d'interpolation optimal de manière autonome. Toutefois, cela n'est pas pratique lorsque de nombreuses stations doivent être traitées simultanément. Des outils ont donc été intégrés à ``xhydro`` pour faciliter tout le traitement et, en tant que tels, ont des exigences spécifiques en matière de données. Ici, nous explorons le contenu d'un fichier d'entrée complet, et nous ajouterons des détails un peu plus tard. Commençons par importer quelques données de test depuis le dépôt ``xhydro-testdata`` :

source: We now have 4 files: - flow_obs_info_file: The dataset file (.nc) that contains the point observations and station metadata. - flow_sim_info_file: The dataset file (.nc) that contains the background field simulations, including simulated station metadata. - corresponding_station_file: The dataset file (.nc) that links the station identifiers between observations and simulated stations. This is necessary because observed stations have "real world" identifiers and distributed simulations are often coded or numbered sequentially. However, we need to be able to find which of the background field stations (simulation points) correspond to each real-world station. - selected_station_file: The list of stations from the observation set that we wish to use (thus discarding the others from the flow_obs_info_file set).
fr: Nous avons maintenant 4 fichiers : - flow_obs_info_file : Le fichier de jeu de données (.nc) qui contient les observations ponctuelles et les métadonnées des stations. - flow_sim_info_file : fichier de jeu de données (.nc) qui contient le champ d'essai des simulations, y compris les métadonnées des stations simulées. - correspondant_station_file : Le fichier de jeu de données (.nc) qui relie les identifiants de station entre les observations et les stations simulées. Cela est nécessaire car les stations observées ont des identifiants du « monde réel » et les simulations distribuées sont souvent codées ou numérotées de manière séquentielle. Cependant, nous devons être capables de déterminer quelles stations du champ d'essai (points de simulation) correspondent à chaque station du monde réel. - selected_station_file : La liste des stations du jeu de données d'observation que nous souhaitons utiliser (éliminant ainsi les autres de l'ensemble flow_obs_info_file).

source: We can now process them to extract some values that will be required to send to the optimal interpolation main controller:
fr: Nous pouvons maintenant les traiter pour extraire certaines valeurs qu'il faudra envoyer au contrôleur principal de l'interpolation optimale :

source: Let's explore the contents of these files:
fr: Explorons le contenu de ces fichiers :

source: Notice that there are a few keywords that are important in these files that the code expects: 1. The streamflow observations must be in a data variable named "streamflow", with dimensions "station" and "time". 2. There must be the catchment drainage area in a variable named "drainage_area" with dimensions "station". 3. The "centroid_lat" and "centroid_lon" are also required under those specific names to allow computing distances. These are the centroids of the catchments, and not the latitude and longitude of the hydrometric stations. 4. There should be a "time" variable. 5. There should be a "station_id" variable, that has an identifier for each station. This will be used to map the observation station IDs to the simulated station IDs using the correspondence tables.
fr: Notez qu'il y a quelques mots-clés importants dans ces fichiers que le code attend : 1. Les observations de flux doivent être dans une variable de données nommée "streamflow", avec les dimensions "station" et "time". 2. Il doit y avoir l'aire de drainage du bassin versant dans une variable nommée "drainage_area" avec les dimensions "station". 3. Les "centroid_lat" et "centroid_lon" sont également requis sous ces noms spécifiques pour permettre le calcul des distances. Il s'agit des centroïdes des bassins versants, et non de la latitude et de la longitude des stations hydrométriques. 4. Il devrait y avoir une variable "time". 5. Il devrait y avoir une variable "station_id", qui a un identifiant pour chaque station. Ceci sera utilisé pour mapper les identifiants des stations d’observation aux identifiants des stations simulées à l’aide des tables de correspondance.

source: Notice that there are 274 observed stations, which should help increase the error covariance function's accuracy.
fr: Notez qu'il y a 274 stations observées, ce qui devrait contribuer à augmenter la précision de la fonction de covariance d'erreur.

source: We can now explore the simulated streamflow "qsim", which is quite similar:
fr: Nous pouvons maintenant explorer le débit simulé "qsim", qui est assez similaire :

source: We can again see some specific variables in the "qsim" dataset: 1. The streamflow simulations must be in a data variable named "streamflow", with dimensions "station" and "time". 2. There must be the catchment drainage area *as simulated by the model* in a variable named "drainage_area" with dimensions "station". 3. The "lat" and "lon" are also required under those specific names to allow computing distances. These are the centroids of the catchments, and not the latitude and longitude of the hydrometric stations, which do not exist in the simulation mode. 4. There should be a "time" variable. 5. There should be a "station_id" variable, that has an identifier for each station. This will be used to map the observation station IDs to the simulated station IDs using the correspondence tables.
fr: Nous pouvons à nouveau voir quelques variables spécifiques dans le jeu de données "qsim" : 1. Les simulations de débit doivent être dans une variable de données nommée "streamflow", avec les dimensions "station" et "time". 2. Il doit y avoir l'aire de drainage du bassin versant *telle que simulée par le modèle* dans une variable nommée "drainage_area" de dimensions "station". 3. Les "lat" et "lon" sont également requis sous ces noms spécifiques pour permettre le calcul des distances. Il s'agit des centroïdes des bassins versants, et non des latitudes et longitudes des stations hydrométriques, qui n'existent pas en mode simulation. 4. Il devrait y avoir une variable "time". 5. Il devrait y avoir une variable "station_id", qui a un identifiant pour chaque station. Ceci sera utilisé pour associer les identifiants des stations d’observation aux identifiants des stations simulées à l’aide des tables de correspondance.

source: Notice that there are again 274 stations, like in the "qobs" dataset. This is because this specific dataset was used to perform leave-one-out cross validation to assess the optimal interpolation performance, and as such, only simulations at gauged sites is of interest. In an operational setting, there is no limit on the number of stations for "qsim".
fr: Notez qu'il y a encore 274 stations, comme dans le jeu de données "qobs". En effet, ce jeu de données spécifique a été utilisé pour effectuer une validation croisée sans intervention afin d'évaluer les performances d'interpolation optimales et, en tant que telle, seules les simulations sur des sites jaugés présentent un intérêt. Dans un contexte opérationnel, il n'y a pas de limite sur le nombre de stations pour "qsim".

source: Now let's take a look at the correspondance tables and the observed station dataset.
fr: Jetons maintenant un œil aux tables de correspondance et au jeu de données des stations observées.

source: To keep the observed and simulation station names separate, the following nomenclature has been adopted:
fr: Pour séparer les noms des stations observées et de simulation, la nomenclature suivante a été adoptée :

source: Observed stations are tagged as "station_id" in the station_correspondence dataset
fr: Les stations observées sont étiquetées comme "station_id" dans le jeu de données station_correspondence

source: Simulated stations are tagged as "reach_id" in the station_correspondence dataset
fr: Les stations simulées sont étiquetées comme "reach_id" dans le jeu de données station_correspondence
