Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/optimal_interpolation.po
Languages: fr

source: Notice that there are 296 stations in this table, whereas we only had 274 stations in the flow datasets. This is completely acceptable, as long as all observed-simulation pairs are found in the station_correspondence dataset. If some are missing, the code will raise an exception.
fr: Notez qu'il y a 296 stations dans ce tableau, alors que nous n'avions que 274 stations dans les jeux de données de débits. Ceci est tout à fait acceptable, tant que toutes les paires observation-simulation se trouvent dans le jeu de données station_correspondence. S'il en manque, le code déclenchera une exception.

source: Finally, let's see the contents of the observation_stations variable, which tells the model which of the 274 observation stations should be used to build the error covariance model and perform the optimal interpolation. These stations need to be a subset of the 274 observed stations.
fr: Enfin, voyons le contenu de la variable observation_stations, qui indique au modèle laquelle des 274 stations d'observation doit être utilisée pour construire le modèle de covariance d'erreur et effectuer l'interpolation optimale. Ces stations doivent constituer un sous-ensemble des 274 stations observées.

source: As can be seen, it is simply a list of stations. It can be generated by any means by users, as long as it is in list form and includes stations from the qobs "station_id" variables. For this test case, we used only 96 catchments that had a sufficient number of observed streamflow records.
fr: Comme on peut le constater, il s’agit simplement d’une liste de stations. Il peut être généré par tous les moyens par les utilisateurs, à condition qu'il soit sous forme de liste et qu'il inclue les stations issues des variables qobs "station_id". Pour ce cas de test, nous avons utilisé seulement 96 bassins versants comportant un nombre suffisant d’enregistrements de débits observés.

source: We can now provide more details on some hyperparameters. Note that many of the hyperparameters of the test example are not required here, as the model will impose some choices and determine other values from the data directly. For example, the ECF model used is 'Model 3', and its parameters are optimized to best fit the available data.
fr: Nous pouvons désormais fournir plus de détails sur certains hyperparamètres. Notez que de nombreux hyperparamètres de l'exemple de test ne sont pas requis ici, car le modèle imposera certains choix et déterminera directement d'autres valeurs à partir des données. Par exemple, le modèle ECF utilisé est le « Modèle 3 » et ses paramètres sont optimisés pour s'adapter au mieux aux données disponibles.

source: At this stage, the only missing required data is as follows:
fr: A ce stade, les seules données manquantes requises sont les suivantes :

source: We can now do a bit of processing to ensure we only provide the desired data:
fr: Nous pouvons maintenant effectuer un peu de traitement pour nous assurer de fournir uniquement les données souhaitées :

source: We are now ready to perform the optimal interpolation, return the results in the form of a dataset, and explore that dataset:
fr: Nous sommes maintenant prêts à effectuer l'interpolation optimale, à renvoyer les résultats sous la forme d'un jeu de données et à explorer ce jeu de données :

source: We can see that the returned dataset has a variable called "streamflow" of size **[percentile, station_id, time]**.
fr: Nous pouvons voir que le jeu de données renvoyé a une variable appelée "streamflow" de taille **[percentile, station_id, time]**.

source: This variable can be explored to get the flow estimation for each percentile requested to assess the uncertainty. For example, let's explore the value for the 50th percentile, i.e. the percentile value at index 1.
fr: Cette variable peut être explorée pour obtenir l'estimation du débit pour chaque centile demandé pour évaluer l'incertitude. Par exemple, explorons la valeur du 50e centile, c'est-à-dire la valeur du centile à l'indice 1.

source: We can go further and extract the data for one catchment. We will also store it into a separate variable for further analysis.
fr: Nous pouvons aller plus loin et extraire les données pour un bassin versant. Nous les stockerons également dans une variable distincte pour une analyse plus approfondie.

source: We can do a similar processing for the observed and raw simulation data:
fr: Nous pouvons faire un traitement similaire pour les données observées et brutes de simulation :

source: We can plot these results and look for improvement in the simulations after the optimal interpolation:
fr: Nous pouvons représenter graphiquement ces résultats et rechercher une amélioration dans les simulations après l'interpolation optimale :
