Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/pmp.po
Languages: fr

source: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ proposed that only precipitable water values from time steps with at least 0.25 mm/6h of solid precipitation (expressed as water equivalent) and less than 0.1 mm/6h of rain should be considered. Since in this example we are working with daily time steps, these thresholds were adjusted to 1 mm/day and 0.4 mm/day, respectively.
fr: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ ont proposé de ne considérer que les valeurs d'eau précipitable correspondant à des pas de temps présentant au moins 0,25 mm/6h de précipitations solides (exprimées en équivalent en eau) et moins de 0,1 mm/6h de pluie. Étant donné que dans cet exemple nous utilisons des pas de temps quotidiens, ces seuils ont été ajustés à 1 mm/jour et 0,4 mm/jour, respectivement.

source: In some cases, both snowfall and rainfall occur during the same time step. However, it is typically not possible to distinguish between them. To avoid including precipitable water values associated with rainfall events, the authors proposed the following three methods:
fr: Dans certains cas, des chutes de neige et des précipitations ont lieu au cours du même pas de temps. Cependant, il n’est généralement pas possible de les distinguer. Pour éviter d’inclure des valeurs d’eau précipitable associées aux événements pluvieux, les auteurs ont proposé les trois méthodes suivantes :

source: **m1**: Only snowfall events that are not accompanied by rain, are considered for maximization. For the precipitable water corresponding to a certain event, we consider only time steps that show at least the minimum amount of snowfall and less than the minimum amount of rain.
fr: **m1** : Seuls les événements de neige non accompagnés de pluie sont pris en compte pour la maximisation. Pour l’eau précipitable correspondant à un événement donné, on ne considère que les pas de temps présentant au moins la quantité minimale de neige et moins que la quantité minimale de pluie.

source: **m2**: Snowfall events that exceed the established threshold for maximization (i.e., minimum amount of snowfall) are maximized, regardless whether they are accompanied by rain or not. For the precipitable water corresponding to a certain event, we consider only time steps that show at least the minimum amount snowfall.
fr: **m2** : Les événements de neige dépassant le seuil établi pour la maximisation (c’est-à-dire la quantité minimale de neige) sont maximisés, qu’ils soient accompagnés de pluie ou non. Pour l’eau précipitable correspondant à un événement donné, on considère uniquement les pas de temps présentant au moins la quantité minimale de neige.

source: **m3**: Same events as those selected for M2, but if additionally more than the minimum amount of rain occurs, the precipitable water is multiplied by the ratio of snowfall [mm water equivalent] over total precipitation. The multiplication provides a means to estimate the amount of precipitable water that leads to snowfall.
fr: **m3** : Ce sont les mêmes événements que ceux sélectionnés pour m2, mais si la quantité de pluie dépasse également le seuil minimal, l’eau précipitable est multipliée par le rapport entre la neige (en mm équivalent d'eau) et les précipitations totales. Cette multiplication permet d’estimer la quantité d’eau précipitable conduisant aux chutes de neige.

source: We start by calculating the precipitation events and their rain and snow components for a given accumulation.
fr: Nous commençons par calculer les événements de précipitation et leurs composantes de pluie et de neige pour une accumulation donnée.

source: To keep the example simple, the duration of the precipitation event is set to one time step (windows=[1]). When computing the PMSA, users should pay close attention to the window parameter as it can significantly influences the PMSA results. `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suggests to use an algorithm that actually determines the real duration of every simulated snowfall rather than using predefined durations.
fr: Pour simplifier l'exemple, la durée de l'événement de précipitation est fixée à un seul pas de temps (windows = [1]). Lors du calcul de l'ANMP, les utilisateurs doivent porter une attention particulière au paramètre *window*, car il peut influencer de manière significative les résultats. `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suggèrent d’utiliser un algorithme permettant de déterminer la durée réelle de chaque chute de neige simulée, plutôt que d’utiliser des durées prédéfinies.

source: As suggested by `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__, in this example we used the methodology M3.
fr: Comme suggéré par `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__, nous avons utilisé la méthodologie M3 dans cet exemple.

source: Computation of Monthly 100-Year Precipitable Water leading to Snowfall (pw100)
fr: Calcul de l’eau précipitable mensuelle centennale menant à des chutes de neige (pw100)

source: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ recommend fitting a non-stationary Gamma distribution. Currently, only the stationary Gamma distribution is implemented, but a non-stationary version is planned for a future release. The GEV distribution can also be used for extrapolation purposes. A non-stationnary version of it is available in the xhydro package.
fr: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ recommandent d’ajuster une distribution Gamma non stationnaire. Actuellement, seule la version stationnaire est implémentée, mais une version non stationnaire est prévue pour une future mise à jour. La distribution GEV peut également être utilisée à des fins d’extrapolation. Une version non stationnaire de celle-ci est disponible dans le package *xhydro*.

source: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ also suggests using the maximum observed precipitable water as pw100 when there are fewer than 20 data points in a month (i.e., ``n=20``). Furthermore, in line with `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ methodology, pw100 is not limited (i.e., ``mf=None``). However, this assumption should be reviewed for each specific case.
fr: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suggèrent également d’utiliser l’eau précipitable maximale observée comme *pw100* lorsqu’il y a moins de 20 points de données dans un mois (c’est-à-dire ``n = 20``). De plus, conformément à leur méthodologie, *pw100* n’est pas limité (c’est-à-dire ``mf=None``). Cependant, cette hypothèse doit être examinée au cas par cas.

source: Maximization of Snowfall Events
fr: Maximisation des événements de neige

source: With the information gathered so far, we can now proceed to maximize the snowfall events. Although ``xHydro`` does not provide an explicit function for this step, it can be accomplished by following these steps:
fr: Avec les informations recueillies jusqu’à présent, nous pouvons maintenant procéder à la maximisation des événements de neige. Bien que ``xHydro`` ne fournisse pas de fonction explicite pour cette étape, cela peut être accompli en suivant les étapes suivantes :

source: **Compute the maximitation ratio (r)**: Calculate the ratio between the 100-year monthly precipitable water leading to snowfall and the precipitable water during snowfall events.
fr: **Calcul du rapport de maximisation (r)** : Calculez le ratio entre l’eau précipitable mensuelle centennale menant à des chutes de neige et l’eau précipitable observée lors des événements neigeux.

source: **Limit the ratio (r)**: Limit the ratio to 1≤r≤2.5 as suggested by `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__.
fr: **Limiter le rapport (r)** : Limitez le ratio à 1 ≤ r ≤ 2,5 comme suggéré par `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__.

source: **Apply the ratio**:
fr: **Appliquer le rapport** :

source: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suggest maximizing only those snowfall events that exceed a given threshold for a specified duration. Therefore, only events that meet this criterion are multiplied by the corresponding maximization ratio (r). If the criterion is not met, the snowfall event is not maximized.
fr: `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suggèrent de maximiser uniquement les événements de neige qui dépassent un seuil donné pendant une durée spécifiée. Ainsi, seuls les événements répondant à ce critère sont multipliés par le rapport de maximisation correspondant (r). Si le critère n’est pas rempli, l’événement neigeux n’est pas maximisé.

source: The authors used different thresholds depending on the duration of the event:
fr: Les auteurs ont utilisé différents seuils en fonction de la durée de l'événement :

source: 6-hour duration: 3, 4, 5, 6 mm
fr: Durée de 6 heures : 3, 4, 5, 6 mm

source: 12-hour duration: 4, 5, 6, 7 mm
fr: Durée de 12 heures : 4, 5, 6, 7 mm

source: 24-hour duration: 5, 6, 7, 8 mm
fr: Durée de 24 heures : 5, 6, 7, 8 mm

source: In this example, a 6-mm threshold was selected for the 1-day duration.
fr: Dans cet exemple, un seuil de 6 mm a été sélectionné pour la durée d'un jour.

source: The maximized snow accumulation (MSA) is the sum of the maximized and non-maximized events throughout a winter
fr: L'accumulation de neige maximisée (ANM) est la somme des événements maximisés et non maximisés tout au long d'un hiver

source: PMSA estimation
fr: Estimation de l'ANMP

source: The PMSA is the highest total among all winters defined.
fr: L'ANM est le total le plus élevé parmi tous les hivers définis.
