Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/pmp.po
Languages: fr

source: Inputs for the Probable Maximum flood (PMF)
fr: Entrées pour la crue maximale probable (CMP)

source: Probable Maximum Precipitation (PMP)
fr: Précipitation maximale probable (PMP)

source: Probable Maximum Precipitation (PMP) is the theoretical maximum amount of precipitation that could occur at a specific location within a given period of time, considering the most extreme meteorological conditions. PMP is a critical parameter in hydrology, especially for the design of infrastructure such as dams, reservoirs, and drainage systems.
fr: La Précipitation Maximale Probable (PMP) est la quantité théorique maximale de précipitations qui pourrait se produire à un endroit spécifique dans un laps de temps donné, en tenant compte des conditions météorologiques les plus extrêmes. La PMP est un paramètre critique en hydrologie, en particulier pour la conception d'infrastructures telles que les barrages, réservoirs et systèmes de drainage.

source: There are several methods for calculating PMP, each varying in complexity and the type of data used. The method currently implemented in ``xHydro`` is based on the approach outlined by `Clavet-Gaumont et al. (2017) <https://doi.org/10.1016/j.ejrh.2017.07.003>`__. This method involves maximizing the precipitable water over a given location, which refers to the total water vapor in the atmosphere that could potentially be converted into precipitation under ideal conditions. By maximizing this value, the method estimates the maximum precipitation that could theoretically occur at the location.
fr: Il existe plusieurs méthodes pour calculer la PMP, chacune variant en complexité et en fonction du type de données utilisées. La méthode actuellement implémentée dans ``xHydro`` est basée sur l'approche décrite par `Clavet-Gaumont et al. (2017) <https://doi.org/10.1016/j.ejrh.2017.07.003>`__. Cette méthode consiste à maximiser l'eau précipitable sur un emplacement donné, ce qui fait référence à la quantité totale de vapeur d'eau dans l'atmosphère qui pourrait être potentiellement convertie en précipitations dans des conditions idéales. En maximisant cette valeur, la méthode estime la précipitation maximale qui pourrait théoriquement se produire à cet endroit.

source: Acquiring data
fr: Acquisition des données

source: The acquisition of climatological data is outside the scope of ``xHydro``. However, some examples of how to obtain and handle such data are provided in the `GIS operations <gis.ipynb>`__ and `Use Case Example <use_case.ipynb>`__ notebooks. For this notebook, we will use a test dataset consisting of 2 years and 3x3 grid cells from CanESM5 climate model data. In a real application, it would be preferable to have as many years of data as possible.
fr: L'acquisition des données climatiques est hors de la portée de ``xHydro``. Cependant, quelques exemples de comment obtenir et gérer de telles données sont fournis dans les Notebooks `Opérations SIG <gis.ipynb>`__ et `Exemple de cas d'application <use_case.ipynb>`__. Pour ce Notebook, nous allons utiliser un jeu de données test composé de 2 ans et de 9 points de grille issus des données du modèle climatique CanESM5. Dans une application réelle, il serait préférable d'avoir autant d'années de données que possible.

source: To perform the analysis, certain climatological variables are required.
fr: Pour effectuer l'analyse, certaines variables climatiques sont nécessaires.

source: **Daily Timestep Variables**:
fr: **Variables au pas de temps quotidien**:

source: ``pr`` → Precipitation flux
fr: ``pr`` → Flux de précipitations

source: ``snw`` → Snow water equivalent
fr: ``snw`` → Équivalent en eau de neige

source: ``hus`` → Specific humidity for multiple pressure levels
fr: ``hus`` → Humidité spécifique pour plusieurs niveaux de pression

source: ``zg`` → Geopotential height for multiple pressure levels
fr: ``zg`` → Hauteur géopotentielle pour plusieurs niveaux de pression

source: **Fixed Field Variables**:
fr: **Variables de champ fixe**:

source: ``orog`` → Surface altitude
fr: ``orog`` → Altitude de la surface

source: In cold regions, it may be necessary to split total precipitation into rainfall and snowfall components. Many climate models already provide this data separately. However, if this data is not directly available, libraries such as ``xclim`` can approximate the split using precipitation and temperature data.
fr: Dans les régions froides, il peut être nécessaire de diviser les précipitations totales en composantes de pluie et de neige. De nombreux modèles climatiques fournissent déjà ces données séparément. Cependant, si ces données ne sont pas directement disponibles, des librairies comme ``xclim`` peuvent approximer la division en utilisant les données de précipitations et de température.

source: Computing the PMP
fr: Calcul de la PMP

source: The method outlined by `Clavet-Gaumont et al. (2017) <https://doi.org/10.1016/j.ejrh.2017.07.003>`__ follows these steps:
fr: La méthode décrite par `Clavet-Gaumont et al. (2017) <https://doi.org/10.1016/j.ejrh.2017.07.003>`__ suit ces étapes :

source: **Identification of Major Precipitation Events**:
fr: **Identification des grands événements de précipitation**:

source: The first step involves identifying the major precipitation events that will be maximized. This is done by filtering events based on a specified threshold.
fr: La première étape consiste à identifier les grands événements de précipitation qui seront maximisés. Cela se fait en filtrant les événements en fonction d'un seuil spécifié.

source: **Computation of Monthly 100-Year Precipitable Water**:
fr: **Calcul de l'eau précipitable mensuelle de récurrence 100 ans**:

source: The next step involves calculating the 100-year precipitable water on a monthly basis using the Generalized Extreme Value (GEV) distribution, with a maximum cap of 20% greater than the largest observed value.
fr: L'étape suivante consiste à calculer l'eau précipitable de récurrence 100 ans sur une base mensuelle en utilisant la distribution des Valeurs Extrêmes Généralisées (GEV), avec un plafond maximum de 20 % supérieur à la valeur observée la plus grande.

source: **Maximization of Precipitation During Events**:
fr: **Maximisation des précipitations lors des événements**:

source: In this step, the precipitation events are maximized based on the ratio between the 100-year monthly precipitable water and the precipitable water during the major precipitation events. In snow-free regions, this is the final result.
fr: À cette étape, les événements de précipitation sont maximisés en fonction du rapport entre l'eau précipitable mensuelle de récurrence 100 ans et l'eau précipitable lors des principaux événements de précipitation. Dans les régions sans neige, c'est le résultat final.

source: **Seasonal Separation in Cold Regions**:
fr: **Séparation saisonnière dans les régions froides**:

source: In cold regions, the results are separated into seasons (e.g., spring, summer) to account for snow during the computation of Probable Maximum Floods (PMF).
fr: Dans les régions froides, les résultats sont séparés en saisons (par exemple, printemps, été) pour tenir compte de la neige lors du calcul des Crues Maximales Probables (CMP).

source: This method provides a comprehensive approach for estimating the PMP, taking into account both temperature and precipitation variations across different regions and seasons.
fr: Cette méthode fournit une approche complète pour estimer la PMP, en tenant compte à la fois des variations de température et de précipitations à travers différentes régions et saisons.

source: Major precipitation events
fr: Grands événements de précipitation

source: The first step in calculating the Probable Maximum Precipitation (PMP) involves filtering the precipitation data to retain only the events that exceed a certain threshold. These major precipitation events will be maximized in subsequent steps. The function ``xh.indicators.pmp.major_precipitation_events`` can be used for this purpose. It also provides the option to sum precipitation over a specified number of days, which can help aggregate storm events. For 2D data, such as in this example, each grid point is treated independently.
fr: La première étape pour calculer la Précipitation Maximale Probable (PMP) consiste à filtrer les données de précipitation pour ne retenir que les événements qui dépassent un certain seuil. Ces grands événements de précipitation seront maximisés dans les étapes suivantes. La fonction ``xh.indicators.pmp.major_precipitation_events`` peut être utilisée à cette fin. Elle offre également l'option de sommer les précipitations sur un nombre spécifié de jours, ce qui peut aider à agréger les événements de tempête. Pour les données 2D, comme dans cet exemple, chaque point de grille est traité indépendamment.

source: In this example, we will filter out the 10% most intense storms to avoid overemphasizing smaller precipitation events during the maximization process. Additionally, we will focus on rainfall (``rf``) rather than total precipitation (``pr``) to exclude snowstorms and ensure that we are only considering liquid precipitation events.
fr: Dans cet exemple, nous allons filtrer les 10 % des tempêtes les plus intenses pour éviter de surévaluer les événements de précipitation plus petits pendant le processus de maximisation. De plus, nous nous concentrerons sur les précipitations liquides (``rf``) plutôt que sur les précipitations totales (``pr``) afin d'exclure les tempêtes de neige.

source: Daily precipitable water
fr: Eau précipitable quotidienne

source: WARNING
fr: AVERTISSEMENT

source: This step should be avoided if possible, as it involves approximating precipitable water from the integral of specific humidity and will be highly sensitive to the number of pressure levels used. If available, users are strongly encouraged to use a variable or combination of variables that directly represent precipitable water.
fr: Cette étape doit être évitée si possible, car elle consiste à approximer l'eau précipitable à partir de l'intégrale de l'humidité spécifique et sera fortement sensible au nombre de niveaux de pression utilisés. Si disponible, les utilisateurs sont fortement encouragés à utiliser une variable ou une combinaison de variables qui représentent directement l'eau précipitable.

source: Precipitable water can be estimated using ``xhydro.indicators.pmp.precipitable_water`` by integrating the vertical column of humidity. This process requires specific humidity, geopotential height, and elevation data. The resulting value represents the total amount of water vapor that could potentially be precipitated from the atmosphere under ideal conditions.
fr: L'eau précipitable peut être estimée en utilisant ``xhydro.indicators.pmp.precipitable_water`` pour intégrer la colonne verticale de l'humidité. Ce processus nécessite des données d'humidité spécifique, de hauteur géopotentielle et d'altitude. La valeur résultante représente la quantité totale de vapeur d'eau qui pourrait être précipitée de l'atmosphère sous des conditions idéales.

source: Monthly 100-year precipitable water
fr: Eau précipitable mensuelle de récurrence 100 ans

source: According to Clavet-Gaumont et al. (2017), a monthly 100-year precipitable water must be computed using the Generalized Extreme Value (GEV) distribution. The value should be limited to a maximum of 20% greater than the largest observed precipitable water value for a given month. This approach ensures that the estimated 100-year event is realistic and constrained by observed data.
fr: Selon Clavet-Gaumont et al. (2017), l'eau précipitable mensuelle de récurrence 100 ans doit être calculée en utilisant la distribution des Valeurs Extrêmes Généralisées (GEV). La valeur doit être limitée à un maximum de 20 % supérieur à la valeur maximale observée de l'eau précipitable pour un mois donné. Cette approche garantit que l'événement estimé sur 100 ans est réaliste et contraint par les données observées.

source: To compute this, you can use the ``xh.indicators.pmp.precipitable_water_100y`` function. If using ``rebuild_time``, the output will have the same time axis as the original data.
fr: Pour calculer cela, vous pouvez utiliser la fonction ``xh.indicators.pmp.precipitable_water_100y``. Si vous utilisez ``rebuild_time``, la sortie aura le même axe temporel que les données d'origine.

source: Maximized precipitation
fr: Précipitations maximisées

source: This step follows the methodology described in Clavet-Gaumont et al., 2017. It is referred to as "Maximizing precipitation", however, it effectively applies a ratio based on the monthly 100-year precipitable water. If a historical event surpassed this value—such as the case observed for January 2011—the result may actually lower the precipitation, rather than increasing it.
fr: Cette étape suit la méthodologie décrite dans Clavet-Gaumont et al., 2017. Elle est appelée "Maximisation des précipitations", cependant, elle applique effectivement un rapport basé sur l'eau précipitable mensuelle de récurrence 100 ans. Si un événement historique a dépassé cette valeur—comme cela a été observé pour janvier 2011—le résultat peut en réalité réduire les précipitations, plutôt que de les augmenter.

source: With the information gathered so far, we can now proceed to maximize the precipitation events. Although ``xHydro`` does not provide an explicit function for this step, it can be accomplished by following these steps:
fr: Avec les informations recueillies jusqu'à présent, nous pouvons procéder à la maximisation des événements de précipitation. Bien que ``xhydro`` ne fournisse pas de fonction explicite pour cette étape, elle peut être accomplie en suivant ces étapes:

source: **Compute the Ratio**: First, calculate the ratio between the 100-year monthly precipitable water and the precipitable water during the major precipitation events.
fr: **Calculer le rapport**: Premièrement, calculez le rapport entre l'eau précipitable mensuelle de récurrence 100 ans et l'eau précipitable lors des principaux événements de précipitation.

source: **Apply the Ratio**: Next, apply this ratio to the precipitation values themselves to maximize the precipitation events accordingly.
fr: **Appliquer le rapport** : Ensuite, appliquez ce rapport aux valeurs de précipitations elles-mêmes pour maximiser les événements de précipitation en conséquence.

source: This process effectively scales the precipitation events based on the 100-year precipitable water, giving an estimate of the maximum possible rainfall.
fr: Ce processus ajuste les événements de précipitation en fonction de l'eau précipitable de récurrence 100 ans, fournissant une estimation des précipitations maximales possibles.

source: Seasonal Mask
fr: Masque saisonnier

source: In cold regions, computing Probable Maximum Floods (PMFs) often involves scenarios that combine both rainfall and snowpack. Therefore, PMP values may need to be separated into two categories: rain-on-snow (i.e., "spring") and snow-free rainfall (i.e., "summer").
fr: Dans les régions froides, le calcul des Crues Maximales Probables (CMP) implique souvent des scénarios qui combinent à la fois les précipitations et le manteau neigeux. Par conséquent, les valeurs de PMP peuvent devoir être séparées en deux catégories : pluie-sur-neige (c'est-à-dire, "printemps") et précipitations sans neige (c'est-à-dire, "été").

source: This can be computed easily using ``xhydro.indicators.pmp.compute_spring_and_summer_mask``, which defines the start and end dates of spring, summer, and winter based on the presence of snow on the ground, with the following criteria:
fr: Cela peut être facilement calculé en utilisant ``xhydro.indicators.pmp.compute_spring_and_summer_mask``, qui définit les dates de début et de fin du printemps, de l'été et de l'hiver en fonction de la présence de neige au sol, selon les critères suivants :

source: **Winter**:
fr: **Hiver** :

source: Winter start: The first day after which there are at least 14 consecutive days with snow on the ground.
fr: Début de l'hiver : Le premier jour après lequel il y a au moins 14 jours consécutifs avec de la neige au sol.

source: Winter end: The last day with snow on the ground, followed by at least 45 consecutive snow-free days.
fr: Fin de l'hiver : Le dernier jour avec de la neige au sol, suivi d'au moins 45 jours consécutifs sans neige.

source: **Spring**:
fr: **Printemps** :

source: Spring start: 60 days before the end of winter.
fr: Début du printemps : 60 jours avant la fin de l'hiver.

source: Spring end: 30 days after the end of winter.
fr: Fin du printemps : 30 jours après la fin de l'hiver.

source: **Summer**:
fr: **Été** :

source: The summer period is defined as the time between winters. This period is not influenced by whether it falls in the traditional summer or fall seasons, but rather simply marks the interval between snow seasons.
fr: La période estivale est définie comme la période entre les hivers. Cette période n'est pas influencée par le fait qu'elle tombe pendant l'été ou l'automne traditionnels, mais marque simplement l'intervalle entre les saisons de neige.

source: Final PMP
fr: PMP finale

source: The final PMP is obtained by finding the maximum value over the ``time`` dimension. In our case, since we computed a season mask, we can further refine the results into a spring and summer PMP.
fr: La PMP finale est obtenue en trouvant la valeur maximale sur la dimension ``time``. Dans notre cas, puisque nous avons calculé un masque saisonnier, nous pouvons affiner les résultats en une PMP pour le printemps et l'été.

source: PMPs with aggregated storm configurations
fr: PMP avec configurations de tempêtes agrégées

source: In some cases, it may be preferable to avoid processing each grid cell independently. Instead, storms can be aggregated using various configurations to provide a more regionally representative estimate. These configurations allow for the spatial averaging of storm events, which can help reduce variability across grid cells and yield more reliable results.
fr: Dans certains cas, il peut être préférable d'éviter de traiter chaque point de grille indépendamment. À la place, les tempêtes peuvent être agrégées en utilisant différentes configurations pour fournir une estimation plus représentative à l'échelle régionale. Ces configurations permettent une moyenne spatiale des événements de tempête, ce qui peut aider à réduire la variabilité entre les points de grille et fournir des résultats plus fiables.

source: Different aggregation configurations are discussed in Clavet-Gaumont et al. (2017) and have been implemented in ``xHydro`` under the function ``xhydro.indicators.pmp.spatial_average_storm_configurations``.
fr: Différentes configurations d'agrégation sont discutées dans Clavet-Gaumont et al. (2017) et ont été implémentées dans ``xHydro`` sous la fonction ``xhydro.indicators.pmp.spatial_average_storm_configurations``.

source: Note that precipitable water must first be calculated in a distributed manner and then spatially averaged to obtain the aggregated precipitable water.
fr: Notez que l'eau précipitable doit d'abord être calculée de manière distribuée puis moyennée spatialement pour obtenir l'eau précipitable agrégée.

source: After applying storm aggregation, the subsequent steps remain the same as before, following the standard PMP calculation process outlined earlier.
fr: Après avoir appliqué l'agrégation des tempêtes, les étapes suivantes restent les mêmes qu'auparavant, suivant le processus standard de calcul da le PMP.

source: Previously, the final PMP for each season was obtained by taking the maximum value over the ``time`` dimension. In this updated approach, we can now take the maximum across both the ``time`` and ``conf`` dimensions, using our multiple storm configurations.
fr: Auparavant, la PMP finale pour chaque saison était obtenue en prenant la valeur maximale sur la dimension ``time``. Dans cette approche mise à jour, nous pouvons désormais prendre la valeur maximale à la fois sur les dimensions ``time`` et ``conf``, en utilisant nos multiples configurations de tempêtes.

source: Probable Maximum Snow Accumulation (PMSA)
fr: Accumulation de neige maximale probable (ANMP)

source: The PMSA represents the theoretical maximum snow water equivalent (SWE) that could accumulate in a year under the most extreme meteorological conditions. The method currently implemented in ``xHydro`` follows the approach introduced by `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__. In this study, the authors developed a PMSA estimation technique using simulated data from regional climate models to maximize the precipitable water leading to snowfall.
fr: L'ANMP représente l’équivalent en eau de neige (ÉEN) maximal théorique pouvant s’accumuler en une année dans les conditions météorologiques les plus extrêmes. La méthode actuellement implémentée dans ``xHydro`` suit l’approche présentée par `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__. Dans cette étude, les auteurs ont développé une technique d’estimation de l'ANMP à partir de données simulées issues de modèles climatiques régionaux, dans le but de maximiser l’eau précipitable associée aux chutes de neige.

source: The method outlined by `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ follows these steps:
fr: La méthode décrite par `Klein et al. (2016) <https://doi.org/10.1016/j.jhydrol.2016.03.031>`__ suit les étapes suivantes :

source: **Identification of the Precipitable Water leading to Snowfall**:
fr: **Identification de l’eau précipitable menant à des chutes de neige** :

source: Precipitable water data are filtered using specified thresholds for rainfall and snowfall to isolate values associated with snowfall events.
fr: Les données d’eau précipitable sont filtrées à l’aide de seuils définis pour la pluie et la neige, afin d’isoler les valeurs associées aux événements neigeux.

source: **Computation of Monthly 100-Year Precipitable Water leading to Snowfall**:
fr: **Calcul de l’eau précipitable mensuelle centennale associée à la neige** :

source: Monthly 100-year precipitable water values associated with snowfall are estimated using the Gamma distribution.
fr: Les valeurs mensuelles centennales d’eau précipitable associées aux chutes de neige sont estimées à l’aide de la distribution Gamma.

source: **Maximization of Snowfall Events**:
fr: **Maximisation des événements de chutes de neige** :

source: Snowfall events are maximized based on the ratio between the 100-year monthly precipitable water leading to snowfall and the precipitable water observed during snowfall events.
fr: Les événements de chutes de neige sont maximisés en fonction du ratio entre l'eau précipitable mensuelle centennale entraînant des chutes de neige et l'eau précipitable observée lors de ces événements.

source: **PMSA estimation**:
fr: **Estimation de l'ANMP** :

source: For each winter, both maximized and non-maximized snowfall events are aggregated. The PMSA is then defined as the highest total among all winters.
fr: Pour chaque hiver, les événements de neige maximisés et non maximisés sont agrégés. L'ANMP est ensuite définie comme le total le plus élevé parmi tous les hivers.

source: Identification of the Precipitable Water leading to Snowfall
fr: Identification de l'eau précipitable conduisant à des chutes de neige
