Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/regional_frequency_analysis.po
Languages: fr

source: Regional frequency analyses
fr: Analyses fréquentielles régionales

source: This notebook will demonstrate how to use the ``xHydro`` library to perform regional frequency analyses on a dataset of streamflow data. Since the initial steps for regional frequency analysis are the same as those for local frequency analysis, users are encouraged to refer to the `Local frequency analysis <local_frequency_analysis.ipynb>`__ notebook for an overview.
fr: Ce Notebook montrera comment utiliser la librairie ``xHydro`` pour réaliser des analyses fréquentielles régionales sur un jeu de données de débit. Comme les étapes initiales pour l'analyse fréquentielle régionale sont les mêmes que pour l'analyse fréquentielle locale, les utilisateurs sont invités à consulter le Notebook `Analyses fréquentielles locales <local_frequency_analysis.ipynb>`__ pour un aperçu.

source: For this example, we will use the same dataset of hydrometric gauges covering parts of southern Quebec, ensuring continuity with the previous analysis while expanding to a regional scale. However, as regional analyses rely on having access to multiple sources of data, we will extract streamflow for 15 stations.
fr: Dans cet exemple, nous utiliserons le même jeu de données de stations hydrométriques couvrant une partie du sud du Québec, assurant la continuité avec l'analyse précédente tout en s'étendant à une échelle régionale. Cependant, comme les analyses régionales nécessitent l'accès à plusieurs sources de données, nous allons extraire les débits pour 15 stations.

source: Explanatory variables
fr: Variables explicatives

source: In regional frequency analyses, explanatory variables are used to help explain the spatial variation in hydrological extremes across different locations. These variables can include factors such as catchment area, elevation, precipitation, land use, and soil type, among others. By incorporating explanatory variables, we can account for the influence of geographic and environmental characteristics on extreme events, allowing for more accurate regional predictions.
fr: Dans les analyses fréquentielles régionales, les variables explicatives sont utilisées pour aider à expliquer la variation spatiale des extrêmes hydrologiques à travers différents lieux. Ces variables peuvent inclure des facteurs tels que la superficie du bassin versant, l'altitude, les précipitations, l'utilisation des terres et le type de sol, entre autres. En intégrant ces variables explicatives, nous pouvons prendre en compte l'influence des caractéristiques géographiques et environnementales sur les événements extrêmes, ce qui permet d'obtenir des prédictions régionales plus précises.

source: a) Extraction of watershed characteristics using ``xhydro.gis``
fr: a) Extraction des caractéristiques des bassins versants à l’aide de ``xhydro.gis``

source: In this example, we'll use catchment properties as our primary explanatory variables. However, other variables, such as climatological averages or land use data, can also be incorporated depending on the analysis requirements. For detailed steps on how to extract and work with these data, refer to the `GIS operations <gis.ipynb>`__ notebook.
fr: Dans cet exemple, nous utiliserons les propriétés des bassins versants comme variables explicatives principales. Cependant, d'autres variables, telles que les moyennes climatiques ou les données d'utilisation des terres, peuvent également être intégrées en fonction des exigences de l'analyse. Pour les étapes détaillées sur comment extraire et travailler avec ces données, consultez le Notebook `Opérations SIG <gis.ipynb>`__.

source: b) Principal component analysis
fr: b) Analyse en composantes principales

source: After acquiring the explanatory variables, the next step is to process them using Principal Component Analysis (PCA) to reduce the dimensionality of the dataset. PCA helps simplify the dataset by transforming the original variables into a smaller set of uncorrelated components while retaining most of the variation in the data. This is accomplished using the function ``xhydro.frequency_analysis.regional.fit_pca``.
fr: Après avoir acquis les variables explicatives, l'étape suivante consiste à les traiter en utilisant l'Analyse en Composantes Principales (ACP) pour réduire la dimensionnalité du jeu de données. L'ACP permet de simplifier le jeu de données en transformant les variables originales en un ensemble réduit de composantes non corrélées, tout en conservant la plupart des variations dans les données. Cela est réalisé en utilisant la fonction ``xhydro.frequency_analysis.regional.fit_pca``.

source: The results show that the correlation between the components is close to 0, indicating that the first three components are sufficiently independent. This suggests that these components can be effectively used for the remainder of our analysis, as they capture most of the variation in the explanatory variables without significant overlap or multicollinearity.
fr: Les résultats montrent que la corrélation entre les composantes est proche de 0, ce qui suggère que les trois premières composantes sont suffisamment indépendantes. Cela indique que ces composantes peuvent être utilisées efficacement pour le reste de notre analyse, car elles capturent la majorité de la variation des variables explicatives, sans chevauchement ou multicolinéarité significative.

source: c) Clustering
fr: c) Clustering (regroupement)

source: The results from the PCA can be used to group the stations into clusters based on their similarities in the principal components. Clustering helps identify regions with similar characteristics, enabling more targeted and accurate regional frequency analyses. This step is accomplished using ``xhydro.frequency_analysis.regional.get_clusters``, which supports clustering methods from ``sklearn.cluster``. In this example, we will use ``AgglomerativeClustering`` to form 3 clusters based on the PCA results.
fr: Les résultats de l'ACP peuvent être utilisés pour regrouper les stations en clusters en fonction de leurs similarités dans les composantes principales. Le clustering aide à identifier des régions avec des caractéristiques similaires, permettant des analyses fréquentielles régionales plus ciblées et précises. Cette étape est réalisée en utilisant ``xhydro.frequency_analysis.regional.get_clusters``, qui prend en charge les méthodes de clustering de ``sklearn.cluster``. Dans cet exemple, nous utiliserons ``AgglomerativeClustering`` pour former 3 clusters en fonction des résultats de l'ACP.

source: Regional Frequency Analysis
fr: Analyse fréquentielle régionale

source: **Hosking and Wallis** introduced a method for regional frequency analysis based on L-moments, which are particularly useful for analyzing extreme events across different regions. Here’s a brief overview of the key concepts:
fr: **Hosking et Wallis** ont introduit une méthode pour l'analyse fréquentielle régionale basée sur les L-moments, qui sont particulièrement utiles pour l'analyse des événements extrêmes à travers différentes régions. Voici un aperçu des principaux concepts :

source: **L-Moments**: L-moments are statistical measures that are derived from linear combinations of order statistics. They offer a more robust alternative to traditional moments (like mean and variance), especially in the presence of outliers or when dealing with small sample sizes. L-moments are widely used in hydrological studies for estimating the characteristics of extreme values, as they provide more stable and reliable estimates.
fr: **L-Moments** : Les L-moments sont des mesures statistiques dérivées des combinaisons linéaires des statistiques d'ordre. Ils offrent une alternative plus robuste aux moments traditionnels (comme la moyenne et la variance), en particulier en présence de valeurs aberrantes ou lorsque l'on traite de petits échantillons. Les L-moments sont largement utilisés dans les études hydrologiques pour estimer les caractéristiques des valeurs extrêmes, car ils fournissent des estimations plus stables et fiables.

source: **Regional Frequency Analysis**: This technique involves pooling data from multiple sites or regions to estimate the frequency distribution of extreme events, such as floods or droughts. The approach allows for the determination of common statistical parameters across different locations, enabling a more generalized and regional perspective on extreme event behavior. Hosking and Wallis's method focuses on fitting a regional frequency distribution and assessing how well it captures the characteristics of the data.
fr: **Analyse fréquentielle régionale** : Cette technique consiste à regrouper les données de plusieurs sites ou régions pour estimer la distribution de fréquence des événements extrêmes, tels que les inondations ou les sécheresses. L'approche permet de déterminer les paramètres statistiques communs à différents endroits, offrant ainsi une perspective plus généralisée et régionale sur le comportement des événements extrêmes. La méthode de Hosking et Wallis se concentre sur l'ajustement d'une distribution fréquentielle régionale et l'évaluation de sa capacité à capturer les caractéristiques des données.

source: **Regional L-Moments**: These are L-moments calculated from pooled data across multiple sites within a region. By applying regional L-moments, we can estimate the parameters of regional frequency distributions and better understand the occurrence of extreme events in different parts of the region. This method improves the accuracy and robustness of predictions for extreme events, particularly when data from multiple sites are available.
fr: **L-Moments régionaux** : Il s'agit des L-moments calculés à partir des données regroupées de plusieurs sites au sein d'une région. En appliquant les L-moments régionaux, nous pouvons estimer les paramètres des distributions fréquentielles régionales et mieux comprendre l'occurrence des événements extrêmes dans différentes parties de la région. Cette méthode améliore la précision et la robustesse des prédictions des événements extrêmes, en particulier lorsque des données de plusieurs sites sont disponibles.

source: Let's start by calculating the L-moments for each station using ``xhydro.frequency_analysis.regional.calc_moments``.
fr: Commençons par calculer les L-moments pour chaque station en utilisant ``xhydro.frequency_analysis.regional.calc_moments``.

source: To perform regional frequency analysis, we need to reshape our datasets of annual maximums and L-moments based on the groupings identified by the clustering algorithm. Since there is no standardized naming convention for this new dimension, ``xHydro`` uses the name ``region_id`` for the cluster groupings. This reshaping process is handled by the function ``xhydro.frequency_analysis.regional.group_ds_by_regions``, which organizes the data according to the cluster assignments and prepares it for further analysis.
fr: Pour effectuer une analyse fréquentielle régionale, nous devons remodeler nos jeux de données de maximums annuels et de L-moments en fonction des regroupements identifiés par l'algorithme de clustering. Étant donné qu'il n'existe pas de convention de nommage standardisée pour cette nouvelle dimension, ``xHydro`` utilise le nom ``region_id`` pour les regroupements de clusters. Ce processus de remodelage est géré par la fonction ``xhydro.frequency_analysis.regional.group_ds_by_regions``, qui organise les données en fonction des affectations de clusters et les prépare pour l'analyse ultérieure.

source: We now need to compute two important scores for evaluating the regional frequency analysis: the *H-Score* and the *Z-Score*. The H-Score measures the homogeneity of data across different sites or regions relative to the regional model. It helps determine how well the data from multiple sites align with the regional distribution. The Z-Score quantifies the discrepancy between the observed and expected values, standardized by their variability. It helps determine how well the theoretical distribution (based on the regional model) fits the observed data.
fr: Nous devons maintenant calculer deux scores importants pour évaluer l'analyse fréquentielle régionale : le *H-Score* et le *Z-Score*. Le H-Score mesure l'homogénéité des données à travers différents sites ou régions par rapport au modèle régional. Il permet de déterminer dans quelle mesure les données de plusieurs sites s'alignent avec la distribution régionale. Le Z-Score quantifie l'écart entre les valeurs observées et attendues, standardisé par leur variabilité. Il aide à déterminer dans quelle mesure la distribution théorique (basée sur le modèle régional) correspond aux données observées.

source: **H-Score (Homogeneity Score)**
fr: **H-Score (Score d'homogénéité)**

source: **H < 1: Homogeneous**
fr: **H < 1 : Homogène**

source: This indicates that the data from different sites are quite similar and align well with the regional model, suggesting that the regional model is suitable for the entire region.
fr: Cela indique que les données des différents sites sont assez similaires et s'alignent bien avec le modèle régional, ce qui suggère que le modèle régional est adapté pour l'ensemble de la région.

source: **1 ≤ H < 2: Maybe Homogeneous**
fr: **1 ≤ H < 2 : Peut-être homogène**

source: This range suggests some heterogeneity, meaning the data might still generally fit the regional model, but there are some variations that the model does not fully capture.
fr: Cette plage suggère une certaine hétérogénéité, ce qui signifie que les données peuvent encore s'adapter généralement au modèle régional, mais qu'il existe des variations que le modèle ne capture pas entièrement.

source: **H ≥ 2: Heterogeneous**
fr: **H ≥ 2 : Hétérogène**

source: A score this high indicates significant differences between sites or regions, suggesting that the regional model might not be appropriate for all the data. The region may be too diverse or require model adjustments.
fr: Un score aussi élevé indique des différences significatives entre les sites ou les régions, suggérant que le modèle régional pourrait ne pas être adapté à toutes les données. La région peut être trop diverse ou nécessiter des ajustements du modèle.

source: **Z-Score (Goodness of Fit)**
fr: **Z-Score (Qualité de l'ajustement)**

source: **Low Z-Score**: A low Z-Score suggests a good fit between the model and the observed data. Typically, an absolute Z-Score below 1.64 indicates that the model is appropriate and the fit is statistically acceptable.
fr: **Z-Score faible** : Un Z-Score faible suggère un bon ajustement entre le modèle et les données observées. En général, un Z-Score absolu inférieur à 1,64 indique que le modèle est approprié et que l'ajustement est statistiquement acceptable.

source: **High Z-Score**: A high Z-Score suggests significant discrepancies between observed and expected values. An absolute Z-Score above 1.64 implies that the model might not fit the data well, and further adjustments or a different model might be needed.
fr: **Z-Score élevé** : Un Z-Score élevé suggère des écarts significatifs entre les valeurs observées et attendues. Un Z-Score absolu supérieur à 1,64 implique que le modèle ne correspond peut-être pas bien aux données et que des ajustements supplémentaires ou un modèle différent pourraient être nécessaires.

source: The function ``xhydro.frequency_analysis.regional.calc_h_z`` is used to compute the *H-Score* and *Z-Score* for the regional frequency analysis.
fr: La fonction ``xhydro.frequency_analysis.regional.calc_h_z`` est utilisée pour calculer le *H-Score* et le *Z-Score* pour l'analyse fréquentielle régionale.

source: WARNING
fr: AVERTISSEMENT

source: The ``kap`` argument in the ``xhydro.frequency_analysis.regional.calc_h_z`` function expects a Kappa3 distribution object generated using ``lmoments3.distr.KappaGen()``. However, due to licensing issues, the ``lmoments3`` library cannot currently be included in the ``xHydro`` requirements and must be installed independently.
fr: L'argument ``kap`` dans la fonction ``xhydro.frequency_analysis.regional.calc_h_z`` attend un objet de distribution Kappa3 généré à l'aide de ``lmoments3.distr.KappaGen()``. En raison de problèmes de licence, la librairie ``lmoments3`` ne peut pas être incluse dans les exigences de ``xHydro`` et doit être installée indépendamment.

source: We can filter the results to include only the data that has H and Z scores below given thresholds using the function ``xhydro.frequency_analysis.regional.mask_h_z``. By default, the thresholds are set to 1 for H and 1.64 for Z. However, these thresholds can be customized to suit the specific requirements of the analysis.
fr: Nous pouvons filtrer les résultats pour inclure uniquement les données ayant des scores H et Z inférieurs aux seuils donnés en utilisant la fonction ``xhydro.frequency_analysis.regional.mask_h_z``. Par défaut, les seuils sont définis à 1 pour H et 1,64 pour Z. Cependant, ces seuils peuvent être personnalisés en fonction des exigences spécifiques de l'analyse fréquentielle.

source: The final step of the regional frequency analysis is similar to the local frequency analysis, but instead of using ``xhydro.frequency_analysis.local.parametric_quantiles``, we use ``xhydro.frequency_analysis.regional.calculate_return_period`` to calculate the return periods. Additionally, to avoid performing the analysis on very small regions, the ``remove_small_regions`` argument can be used to exclude any regions with less than a specified number of stations. By default, this threshold is set to 5.
fr: La dernière étape de l'analyse fréquentielle régionale est similaire à l'analyse fréquentielle locale, mais au lieu d'utiliser ``xhydro.frequency_analysis.local.parametric_quantiles``, nous utilisons ``xhydro.frequency_analysis.regional.calculate_return_period`` pour calculer les périodes de retour. De plus, pour éviter de réaliser l'analyse sur des régions très petites, l'argument ``remove_small_regions`` peut être utilisé pour exclure toute région comportant moins d'un nombre spécifié de stations. Par défaut, ce seuil est fixé à 5.

source: Let's plot results for one station, comparing local and regional analyses.
fr: Affichons les résultats pour une station, en comparant les analyses locales et régionales.

source: Uncertainties
fr: Incertitudes

source: Uncertainties are an important aspect of frequency analysis and should be considered when interpreting results. These uncertainties often stem from data quality, the choice of distribution, and the estimation of parameters. While visualizations can provide insights into the model fit, it’s crucial to quantify and account for uncertainties, such as confidence intervals for parameter estimates, to ensure robust conclusions.
fr: Les incertitudes sont un aspect important de l'analyse fréquentielle et doivent être prises en compte lors de l'interprétation des résultats. Ces incertitudes proviennent souvent de la qualité des données, du choix de la distribution et de l'estimation des paramètres. Bien que les visualisations puissent fournir des informations sur l'ajustement du modèle, il est essentiel de quantifier et de prendre en compte les incertitudes, telles que les intervalles de confiance pour les estimations des paramètres, afin d'assurer des conclusions robustes.

source: a) Bootstrapping the observations
fr: a) Bootstrap des observations

source: One method for quantifying uncertainties is to bootstrap the observations. In this example, we will perform bootstrapping a small number of times to illustrate the process, though in practice, a higher number of iterations (e.g., 5000) is recommended to obtain more reliable estimates. Bootstrapping resamples the observed data with replacement to generate multiple datasets, which can then be used to assess the variability in the model's parameters and results.
fr: Une méthode pour quantifier les incertitudes consiste à effectuer un bootstrap des observations. Dans cet exemple, nous effectuerons le bootstrap un petit nombre de fois pour illustrer le processus, bien qu'en pratique, un nombre plus élevé d'itérations (par exemple, 5000) soit recommandé pour obtenir des estimations plus fiables. Le bootstrap consiste à rééchantillonner les données observées avec remplacement pour générer plusieurs ensembles de données, qui peuvent ensuite être utilisés pour évaluer la variabilité des paramètres et des résultats du modèle.

source: This can be accomplished by calling ``xhydro.frequency_analysis.uncertainties.bootstrap_obs``. One key difference with local analyses is that for regional analyses, no fitting step is involved, making this function significantly faster. Instead, the results are obtained by first using ``xhydro.frequency_analysis.uncertainties.calc_moments_iter`` to compute L-moments for all bootstrap samples. Then, ``xhydro.frequency_analysis.uncertainties.calculate_quantiles_over_boostraped_groups`` is used to calculate the return periods based on those L-moments.
fr: Cela peut être réalisé en appelant ``xhydro.frequency_analysis.uncertainties.bootstrap_obs``. Une différence importante avec les analyses locales est qu'aucune étape d'ajustement n'est nécessaire pour les analyses fréquentielles régionales, ce qui rend cette fonction beaucoup plus rapide. Les résultats sont obtenus en utilisant d'abord ``xhydro.frequency_analysis.uncertainties.calc_moments_iter`` pour calculer les L-moments pour tous les échantillons de bootstrap. Ensuite, ``xhydro.frequency_analysis.uncertainties.calculate_quantiles_over_boostraped_groups`` est utilisé pour calculer les périodes de retour à partir de ces L-moments.

source: b) Using multiple regions
fr: b) Utilisation de plusieurs régions

source: Another approach to estimating uncertainty is by considering multiple regions for a single catchment of interest. This can be done by applying different clustering methods or by performing a jackknife procedure on the station list. While this process can be computationally intensive, we present a simplified example here to illustrate the potential of this method. The main objective is to demonstrate how considering multiple regions can help in evaluating uncertainty in the regional frequency analysis.
fr: Une autre approche pour estimer l'incertitude consiste à considérer plusieurs régions pour un bassin versant d'intérêt. Cela peut être réalisé en appliquant différentes méthodes de clustering ou en effectuant une procédure de jackknife sur la liste des stations. Comme ce processus peut être intensif en termes de calcul, nous présentons ici un exemple simplifié pour illustrer le potentiel de cette méthode. L'objectif principal est de démontrer comment la prise en compte de plusieurs régions peut aider à évaluer l'incertitude dans l'analyse fréquentielle régionale.

source: First, we will use ``xhydro.frequency_analysis.uncertainties.generate_combinations`` on the results from our PCA to generate lists of stations. This function creates combinations that exclude a certain number of stations each time, allowing us to evaluate how the exclusion of different stations impacts the groupings.
fr: Tout d'abord, nous utiliserons ``xhydro.frequency_analysis.uncertainties.generate_combinations`` sur les résultats de notre ACP pour générer des listes de stations. Cette fonction crée des combinaisons qui excluent un certain nombre de stations à chaque fois, nous permettant ainsi d'évaluer comment l'exclusion de différentes stations affecte les regroupements.
