Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/regional_frequency_analysis.po
Languages: fr

source: Next, we will combine those lists with three clustering methods and, for each method, we'll try to change some of the parameters.
fr: Ensuite, nous combinerons ces listes avec trois méthodes de clustering et, pour chaque méthode, nous essaierons de modifier certains des paramètres.

source: The next steps follow a similar approach to the previous ones, but now with multiple regions.
fr: Les étapes suivantes suivent une approche similaire à celles précédentes, mais maintenant avec plusieurs régions.

source: c) Combining the bootstrap with multiple regions
fr: c) Combinaison du bootstrap avec plusieurs régions

source: It is possible to combine both methods—bootstrapping and multiple regions—by integrating the following:
fr: Il est possible de combiner les deux méthodes—bootstrap et plusieurs régions—en intégrant les éléments suivants :

source: Bootstrapped L-moments from ``xhydro.frequency_analysis.uncertainties.calc_moments_iter``.
fr: Les L-moments bootstrapés de ``xhydro.frequency_analysis.uncertainties.calc_moments_iter``.

source: Masked results from ``xhydro.frequency_analysis.regional.group_ds_by_regions`` that have been filtered based on the H and Z-Scores.
fr: Les résultats masqués de ``xhydro.frequency_analysis.regional.group_ds_by_regions`` qui ont été filtrés en fonction des scores H et Z.

source: When combining these methods, ``xhydro.frequency_analysis.uncertainties.calculate_quantiles_over_boostraped_groups`` will check in how many distinct ``region_id`` values the station is present and will stack the data accordingly with the bootstrap samples. For instance, if we have 35 bootstraps and roughly 220 regions, this will generate a total of around 7,700 samples for further analysis.
fr: Lors de la combinaison de ces méthodes, ``xhydro.frequency_analysis.uncertainties.calculate_quantiles_over_boostraped_groups`` vérifiera dans combien de valeurs distinctes de ``region_id`` la station est présente et empilera les données en conséquence avec les échantillons de bootstrap. Par exemple, si nous avons 35 bootstraps et environ 220 régions, cela générera un total d'environ 7 700 échantillons pour l'analyse ultérieure.

source: d) Comparison
fr: d) Comparaison

source: Let's show the difference between approaches.
fr: Illustrons la différence entre les approches.
