Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/use_case.po
Languages: fr

source: There are many ways to create the ensemble itself. If using a dictionary of datasets, the key will be used to name each element of the new ``realization`` dimension. This can be very useful when performing more detailed analyses or when wanting to weight the different models based, for example, on the number of available simulations. In our case, since we only wish to compute ensemble statistics, we can keep it simpler and provide a list.
fr: Il existe plusieurs façons de créer l'ensemble lui-même. Si vous utilisez un dictionnaire de jeux de données, la clé sera utilisée pour nommer chaque élément de la nouvelle dimension ``realization``. Cela peut être très utile lors de l'exécution d'analyses plus détaillées ou lorsqu'on souhaite pondérer les différents modèles en fonction, par exemple, du nombre de simulations disponibles. Dans notre cas, puisque nous ne souhaitons calculer que des statistiques d'ensemble, nous pouvons le garder plus simple et fournir une liste.
