Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/notebooks/use_case.po
Languages: fr

source: Use Case Example
fr: Exemple complet d'utilisation

source: This example illustrates a use case that covers the essential steps involved in building a hydrological model and conducting a climate change analysis:
fr: Cet exemple illustre un cas d'utilisation qui couvre les étapes principales impliquées dans la construction d'un modèle hydrologique et la réalisation d'une analyse du changement climatique:

source: **Identification of the watershed and its key characteristics**
fr: **Identification du bassin versant et de ses caractéristiques principales**

source: Beaurivage watershed in Southern Quebec, at the location of the 023401 streamflow gauge.
fr: Le bassin versant de la rivière Beaurivage dans le sud du Québec, à l'emplacement de la jauge de débit 023401.

source: **Collection of observed data**
fr: **Collection de données observées**

source: ERA5-Land and streamflow gauge data.
fr: ERA5-Land et données de débit.

source: **Preparation and calibration of the hydrological model**
fr: **Préparation et calage du modèle hydrologique**

source: GR4JCN emulated by the Raven hydrological framework.
fr: GR4JCN émulé par le cadre hydrologique de Raven.

source: **Calculation of hydrological indicators**
fr: **Calcul des indicateurs hydrologiques**

source: Mean summer flow
fr: Débit moyen en été

source: Mean monthly flow
fr: Débit mensuel moyen

source: 20- and 100-year maximum flow
fr: Débit maximum de 20 et 100 ans

source: 2-year minimum 7-day average summer flow
fr: Débit minimal en été, moyenné sur 7 jours, récurrence de 2 ans

source: **Assessment of the impact of climate change**
fr: **Évaluation de l'impact du changement climatique**

source: Bias-adjusted CMIP6 simulations from the ESPO-G6-R2 dataset
fr: Simulations CMIP6 post-traitées de l'ensemble de données ESPO-G6-R2

source: Identification of a watershed and its characteristics
fr: Identification d'un bassin versant et de ses caractéristiques

source: For more information on this section and available options, consult the `GIS module page <https://xhydro.readthedocs.io/en/latest/notebooks/gis.html#GIS-module>`__.
fr: Pour plus d'informations sur cette section et les options disponibles, consultez la `Page du module GIS <https://xhydro.readthedocs.io/en/latest/notebooks/gis.html#GIS-module>`__.

source: This first step is highly dependent on the hydrological model. Since we will use GR4JCN in our example, we need to obtain the drainage area, centroid coordinates, and elevation. We'll also need the watershed delineation to extract the meteorological data.
fr: Cette première étape dépend fortement du modèle hydrologique. Puisque nous utiliserons GR4JCN dans notre exemple, nous devons obtenir l'aire de drainage, les coordonnées du centroïde et l'altitude. Nous aurons également besoin de la délimitation du bassin versant pour extraire les données météorologiques.

source: Delineation of the watershed and basic characteristics: ``xhydro.gis.watershed_delineation`` and ``xhydro.gis.watershed_properties``
fr: Délimitation du bassin versant et caractéristiques de base :``xhydro.gis.watershed_delineation`` et``xhydro.gis.watershed_properties``

source: Elevation: ``xhydro.gis.surface_properties``
fr: Élévation: ``xhydro.gis.surface_properties``

source: Showing ``m`` will output this map: |image.png|
fr: Illustrer ``m`` sortira cette carte: |image.png|

source: We'll keep the necessary information and format it for GR4JCN.
fr: Nous conserverons les informations nécessaires et les formaterons pour GR4JCN.

source: Since ``xhgis.watershed_delineation`` extracts the nearest HydroBASINS polygon, the watershed might not exactly correspond to the requested coordinates. The 023401 streamflow gauge as an associated drainage area of 708 km², which differs from our results. Streamflow will have to be adjusted using an area scaling factor.
fr: Puisque ``xhgis.watershed_delineation`` extrait le polygone HydroBASINS le plus proche, le bassin versant pourrait ne pas correspondre exactement aux coordonnées demandées. Le jauge de débit 023401 a une aire de drainage associée de 708 km², ce qui diffère de nos résultats. Le débit devra être ajusté en utilisant un facteur de mise à l'échelle de la zone.

source: Collection of observed data
fr: Collecte de données observées

source: Meteorological data
fr: Données météorologiques

source: Multiple libraries could be used to perform these steps. For simplicity, this example will use the ```subset`` <https://xscen.readthedocs.io/en/latest/notebooks/2_getting_started.html#Defining-the-region>`__ and ```aggregate`` modules of the xscen <https://xscen.readthedocs.io/en/latest/notebooks/2_getting_started.html#Spatial-mean>`__ library.
fr: Plusieurs libraries pourraient être utilisées pour effectuer ces étapes. Par simplicité, cet exemple utilisera les modules ```subset``<https://xscen.readthedocs.io/en/latest/notebooks/2_getting_started.html#Defining-the-region>`__ et ```aggregate`` du module xscen<https://xscen.readthedocs.io/en/latest/notebooks/2_getting_started.html#Spatial-mean>`__.

source: This example will use daily ERA5-Land data hosted on the PAVICS platform.
fr: Cet exemple utilisera les données quotidiennes ERA5-Land hébergées sur la plate-forme PAVICS.

source: That dataset covers the entire globe and has more than 70 years of data. The first step will thus be to subset the dataset both spatially and temporally. For the spatial subset, the GeoDataFrame obtained earlier can be used.
fr: Ce jeu de données couvre le globe en entier et dispose de plus de 70 ans de données. La première étape sera donc de couper les données à la fois spatialement et temporellement. Pour le sous-ensemble spatial, le GeoDataFrame obtenu plus tôt peut être utilisé.

source: Since GR4JCN is a lumped model, we need to average the meteo over the watershed. This will be accomplished using ``xscen.spatial_mean``. Multiple methods exist, but for shapefiles, the most accurate is "xesmf", which calls upon `xESMF's SpatialAverager <https://pangeo-xesmf.readthedocs.io/en/latest/notebooks/Spatial_Averaging.html>`__ to accurately follow each grid cell's representation over the polygon. It can be very slow for detailed polygons with lots of vertices, but the "simplify_tolerance" argument helps speed up that process.
fr: Puisque GR4JCN est un modèle global, nous devons moyenner les données météorologiques sur le bassin versant. Cela sera accompli en utilisant ``xscen.spatial_mean``. Plusieurs méthodes existent, mais pour les shapefiles, la plus précise est "xesmf", qui fait appel à `xESMF's SpatialAverager <https://pangeo-xesmf.readthedocs.io/en/latest/notebooks/Spatial_Averaging.html>`__ pour suivre avec précision la représentation de chaque cellule de grille sur le polygone. Cela peut être très lent pour les polygones détaillés avec beaucoup de sommets, mais l'argument "simplify_tolerance" aide à accélérer ce processus.

source: Raven expects temperatures in Celsius and precipitation in millimetres, but they currently are in CF-compliant Kelvin and kg m-2 s-1, respectively. Once again, ``xscen`` can be used for that operation.
fr: Raven s'attend à des températures en Celsius et à des précipitations en millimètres, mais ils sont actuellement dans Kelvin et kg m-2 s-1, conformément au conventions CF. Encore une fois, ``xscen`` peut être utilisé pour cette opération.

source: Hydrometric data
fr: Données hydrométriques

source: Gauge streamflow data from the Quebec government can be accessed through the ``xdatasets`` library.
fr: Les données de débit du gouvernement du Québec sont accessibles via la librairie `xdatasets``.

source: As specified earlier, streamflow observations need to be modified to account for the differences in watershed sizes between the gauge and the polygon.
fr: Comme spécifié précédemment, les observations de débit doivent être modifiées pour tenir compte des différences de tailles de bassin versant entre la jauge et le polygone.

source: Preparation and calibration of the hydrological model (xhydro.modelling)
fr: Préparation et calage du modèle hydrologique (xhydro.modelling)

source: For more information on this section and available options, consult the `Hydrological modelling module page <https://xhydro.readthedocs.io/en/latest/notebooks/hydrological_modelling.html>`__.
fr: Pour plus d'informations sur cette section et les options disponibles, consultez la page du module de `modélisation hydrologique <https://xhydro.readthedocs.io/en/latest/notebooks/hydrological_modelling.html>`__.

source: The ``perform_calibration`` function requires a ``model_config`` argument that allows it to build the corresponding hydrological model. All the required information has been acquired in previous sections, so it is only a matter of filling in the entries of the RavenPy/GR4JCN model.
fr: La fonction ``perform_calibration`` nécessite un argument ``model_config`` qui lui permet de construire le modèle hydrologique correspondant. Toutes les informations requises ont été acquises dans les sections précédentes, il s'agit donc seulement de remplir les entrées du modèle RavenPy/GR4JCN.

source: For simplification matters, the meteorological station's elevation will be set as the real watershed's average elevation. Computing grid cell elevation in ERA5-Land is not always trivial and is not within the scope of this example. Similarly, snow water equivalent is not currently available on PAVICS' database, so "AVG_ANNUAL_SNOW" was roughly estimated using `Brown & Brasnett (2010) <https://ccin.ca/ccw/snow/overview/references>`__.
fr: Pour des raisons de simplification, l'altitude de la station météorologique sera définie comme l'altitude moyenne du bassin versant réel. Le calcul de l'altitude des cellules dans ERA5-Land n'est pas toujours trivial et ne relève pas du cadre de cet exemple. De même, l'équivalent en eau de neige n'est pas actuellement disponible dans la base de données de PAVICS, donc "AVG_ANNUAL_SNOW" a été grossièrement estimé en utilisant `Brown & Brasnett (2010) <https://ccin.ca/ccw/snow/overview/references>`__.

source: To reduce computation times for this example, only 10 steps were used for the calibration function, which is well below the recommended number. The parameters below were obtained by running the code above with 150 evaluations.
fr: Pour réduire les temps de calcul pour cet exemple, seulement 10 étapes ont été utilisées pour la fonction de calage, ce qui est bien en dessous du nombre recommandé. Les paramètres ci-dessous ont été obtenus en exécutant le code ci-dessus avec 150 évaluations.

source: The real KGE should be computed from a validation period, using ``get_objective_function``.
fr: Le vrai KGE devrait être calculé à partir d'une période de validation, en utilisant ``get_objective_function``.

source: Calculation of hydroclimatological indicators
fr: Calcul des indicateurs hydroclimatologiques

source: Non-frequential indicators
fr: Indicateurs non fréquentiels

source: For more information on this section and available options, consult the `Climate change analysis page <https://xhydro.readthedocs.io/en/latest/notebooks/climate_change.html>`__.
fr: Pour plus d'informations sur cette section et les options disponibles, consultez la `Page d'analyse du changement climatique <https://xhydro.readthedocs.io/en/latest/notebooks/climate_change.html>`__.

source: Custom indicators in ``xHydro`` are built by following the YAML formatting required by ``xclim``.
fr: Les indicateurs personnalisés dans ``xHydro`` sont créés en suivant le format YAML requis par ``xclim``.

source: A custom indicator built using ``xclim.core.indicator.Indicator.from_dict`` will need these elements:
fr: Un indicateur personnalisé créé en utilisant ``xclim.core.indicator.Indicator.from_dict`` aura besoin de ces éléments :

source: "data": A dictionary with the following information:
fr: "data": Un dictionnaire contenant les informations suivantes :

source: "base": The "YAML ID" obtained from `here <https://xclim.readthedocs.io/en/stable/indicators.html>`__.
fr: "base": Le "YAML ID" obtenu depuis `ce lien <https://xclim.readthedocs.io/en/stable/indicators.html>`__.

source: "input": A dictionary linking the default xclim input to the name of your variable. Needed only if it is different. In the link above, they are the string following "Uses:".
fr: "input": Un dictionnaire liant l'entrée par défaut d'xclim au nom de votre variable. Nécessaire uniquement si elle est différente. Dans le lien ci-dessus, ce sont les chaînes qui suivent "Uses:".

source: "parameters": A dictionary containing all other parameters for a given indicator. In the link above, the easiest way to access them is by clicking the link in the top-right corner of the box describing a given indicator.
fr: "parameters": Un dictionnaire contenant tous les autres paramètres pour un indicateur donné. Dans le lien ci-dessus, la façon la plus simple d'y accéder est en cliquant sur le lien dans le coin supérieur droit de la boîte décrivant un indicateur donné.

source: More entries can be used here, as described `in the xclim documentation <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__ under "<identifier>".
fr: D'autres entrées peuvent être utilisées ici, comme décrit `dans la documentation xclim <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__ sous "<identifier>".

source: "identifier": A custom name for your indicator. This will be the name returned in the results.
fr: "identifier": Un nom personnalisé pour votre indicateur. Ce sera le nom retourné dans les résultats.

source: "module": Needed, but can be anything. To prevent an accidental overwriting of ``xclim`` indicators, it is best to use something different from: ["atmos", "land", "generic"].
fr: "module": Nécessaire, mais peut être n'importe quoi. Pour éviter un écrasement accidentel des indicateurs ``xclim``, il est préférable d'utiliser quelque chose de différent de : ["atmos", "land", "generic"].

source: For a climate change impact analysis, the typical process to compute non-frequential indicators would be to:
fr: Pour une analyse des impacts du changement climatique, le processus typique pour calculer les indicateurs non fréquentiels serait de :

source: Define the indicators either through the ``xclim`` functionalities shown below or through a `YAML file <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__.
fr: Définir les indicateurs soit via les fonctionnalités ``xclim`` montrées ci-dessous, soit via un fichier `YAML <https://xclim.readthedocs.io/en/latest/api.html#yaml-file-structure>`__.

source: Call ``xhydro.indicators.compute_indicators``, which would produce annual results through a dictionary, where each key represents the requested frequencies.
fr: Appeler ``xhydro.indicators.compute_indicators``, ce qui produira des résultats annuels sous forme de dictionnaire, où chaque clé représente les fréquences demandées.

source: Call ``xhydro.cc.climatological_op`` on each entry of the dictionary to compute the 30-year average.
fr: Appeler ``xhydro.cc.climatological_op`` sur chaque entrée du dictionnaire pour calculer la moyenne sur 30 ans.

source: Recombine the datasets.
fr: Recombiner les jeux de données.

source: However, if the annual results are not required, ``xhydro.cc.produce_horizon`` can bypass steps 2 to 4 and alleviate a lot of hassle. It accomplishes that by removing the ``time`` axis and replacing it for a ``horizon`` dimension that represents a slice of time. In the case of seasonal or monthly indicators, a corresponding ``season`` or ``month`` dimension is also added.
fr: Cependant, si les résultats annuels ne sont pas nécessaires, ``xhydro.cc.produce_horizon`` peut contourner les étapes 2 à 4 et éviter beaucoup de tracas. Cela est accompli en supprimant l'axe ``time`` et en le remplaçant par une dimension ``horizon`` qui représente un segment de temps. Dans le cas des indicateurs saisonniers ou mensuels, une dimension correspondante ``season`` ou ``month`` est également ajoutée.

source: We will compute the mean summer flow (an annual indicator) and mean monthly flows.
fr: Nous allons calculer le débit moyen estival (un indicateur annuel) et les débits mensuels moyens.

source: Frequency analysis
fr: Analyse fréquencielle

source: For more information on this section and available options, consult the `Local frequency analysis page <https://xhydro.readthedocs.io/en/latest/notebooks/local_frequency_analysis.html>`__.
fr: Pour plus d'informations sur cette section et les options disponibles, consultez la `Page d'analyse fréquencielle locale <https://xhydro.readthedocs.io/en/latest/notebooks/local_frequency_analysis.html>`__.

source: A frequency analysis typically follows these steps:
fr: Une analyse fréquentielle suit généralement ces étapes :

source: Get the raw data needed for the analysis, such as annual maximums, through ``xhydro.indicators.get_yearly_op``.
fr: Obtenir les données brutes nécessaires à l'analyse, telles que les maximums annuels, via ``xhydro.indicators.get_yearly_op``.

source: Call ``xhfa.local.fit`` to obtain the parameters for a specified number of distributions, such as Gumbel, GEV, and Pearson-III.
fr: Appeler ``xhfa.local.fit`` pour obtenir les paramètres d'un nombre spécifié de distributions, telles que Gumbel, GEV et Pearson-III.

source: (Optional) Call ``xhfa.local.criteria`` to obtain goodness-of-fit parameters.
fr: (Facultatif) Appeler ``xhfa.local.criteria`` pour obtenir les paramètres de qualité d'ajustement.

source: Call ``xhfa.local.parametric_quantiles`` to obtain the return levels.
fr: Appeler ``xhfa.local.parametric_quantiles`` pour obtenir les niveaux de retour.

source: We will compute the 20 and 100-year annual maximums, as well as the 2-year minimum 7-day summer flow.
fr: Nous allons calculer les maximums annuels sur 20 et 100 ans, ainsi que le débit minimum estival sur 7 jours pour 2 ans.

source: While not foolproof, the best fit can be identified using the Bayesian Information Criteria.
fr: Bien que non infaillible, le meilleur ajustement peut être identifié en utilisant le Critère d'Information Bayésien.

source: Plotting functions will eventually come to ``xhydro.frequency_analysis``, but they currently are a work-in-progress and are hidden by default. Until a public function is added to the library, they can still be called to illustrate the results.
fr: Les fonctions de tracé arriveront éventuellement dans ``xhydro.frequency_analysis``, mais elles sont actuellement en cours de développement et sont cachées par défaut. En attendant qu'une fonction publique soit ajoutée à la librairie, elles peuvent quand même être appelées pour illustrer les résultats.

source: Future streamflow simulations and indicators
fr: Simulations et indicateurs de débit futurs

source: Future meteorological data
fr: Données météorologiques futures

source: Now that we have access to a calibrated hydrological model and historical indicators, we can perform the climate change analysis. This example will use a set of CMIP6 models that have been bias adjusted using ERA5-Land, for consistency with the reference product. Specifically, we will use the ESPO-G6-R2 dataset, also hosted on PAVICS. While it is recommended to use multiple emission scenarios, this example will only use the SSP2-4.5 simulations from 14 climate models.
fr: Maintenant que nous avons accès à un modèle hydrologique calé et à des indicateurs historiques, nous pouvons réaliser l'analyse du changement climatique. Cet exemple utilisera un ensemble de modèles CMIP6 qui ont été ajustés à l'aide de ERA5-Land, pour assurer la cohérence avec le produit de référence. Plus précisément, nous utiliserons l'ensemble de données ESPO-G6-E5L, également hébergé sur PAVICS. Bien qu'il soit recommandé d'utiliser plusieurs scénarios d'émission, cet exemple utilisera uniquement les simulations SSP2-4.5 de 14 modèles climatiques.

source: We can mostly reuse the same code as above. One difference is that climate models often use custom calendars that need to be converted back to standard ones. Once again, ``xscen`` can be used for that.
fr: Nous pouvons principalement réutiliser le même code que ci-dessus. Une différence est que les modèles climatiques utilisent souvent des calendriers non standards qui doivent être convertis. Encore une fois, ``xscen`` peut être utilisé pour cela.

source: The code below will showcase how to proceed with the first simulation, but it could be looped to process all 14.
fr: Le code ci-dessous montrera comment procéder avec la première simulation, mais il pourrait être bouclé pour traiter les 14.

source: Future streamflow data and indicators
fr: Données et indicateurs de débit futurs

source: Once again, the same code as before can be roughly reused here, but with ``xhydro.modelling.hydrological_model``. The main difference is that the best parameters can be used when setting up the hydrological model, and that the dates are the full range going to 2100.
fr: Encore une fois, le même code qu'auparavant peut être grosso modo réutilisé ici, mais avec ``xhydro.modelling.hydrological_model``. La principale différence est que les meilleurs paramètres peuvent être utilisés lors de la configuration du modèle hydrologique, et que les dates couvrent toute la période jusqu'en 2100.

source: Indicators are also computed similarly, with the addition of using a list of periods in the ``periods`` argument to create a ``horizon`` dimension, instead of a single period. The ``xhydro.frequency_analysis.fit`` function can also accept a ``periods`` argument.
fr: Les indicateurs sont également calculés de manière similaire, avec l'ajout de l'utilisation d'une liste de périodes dans l'argument ``periods`` pour créer une dimension ``horizon``, au lieu d'une seule période. La fonction ``xhydro.frequency_analysis.fit`` peut également accepter un argument ``periods``.

source: The code below will once again only showcase the first simulation, but could be used to process all 14.
fr: Le code ci-dessous ne présentera à nouveau que la première simulation, mais pourrait être utilisé pour traiter les 14.

source: Climate change impacts
fr: Impacts du changement climatique

source: This example will keep the climate change analysis fairly simple.
fr: Cet exemple maintiendra l'analyse du changement climatique assez simple.

source: Compute the difference between the future and reference periods using ``xhydro.cc.compute_deltas``.
fr: Calculer la différence entre le futur et la période de référence à l'aide de ``xhydro.cc.compute_deltas``.

source: Use those differences to compute ensemble statistics using ``xhydro.cc.ensemble_stats``: ensemble percentiles and agreement between the climate models.
fr: Utiliser ces différences pour calculer les statistiques d'ensemble à l'aide de ``xhydro.cc.ensemble_stats`` : les percentiles d'ensemble et l'accord entre les modèles climatiques.
