Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/installation.po
Languages: fr

source: We strongly recommend installing `xHydro` in an Anaconda Python environment. Furthermore, due to the complexity of some packages, the default dependency solver can take a long time to resolve the environment. If `mamba` is not already your default solver, consider running the following commands in order to speed up the process:
fr: Nous recommandons fortement d'installer `xHydro` dans un environnement Python Anaconda. De plus, en raison de la complexité de certaines librairies, le solveur de dépendances par défaut peut prendre beaucoup de temps pour résoudre l'environnement. Si `mamba` n'est pas déjà votre solveur par défaut, nous vous conseillons d'exécuter les commandes suivantes pour accélérer le processus :

source: If you don't have `pip`_ installed, this `Python installation guide`_ can guide you through the process.
fr: Si vous n'avez pas `pip`_ installé, ce `guide d'installation Python`_ peut vous aider à traverser le processus.

source: Some libraries used by `xHydro` or its dependencies may not function correctly unless the appropriate environment is activated. To avoid potential issues, it is **strongly recommended** to always activate your environment before running any Python code. You can do this with the following command:
fr: Certaines librairies utilisées par `xHydro` ou ses dépendances peuvent ne pas fonctionner correctement si l’environnement approprié n’est pas activé. Pour éviter tout problème potentiel, il est **fortement recommandé** d’activer systématiquement votre environnement avant d’exécuter du code Python. Vous pouvez le faire avec la commande suivante :

source: This recommendation also applies to certain GUI applications, such as PyCharm, which may not automatically activate the project environment. In such cases, be sure to activate the environment before launching the application.
fr: Cette recommandation s’applique également à certaines applications avec interface graphique, comme PyCharm, qui n’activent pas automatiquement l’environnement du projet. Dans ce cas, veillez à activer l’environnement avant de lancer l’application.

source: On Windows, this can be done by running the command above in the *Anaconda Prompt*, and then launching the application from that same prompt. Alternatively, you can launch the application via *Anaconda Navigator*, ensuring the correct environment is selected beforehand.
fr: Sur Windows, cela peut être fait en exécutant la commande ci-dessus dans *Anaconda Prompt*, puis en lançant l’application depuis cette même fenêtre. Vous pouvez également lancer l’application via *Anaconda Navigator*, en veillant à ce que le bon environnement soit sélectionné au préalable.

source: Stable release (Anaconda)
fr: Version stable (Anaconda)

source: Some of the dependencies of `xHydro` can be difficult to install using `pip`. For this reason, we strongly recommend installing `xHydro` using Anaconda. This will ensure that all dependencies are met and that the package will work as expected.
fr: Certaines dépendances de `xHydro` peuvent être difficiles à installer avec `pip`. C’est pourquoi nous recommandons fortement d’installer `xHydro` via Anaconda. Cela garantira que toutes les dépendances sont satisfaites et que le paquet fonctionnera correctement.

source: This will install the latest stable release of `xHydro` with all its dependencies, with two exception:
fr: Cela installera la dernière version stable de `xHydro` avec toutes ses dépendances, à deux exceptions près :

source: If you wish to use the `extreme_value_analysis` module, which relies on the `Extremes.jl`_ Julia package, you will need to install the `julia` extra:
fr: Si vous souhaitez utiliser le module `extreme_value_analysis`, qui repose sur le package `Extremes.jl`_ de Julia, vous devrez installer l'extra `julia` :

source: If you wish to use the `frequency_analysis.regional` module, you will need to install the `lmoments3` library yourself. This library is available on both `PyPI` or `conda-forge`, but has a restricted license. Note that if you installed `xHydro` using `conda`, you will need to install `lmoments3` using `conda` as well. If you installed `xHydro` using the `environment-dev.yml` file, `lmoments3` will have been added automatically.
fr: Si vous souhaitez utiliser le module `frequency_analysis.regional`, vous devrez installer vous-même la libaririe `lmoments3`. Celle-ci est disponible sur `PyPI` et `conda-forge`, mais elle est soumise à une licence restreinte. Notez que si vous avez installé `xHydro` via `conda`, vous devrez également installer `lmoments3` via `conda`. Si vous avez installé `xHydro` en utilisant le fichier `environment-dev.yml`, `lmoments3` aura été ajouté automatiquement.

source: Stable release (PyPI)
fr: Version stable (PyPI)

source: Although not recommended, you can also install `xHydro` from `PyPI` using `pip`:
fr: Bien que cela ne soit pas recommandé, vous pouvez également installer `xHydro` depuis `PyPI` en utilisant `pip` :

source: Some dependencies of `xHydro` may not be fully functional when installed via `pip`. For example, packages like `xESMF` may require additional system-level configuration to work correctly.
fr: Certaines dépendances de `xHydro` peuvent ne pas être entièrement fonctionnelles lorsqu’elles sont installées via `pip`. Par exemple, des paquets comme `xESMF` peuvent nécessiter une configuration système supplémentaire pour fonctionner correctement.

source: The considerations mentioned above regarding the `extreme_value_analysis` and `frequency_analysis.regional` modules also apply to the `PyPI` installation, but with a few additional notes:
fr: Les considérations mentionnées ci-dessus concernant les modules `extreme_value_analysis` et `frequency_analysis.regional` s’appliquent également à l’installation via `PyPI`, avec quelques remarques supplémentaires :

source: The `julia` extra requires a working C++ compiler. Some users have reported segmentation faults when using the `juliacall` library with `xHydro` installed from `PyPI`, which we believe is due to the Julia environment not being launched with the correct C++ compiler. If you encounter this issue, we recommend using the `conda` installation method instead.
fr: L’extra `julia` nécessite un compilateur C++ fonctionnel. Certains utilisateurs ont signalé des erreurs de segmentation lors de l’utilisation de la librairie `juliacall` avec `xHydro` installé depuis `PyPI`, ce que nous pensons être dû au fait que l’environnement Julia n’est pas lancé avec un compilateur C++ adéquat. Si vous rencontrez ce problème, nous vous recommandons d’utiliser plutôt la méthode d’installation via `conda`.

source: The `raven` extra relies on the `ravenpy` and `raven-hydro` packages, which can be challenging to install in standard `pip` environments due to complex system-level dependencies. See the note below for more details. Unless you are familiar with the installation of these packages, we recommend using the `conda` installation method instead.
fr: L’extra `raven` dépend des librairies `ravenpy` et `raven-hydro`, qui peuvent être difficiles à installer dans des environnements `pip` standards en raison de dépendances complexes au niveau du système. Consultez la note ci-dessous pour plus de détails. À moins d’être familier avec l’installation de ces librairies, nous recommandons d’utiliser plutôt la méthode d’installation via `conda`.

source: We have not currently done extensive testing for installing the `raven` extra using `pip`, but the following commands are known to work on some Linux systems:
fr: Nous n’avons pas encore effectué de tests approfondis pour l’installation de l’extra `raven` via `pip`, mais les commandes suivantes sont connues pour fonctionner sur certains systèmes Linux :

source: This will install `ravenpy` and `raven-hydro` from `PyPI`. Alternatively, you can replace the last line and install `ravenpy` only, provided that you have your own Raven executable. For further guidance on installing these packages, refer to the official documentation of `ravenpy`_ and `raven-hydro`_.
fr: Cela installera `ravenpy` et `raven-hydro` depuis `PyPI`. Vous pouvez aussi remplacer la dernière ligne et installer uniquement `ravenpy`, à condition d’avoir votre propre exécutable Raven. Pour plus d’informations sur l’installation de ces paquets, consultez la documentation officielle de `ravenpy`_ et `raven-hydro`_.

source: On **Windows**, installing all the dependencies for `ravenpy` may require Administrator privileges, as some packages must be added to the system `PATH`. If you encounter issues, consider using the `Anaconda` installation method instead.
fr: Sur **Windows**, l’installation de toutes les dépendances pour `ravenpy` peut nécessiter des privilèges administrateur, car certains paquets doivent être ajoutés au `PATH` du système. En cas de problème, envisagez d’utiliser plutôt la méthode d’installation via `Anaconda`.

source: From sources
fr: Depuis les sources

source: `xHydro` is still under active development and the latest features might not yet be available on `PyPI` or `conda-forge`. If you want to use the latest features, or if you want to contribute to the development of `xHydro`, you can install it from the sources.
fr: `xHydro` est toujours en développement actif et les dernières fonctionnalités peuvent ne pas être encore disponibles sur `PyPI` ou `conda-forge`. Si vous voulez utiliser les dernières fonctionnalités, ou si vous souhaitez contribuer au développement de `xHydro`, vous pouvez l'installer depuis les sources.

source: The sources for xHydro can be downloaded from the `Github repo`_.
fr: Les sources de xHydro peuvent être téléchargées depuis le `dépôt Github`_.

source: Download the source code from the `Github repo`_ using one of the following methods:
fr: Téléchargez le code source depuis le `dépôt Github`_ en utilisant l'une des méthodes suivantes :

source: Clone the public repository:
fr: Clonez le dépôt public :

source: Download the `tarball <https://github.com/hydrologie/xhydro/tarball/main>`_:
fr: Téléchargez l'archive `tarball <https://github.com/hydrologie/xhydro/tarball/main>`_ :

source: Once you have a copy of the source, you can install it with:
fr: Une fois que vous avez une copie des sources, vous pouvez l'installer avec :

source: If you are on Windows, replace the ``make dev`` command with the following:
fr: Si vous êtes sous Windows, remplacez la commande ``make dev`` par celle-ci :

source: Even if you do not intend to contribute to `xHydro`, we favor using `environment-dev.yml` over `environment.yml` because it includes additional packages that are used to run all the examples provided in the documentation. If for some reason you wish to install the `PyPI` version of `xHydro` into an existing Anaconda environment (*not recommended if requirements are not met*), only run the last command above.
fr: Bien que vous ne souhaitiez pas contribuer à `xHydro`, nous privilégions l'utilisation de `environment-dev.yml` plutôt que `environment.yml` car il inclut des librairies supplémentaires nécessaires pour exécuter tous les exemples fournis dans la documentation. Si, pour une raison quelconque, vous souhaitez installer la version `PyPI` de `xHydro` dans un environnement Anaconda existant (*non recommandé si les exigences ne sont pas remplies*), exécutez uniquement la dernière commande ci-dessus.

source: When new changes are made to the `Github repo`_, you can update your local copy using the following commands from the root of the repository:
fr: Lorsque de nouveaux changements sont apportés au `dépôt Github`_, vous pouvez mettre à jour votre copie locale en utilisant les commandes suivantes depuis la racine du dépôt :

source: These commands should work most of the time, but if big changes are made to the repository, you might need to remove the environment and create it again.
fr: Ces commandes devraient fonctionner dans la plupart des cas, mais si de gros changements sont apportés au dépôt, vous devrez peut-être supprimer l'environnement et le recréer.
