Repository: hydrologie/xhydro
Catalog: docs/locales/*/LC_MESSAGES/readme.po
Languages: fr

source: Conda-forge Build Version
fr: Version de construction Conda-forge

source: Documentation and Support
fr: Documentation et support

source: Documentation Status
fr: État de la documentation

source: Supported Python Versions
fr: Versions Python prises en charge

source: Open Source
fr: Source ouverte

source: License
fr: Licence

source: Coding Standards
fr: Normes de codage

source: pre-commit.ci Status
fr: État de pre-commit.ci

source: Development Status
fr: État du développement

source: Project Status: Active – The project has reached a stable, usable state and is being actively developed.
fr: Statut du projet : Actif – Le projet a atteint un état stable et utilisable et est en développement actif.

source: Build Status
fr: État de la construction

source: Hydrological analysis library built with xarray
fr: Librairie d'analyse hydrologique construite avec xarray

source: Free software: Apache-2.0
fr: Logiciel libre : Apache-2.0

source: Documentation: https://xhydro.readthedocs.io/en/latest/
fr: Documentation anglaise : https://xhydro.readthedocs.io/en/latest/

source: Features
fr: Fonctionnalités

source: Easily find and extract geospatial data from the Planetary Computer API and watershed boundaries from the HydroSHEDS API over any area of interest.
fr: Trouvez et extrayez facilement des données géospatiales depuis l'API Planetary Computer et les frontières des bassins versants depuis l'API HydroSHEDS sur n'importe quelle zone d'intérêt.

source: Calibrate and execute Hydrotel and Raven-emulated hydrological models.
fr: Calibrez et exécutez les modèles hydrologiques Hydrotel et émulés par Raven.

source: Perform optimal interpolation on hydrological data (daily streamflow and indices).
fr: Effectuez une interpolation optimale sur les données hydrologiques (débit quotidien et indices).

source: Compute hydrological indicators (e.g. n-day peak flow, annual maximum series, low flow, average flow, etc.) over custom date ranges.
fr: Calculez des indicateurs hydrologiques (par exemple, débit de crue sur n jours, série maximale annuelle, débit de base, débit moyen, etc.) sur des plages de dates personnalisées.

source: Perform frequency analyses on hydrological indicators using a variety of methods (e.g. Gumbel, GEV, etc.).
fr: Effectuez des analyses fréquentielles sur des indicateurs hydrologiques en utilisant diverses méthodes (par exemple, Gumbel, GEV, etc.).

source: Perform climate change impact analyses of hydrological data.
fr: Effectuez des analyses d'impact du changement climatique sur les données hydrologiques.

source: Credits
fr: Crédits

source: This package was created with Cookiecutter_ and the `Ouranosinc/cookiecutter-pypackage`_ project template.
fr: Cette libraire a été créée avec Cookiecutter_ et le modèle de projet `Ouranosinc/cookiecutter-pypackage`_.

source: This logo was designed by Élyse Fournier (@elysefounier) and Louise Arnal (@lou-a), with inputs from the `xHydro` team.
fr: Ce logo a été conçu par Élyse Fournier (@elysefounier) et Louise Arnal (@lou-a), avec la contribution de l'équipe `xHydro`.
